export default {
    locale: 'ar',
    country: 'EG',
    sysInfo: {
        sysIntro: 'إطار تطوير أمامي سهل الاستخدام يعتمد على تصميم Vue and Ant'
    },
    loginForm: {
        byAccountBtn: 'تسجيل الدخول بكلمة مرور الحساب',
        byPhoneBtn: 'تسجيل الدخول برقم الهاتف',
        accountPlaceholder: 'يرجى إدخال اسم المستخدم',
        passwordPlaceholder: 'يرجى إدخال كلمة المرور',
        autoLogin: 'تسجيل تلقائى',
        forgetBtn: 'نسيت كلمة المرور',
        loginBtn: 'تسجيل الدخول',
        byAccountTip: {
            emptyErr: 'لا يمكن أن يكون الحساب فارغًا'
        },
        byPasswordTip: {
            emptyErr: 'كلمة السر لا يمكن أن تترك فارغة'
        },
        byValidTip: {
            emptyErr: 'يجب ملء رمز التحقق'
        },
        sendMsg: {
            repeatErr: 'لا ترسل بشكل متكرر',
            success: 'أحصل على النجاح',
            codeTip: 'رمز التحقق الخاص بك هو'
        },
        phonePlaceholder: 'يرجى إدخال رقم الهاتف',
        validPlaceholder: 'كلمة التحقق',
        validBtn: 'الحصول على رمز التحقق',
        loginSuccess: 'نجح تسجيل الدخول'
    },
    requestInfo: {
        withoutUrl: 'لا يمكن أن يكون عنوان الطلب فارغًا',
        networkErr: 'فشل طلب الشبكة ، يرجى المحاولة مرة أخرى في وقت لاحق'
    },
    localeMap: {
        ar: 'عربى',
        bg: 'البلغارية',
        ca: 'الكاتالونية',
        cs: 'التشيكية',
        da: 'دانماركي',
        de: 'ألمانية',
        el: 'اليونانية',
        'en-gb': 'الإنجليزية',
        en: 'الإنجليزية',
        es: 'الأسبانية',
        et: 'الإستونية',
        fa: 'اللغة الفارسية',
        fi: 'الفنلندية',
        fr: 'فرنسي',
        he: 'اللغة العبرية',
        hi: 'هندي',
        hr: 'الكرواتية',
        hu: 'المجري',
        hy: 'أرمني',
        id: 'الإندونيسية',
        is: 'الآيسلندية',
        it: 'إيطالي ',
        ja: 'اليابانية',
        kn: 'الكانادا',
        ko: 'الكورية',
        'ku-iq': 'الكردية الوسطى',
        lv: 'الكردية الوسطى',
        mk: 'المقدونية',
        'mn-mn': 'المنغولية',
        'ms-my': 'لغة الملايو',
        nb: 'النرويجية',
        'ne-np': 'النيبالية',
        'nl-be': 'الفلمنكية',
        nl: 'هولندي',
        pl: 'تلميع',
        'pt-br': 'البرتغالية البرازيلية',
        pt: 'البرتغالية الأوروبية',
        ro: 'روماني',
        ru: 'اللغة الروسية',
        sk: 'السلوفاكية',
        sl: 'السلوفينية',
        sr: 'صربي',
        sv: 'السويدية',
        ta: 'التاميل',
        th: 'التايلاندية',
        tr: 'اللغة التركية',
        uk: 'الأوكرانية',
        vi: 'الفيتنامية',
        'zh-cn': 'الصينية المبسطة',
        'zh-tw': 'الصينية التقليدية'
    },
    menuObj: {
        basicFeature: 'القدرة الأساسية',
        cpUse: 'استخدام المكون',
        childMenu: {
            0: 'قدرات الإطار الأساسية',
            '0-0': 'وظيفة الإطار',
            '0-0-0': 'تكوين المشروع',
            '0-0-1': 'سجل الواجهة الأمامية',
            '0-0-2': 'وهمي محلي',
            '0-0-3': 'العولمة',
            '0-0-4': 'قاموس البيانات',
            '0-0-5': 'EventBus',
            '0-0-6': 'مجموعة الأدوات',
            '0-0-7': 'صلاحية التحكم صلاحية الدخول',
            '0-0-8': 'مفتاح ساخن',
            '0-1': 'وظيفة الصفحة',
            '0-1-0': 'صفحة المكون',
            '0-1-1': 'صفحة url',
            '0-1-2': 'لا توجد صفحة إذن',
            '0-1-3': '404 صفحة'
        },
        defaultMenu: {
            home: 'الصفحة الرئيسية'
        },
        errorTip: {
            notfoundTip: 'لم يتم العثور على مكون تحت هذا المسار',
            emptyErr: 'لم يتم تكوين مسار المكون'
        }
    },
    tagObj: {
        closeAll: 'أغلق جميع علامات التبويب',
        closeCur: 'أغلق علامة التبويب الحالية',
        closeOther: 'أغلق العلامات الأخرى',
        closeRight: 'أغلق التسمية اليمنى',
        singlePage: 'صفحة مستقلة',
        refreshPage: 'إعادة تحميل الصفحة',
        affixPage: 'الصفحة الثابتة',
        cancelAffixPage: 'إلغاء التثبيت',
        errorTip: {
            homePageCloseError: 'لا يسمح بإغلاق الصفحة الرئيسية',
            affixPageCloseError: 'لا يسمح بإغلاق الصفحة الثابتة',
            homePageAffixError: 'لا يمكن إلغاء تثبيت الصفحة الرئيسية'
        },
        checkSave: 'هل تريد إغلاق الصفحة؟(يرجى التأكد من حفظ محتوى صفحة التصنيف الأحمر)',
        cancelClose: 'تم إلغاء العملية المغلقة'
    },
    personalCenter: {
        frontendLog: 'سجل الواجهة الأمامية',
        customSetting: 'الإعدادات الشخصية',
        logout: 'خروج'
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'عذرا ، الصفحة التي زرتها غير موجودة',
            notrightTip: 'عذرا ، ليس لديك إذن للوصول إلى هذه الصفحة',
            noserviceTip: 'عذرًا ، حدث خطأ في الخادم ، يرجى المحاولة مرة أخرى لاحقًا'
        },
        btnText: 'أغلق الصفحة'
    }
}
