export default {
    locale: 'ar',
    country: 'EG',
    sysInfo: {
        sysIntro: 'إطار تطوير أمامي سهل الاستخدام يعتمد على تصميم Vue and Ant'
    },
    loginForm: {
        byAccountBtn: 'تسجيل الدخول بكلمة مرور الحساب',
        byPhoneBtn: 'تسجيل الدخول برقم الهاتف',
        accountPlaceholder: 'يرجى إدخال اسم المستخدم',
        passwordPlaceholder: 'يرجى إدخال كلمة المرور',
        autoLogin: 'تسجيل تلقائى',
        forgetBtn: 'نسيت كلمة المرور',
        loginBtn: 'تسجيل الدخول',
        byAccountTip: {
            emptyErr: 'لا يمكن أن يكون الحساب فارغًا'
        },
        byPasswordTip: {
            emptyErr: 'كلمة السر لا يمكن أن تترك فارغة'
        },
        byValidTip: {
            emptyErr: 'يجب ملء رمز التحقق'
        },
        sendMsg: {
            repeatErr: 'لا ترسل بشكل متكرر',
            success: 'أحصل على النجاح',
            codeTip: 'رمز التحقق الخاص بك هو'
        },
        phonePlaceholder: 'يرجى إدخال رقم الهاتف',
        validPlaceholder: 'كلمة التحقق',
        validBtn: 'الحصول على رمز التحقق',
        loginSuccess: 'نجح تسجيل الدخول'
    },
    requestInfo: {
        withoutUrl: 'لا يمكن أن يكون عنوان الطلب فارغًا',
        networkErr: 'فشل طلب الشبكة ، يرجى المحاولة مرة أخرى في وقت لاحق'
    },
    localeMap: {
        ar: 'عربى',
        bg: 'البلغارية',
        ca: 'الكاتالونية',
        cs: 'التشيكية',
        da: 'دانماركي',
        de: 'ألمانية',
        el: 'اليونانية',
        'en-gb': 'الإنجليزية',
        en: 'الإنجليزية',
        es: 'الأسبانية',
        et: 'الإستونية',
        fa: 'اللغة الفارسية',
        fi: 'الفنلندية',
        fr: 'فرنسي',
        he: 'اللغة العبرية',
        hi: 'هندي',
        hr: 'الكرواتية',
        hu: 'المجري',
        hy: 'أرمني',
        id: 'الإندونيسية',
        is: 'الآيسلندية',
        it: 'إيطالي ',
        ja: 'اليابانية',
        kn: 'الكانادا',
        ko: 'الكورية',
        'ku-iq': 'الكردية الوسطى',
        lv: 'الكردية الوسطى',
        mk: 'المقدونية',
        'mn-mn': 'المنغولية',
        'ms-my': 'لغة الملايو',
        nb: 'النرويجية',
        'ne-np': 'النيبالية',
        'nl-be': 'الفلمنكية',
        nl: 'هولندي',
        pl: 'تلميع',
        'pt-br': 'البرتغالية البرازيلية',
        pt: 'البرتغالية الأوروبية',
        ro: 'روماني',
        ru: 'اللغة الروسية',
        sk: 'السلوفاكية',
        sl: 'السلوفينية',
        sr: 'صربي',
        sv: 'السويدية',
        ta: 'التاميل',
        th: 'التايلاندية',
        tr: 'اللغة التركية',
        uk: 'الأوكرانية',
        vi: 'الفيتنامية',
        'zh-cn': 'الصينية المبسطة',
        'zh-tw': 'الصينية التقليدية'
    }
}
