export default {
    locale: 'ar',
    country: 'EG',
    loginForm: {
        byAccountBtn: 'تسجيل الدخول بكلمة مرور الحساب',
        byPhoneBtn: 'رقم تسجيل الدخول',
        accountPlaceholder: 'الرجاء إدخال اسم المستخدم',
        passwordPlaceholder: 'الرجاء إدخال كلمة المرور',
        autoLogin: 'تسجيل الدخول التلقائي',
        forgetBtn: 'نسيت كلمة المرور',
        loginBtn: 'تسجيل الدخول',
        byAccountTip: {
            emptyErr: 'لا يمكن أن يكون الحساب فارغًا'
        },
        byPasswordTip: {
            emptyErr: 'كلمة السر لا يمكن أن تترك فارغة'
        },
        byValidTip: {
            emptyErr: 'يجب ملء رمز التحقق'
        },
        sendMsg: {
            repeatErr: 'لا ترسل بشكل متكرر',
            success: 'ناجح',
            codeTip: 'رمز التحقق الخاص بك هو'
        },
        phonePlaceholder: 'الرجاء إدخال رقم الهاتف',
        validPlaceholder: 'رمز التحقق',
        validBtn: 'احصل على رمز التحقق',
        loginSuccess: 'تم تسجيل الدخول بنجاح'
    },
    menuObj: {
        basicFeature: 'القدرة الأساسية',
        cpUse: 'استخدام المكون',
        childMenu: {
            0: 'الإطار الأساسي',
            1: 'القدرة الأساسية',
            '0-0': 'Vue',
            '0-1': 'تصميم النمل',
            '0-2': 'بالقرب من Admin Vue',
            '1-0': 'وظيفة الإطار',
            '1-0-0': 'تكوين المشروع',
            '1-0-1': 'سجل الواجهة الأمامية',
            '1-0-2': 'المحلية وهمية',
            '1-0-3': 'العولمة',
            '1-0-4': 'قاموس البيانات',
            '1-0-5': 'EventBus',
            '1-0-6': 'مجموعة الأدوات',
            '1-0-7': 'صلاحية التحكم صلاحية الدخول',
            '1-0-8': 'مفتاح التشغيل السريع',
            '1-1': 'وظيفة الصفحة',
            '1-1-0': 'صفحة المكون',
            '1-1-1': 'صفحة url',
            '1-1-2': 'لا توجد صفحة إذن',
            '1-1-3': '404 صفحة'
        },
        errorTip: {
            notfoundTip: 'لم يتم العثور على المكون الموجود تحت هذا المسار',
            emptyErr: 'مسار المكون غير المكون'
        }
    },
    coreMenuObj: {
        defaultMenu: {
            home: 'الصفحة الرئيسية'
        }
    },
    sysInfo: {
        sysIntro: 'إطار تطوير مفيد للواجهة الأمامية والخلفية يعتمد على Vue و Ant Design'
    },
    requestInfo: {
        withoutUrl: 'لا يمكن أن يكون عنوان الطلب فارغًا',
        networkErr: 'فشل طلب الشبكة ، يرجى المحاولة مرة أخرى في وقت لاحق'
    },
    localeMap: {
        ar: 'عربى',
        bg: 'البلغارية',
        ca: 'الكاتالونية',
        cs: 'التشيكية',
        da: 'دانماركي',
        de: 'ألمانية',
        el: 'اليونانية',
        'en-gb': 'الإنجليزية',
        en: 'الإنجليزية',
        es: 'الأسبانية',
        et: 'الإستونية',
        fa: 'اللغة الفارسية',
        fi: 'الفنلندية',
        fr: 'فرنسي',
        he: 'اللغة العبرية',
        hi: 'هندي',
        hr: 'الكرواتية',
        hu: 'المجرية',
        hy: 'أرميني',
        id: 'الأندونيسية',
        is: 'آيسلندي',
        it: 'إيطالي ',
        ja: 'اليابانية',
        kn: 'الكانادا',
        ko: 'الكورية',
        'ku-iq': 'الكردية المركزية',
        lv: 'الكردية المركزية',
        mk: 'المقدونية',
        'mn-mn': 'المنغولية',
        'ms-my': 'لغة الملايو',
        nb: 'النرويجية',
        'ne-np': 'النيبالية',
        'nl-be': 'الفلمنكية',
        nl: 'هولندي',
        pl: 'تلميع',
        'pt-br': 'البرتغالية البرازيلية',
        pt: 'البرتغالية الأوروبية',
        ro: 'روماني',
        ru: 'اللغة الروسية',
        sk: 'السلوفاكية',
        sl: 'السلوفينية',
        sr: 'الصربية',
        sv: 'السويدية',
        ta: 'التاميل',
        th: 'التايلاندية',
        tr: 'اللغة التركية',
        uk: 'الأوكرانية',
        vi: 'فيتنامي',
        'zh-cn': 'الصينية المبسطة',
        'zh-tw': 'الصينية التقليدية'
    },
    tagObj: {
        closeAll: 'أغلق كل علامات التبويب',
        closeCur: 'اغلق التبويب الحالي',
        closeOther: 'أغلق علامات التبويب الأخرى',
        closeRight: 'إغلاق التسمية الصحيحة',
        singlePage: 'صفحة مستقلة',
        refreshPage: 'إعادة تحميل الصفحة',
        affixPage: 'صفحة الدبوس',
        cancelAffixPage: 'فك',
        errorTip: {
            homePageCloseError: 'الصفحة الرئيسية غير مسموح لها أن تغلق',
            affixPageCloseError: 'الصفحة الثابتة غير مسموح بإغلاقها',
            homePageAffixError: 'لا يمكن إلغاء تثبيت الصفحة الرئيسية'
        },
        checkSave: 'هل تريد إغلاق الصفحة؟(يرجى التأكد من حفظ محتوى الصفحة المميزة باللون الأحمر)',
        cancelClose: 'تم إلغاء عملية الإغلاق'
    },
    personalCenter: {
        frontendLog: 'سجل الواجهة الأمامية',
        customSetting: 'إضفاء الطابع الشخصي',
        customClean: 'تكوين واضح',
        cacheClean: 'إفراغ ذاكرة التخزين المؤقت',
        logout: 'خروج',
        errorTip: {
            cleanSuccess: 'إفراغ بنجاح'
        }
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'عذرا ، الصفحة التي زرتها غير موجودة',
            notrightTip: 'عذرا ، ليس لديك إذن للوصول إلى هذه الصفحة',
            noserviceTip: 'عذرا ، حدثت مشكلة في الخادم ، يرجى المحاولة مرة أخرى في وقت لاحق'
        },
        btnText: 'إغلاق الصفحة'
    },
    searchPanel: {
        btn: {
            search: 'استعلام',
            shrink: 'ضع بعيدا',
            reset: 'إعادة تعيين',
            unshrink: 'تتكشف'
        }
    },
    logline: {
        list: 'قائمة السجل',
        detail: 'تفاصيل السجل',
        btnList: {
            export: 'تصدير',
            remove: 'فارغة'
        },
        time: {
            plh: 'الرجاء تحديد نطاق زمني',
            range: 'المهلة',
            halfDay: 'نصف يوم',
            oneDay: 'في يوم واحد',
            weekDay: 'خلال أسبوع',
            monthDay: 'خلال شهر'
        },
        type: {
            logType: 'نوع السجل',
            plh: 'الرجاء تحديد نوع السجل'
        },
        tableColumns: {
            index: 'رقم سري',
            desc: 'وصف السجل',
            type: 'نوع السجل',
            time: 'زمن',
            op: 'التشغيل'
        },
        request: 'طلب البيانات',
        error: {
            cancel: 'تم إلغاء عملية فارغة',
            confirm: 'هل تريد مسح السجل؟(إذا تم إفراغ السجل ، فلا يمكن استرجاعه)'
        },
        success: 'تم إفراغ السجل'
    },
    comTable: {
        columns: {
            title: 'إعدادات العمود',
            all: 'اختر الكل',
            reset: 'إعادة تعيين',
            fixedLeft: 'ثابت اليسار',
            fixedRight: 'حق ثابت',
            cancelFixed: 'فك'
        },
        size: {
            title: 'ارتفاع الصف',
            small: 'ضيق',
            normal: 'في',
            large: 'عرض'
        },
        fullscreen: 'تكبير الشاشة',
        unFullscreen: 'إلغاء ملء الشاشة'
    },
    normalBtn: {
        detail: 'رأي'
    },
    setting: {
        customEntry: 'دخول سريع',
        systemSwitch: 'أعدادات النظام',
        isMock: 'سواء كانت وهمية',
        isHotKey: 'سواء مفتاح الاختصار',
        isBreadCrumb: 'سواء فتات الخبز',
        isCache: 'سواء لذاكرة التخزين المؤقت',
        isI18n: 'سواء للتدويل'
    },
    pagingInfo: {
        total: 'في المجموع',
        uint: 'مقالة - سلعة',
        items: 'تسجيل'
    }
}
