export default {
    locale: 'bg',
    country: 'BG',
    loginForm: {
        byAccountBtn: 'Вход за парола за акаунт',
        byPhoneBtn: 'Вход за номер на мобилен телефон',
        accountPlaceholder: 'моля, въведете акаунта',
        passwordPlaceholder: 'Моля, въведете парола',
        autoLogin: 'автоматично вписване',
        forgetBtn: 'Забравена парола',
        loginBtn: 'Влизам',
        byAccountTip: {
            emptyErr: 'Профилът не може да бъде празен'
        },
        byPasswordTip: {
            emptyErr: 'паролата не може да бъде празна'
        },
        byValidTip: {
            emptyErr: 'код за потвърждение трябва да бъде попълнен'
        },
        sendMsg: {
            repeatErr: 'Не изпращайте многократно',
            success: 'Успешен',
            codeTip: 'Вашият код за потвърждение е'
        },
        phonePlaceholder: 'Моля, въведете телефонен номер',
        validPlaceholder: 'Код за потвърждение',
        validBtn: 'получете код за потвърждение',
        loginSuccess: 'успешен вход'
    },
    menuObj: {
        basicFeature: 'Основна способност',
        cpUse: 'Използване на компоненти',
        childMenu: {
            0: 'Основна рамка',
            1: 'Основна способност',
            '0-0': 'Vue',
            '0-1': 'Ant Design',
            '1-0': 'Рамкова функция',
            '1-0-0': 'Конфигурация на проекта',
            '1-0-1': 'Frontend log',
            '1-0-2': 'Местен подигравка',
            '1-0-3': 'глобализация',
            '1-0-4': 'Речник на данните',
            '1-0-5': 'EventBus',
            '1-0-6': 'Toolset',
            '1-0-7': 'Контрол на достъпа',
            '1-0-8': 'горещ ключ',
            '1-1': 'Функция на страницата',
            '1-1-0': 'Страница на компонент',
            '1-1-1': 'страница на URL адреса',
            '1-1-2': 'Няма страница с разрешение',
            '1-1-3': '404 страница'
        },
        defaultMenu: {
            home: 'У дома'
        },
        errorTip: {
            notfoundTip: 'Компонентът под този път не бе намерен',
            emptyErr: 'Неконфигуриран път на компонента'
        }
    },
    sysInfo: {
        sysIntro: 'Лесна за използване средна и задна част на предния план за разработка, базирана на Vue и Ant Design'
    },
    requestInfo: {
        withoutUrl: 'Адресът на заявката не може да бъде празен',
        networkErr: 'Заявката за мрежата не бе успешна. Моля, опитайте отново по-късно'
    },
    localeMap: {
        ar: 'арабски',
        bg: 'български',
        ca: 'каталонски',
        cs: 'чешки',
        da: 'датски',
        de: 'Немски',
        el: 'Гръцки',
        'en-gb': 'Английски',
        en: 'Английски',
        es: 'испански',
        et: 'естонски',
        fa: 'персийски',
        fi: 'фински',
        fr: 'Френски',
        he: 'иврит',
        hi: 'хинди',
        hr: 'хърватски',
        hu: 'унгарски',
        hy: 'арменски',
        id: 'индонезийски',
        is: 'исландски',
        it: 'Италиански ',
        ja: 'японски',
        kn: 'канада',
        ko: 'корейски',
        'ku-iq': 'Централен кюрдски',
        lv: 'Централен кюрдски',
        mk: 'македонски',
        'mn-mn': 'монголски',
        'ms-my': 'малайски',
        nb: 'норвежки',
        'ne-np': 'непалски',
        'nl-be': 'фламандски',
        nl: 'холандски',
        pl: 'полски',
        'pt-br': 'Бразилски португалски',
        pt: 'Европейски португалски',
        ro: 'румънски',
        ru: 'руски език',
        sk: 'словашки',
        sl: 'словенски',
        sr: 'сръбски',
        sv: 'шведски',
        ta: 'тамилски',
        th: 'Thai',
        tr: 'Турски',
        uk: 'украински',
        vi: 'виетнамски',
        'zh-cn': 'Опростен китайски',
        'zh-tw': 'традиционен китайски'
    },
    tagObj: {
        closeAll: 'Затворете всички раздели',
        closeCur: 'Затваряне на текущия раздел',
        closeOther: 'Затворете други раздели',
        closeRight: 'Затворете десния етикет',
        singlePage: 'Независима страница',
        refreshPage: 'опресняване на страницата',
        affixPage: 'Пин страница',
        cancelAffixPage: 'Освобождаване',
        errorTip: {
            homePageCloseError: 'Не е разрешено затварянето на началната страница',
            affixPageCloseError: 'Не е разрешено затварянето на фиксирана страница',
            homePageAffixError: 'Началната страница не може да бъде открепена'
        },
        checkSave: 'Искате ли да затворите страницата?(Моля, уверете се, че съдържанието на страницата, маркирана в червено, е запазено)',
        cancelClose: 'Затварянето на операцията е отменено'
    },
    personalCenter: {
        frontendLog: 'Frontend log',
        customSetting: 'Персонализация',
        customClean: 'Изчистване на конфигурацията',
        logout: 'отписване',
        errorTip: {
            cleanSuccess: 'Празно се изпразва'
        }
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'За съжаление страницата, която сте посетили, не съществува',
            notrightTip: 'За съжаление нямате разрешение за достъп до тази страница',
            noserviceTip: 'За съжаление възникна проблем със сървъра. Моля, опитайте отново по-късно'
        },
        btnText: 'Затваряне на страницата'
    },
    searchPanel: {
        btn: {
            search: 'Запитване',
            shrink: 'Поставете',
            reset: 'Нулиране',
            unshrink: 'Разгънете'
        }
    },
    logline: {
        list: 'Дневник списък',
        detail: 'Детайли в дневника',
        btnList: {
            export: 'износ',
            remove: 'празен'
        },
        time: {
            plh: 'Моля, изберете времеви диапазон',
            range: 'краен срок',
            halfDay: 'Половин ден',
            oneDay: 'в един ден',
            weekDay: 'в рамките на седмица',
            monthDay: 'До месец'
        },
        type: {
            logType: 'Тип на дневника',
            plh: 'Моля, изберете типа журнал'
        },
        tableColumns: {
            index: 'Сериен номер',
            desc: 'Описание на дневника',
            type: 'Тип на дневника',
            time: 'път',
            op: 'експлоатационен'
        },
        request: 'Поискайте данни',
        error: {
            cancel: 'Празната операция е отменена',
            confirm: 'Искате ли да изчистите дневника?(Ако дневникът е изпразнен, той не може да бъде извлечен)'
        },
        success: 'Дневникът е изпразнен'
    },
    comTable: {
        columns: {
            title: 'Настройки на колоните',
            all: 'маркирай всичко',
            reset: 'Нулиране',
            fixedLeft: 'Фиксирана вляво',
            fixedRight: 'Фиксиран вдясно',
            cancelFixed: 'Освобождаване'
        },
        size: {
            title: 'Височина на реда',
            small: 'стесни',
            normal: 'в',
            large: 'широчина'
        },
        fullscreen: 'цял екран',
        unFullscreen: 'Отказ на цял екран'
    },
    normalBtn: {
        detail: 'изглед'
    },
    setting: {
        customEntry: 'Бързо влизане',
        systemSwitch: 'Системна конфигурация',
        isMock: 'Дали да се подиграват',
        isHotKey: 'Дали клавиш за бърз достъп',
        isBreadCrumb: 'Дали хлебни трохи',
        isCache: 'Дали да кеширате',
        isI18n: 'Дали да се интернационализира'
    }
}
