export default {
    locale: 'bg',
    country: 'BG',
    sysInfo: {
        sysIntro: 'Лесна за използване фронтална рамка за разработка, базирана на Vue и Ant Design'
    },
    loginForm: {
        byAccountBtn: 'Вход с парола за акаунт',
        byPhoneBtn: 'Вход за телефонен номер',
        accountPlaceholder: 'Моля, въведете потребителско име',
        passwordPlaceholder: 'Моля, въведете паролата',
        autoLogin: 'автоматично вписване',
        forgetBtn: 'Забравена парола',
        loginBtn: 'Влизане',
        byAccountTip: {
            emptyErr: 'Профилът не може да бъде празен'
        },
        byPasswordTip: {
            emptyErr: 'паролата не може да бъде празна'
        },
        byValidTip: {
            emptyErr: 'код за потвърждение трябва да бъде попълнен'
        },
        sendMsg: {
            repeatErr: 'Не изпращайте многократно'
        },
        phonePlaceholder: 'Моля, въведете телефонен номер',
        validPlaceholder: 'Captcha',
        validBtn: 'получете код за потвърждение'
    },
    localeMap: {
        ar: 'арабски',
        bg: 'български',
        ca: 'каталонски',
        cs: 'чешки',
        da: 'датски',
        de: 'Немски',
        el: 'Гръцки',
        'en-gb': 'Английски',
        en: 'Английски',
        es: 'испански',
        et: 'естонски',
        fa: 'персийски',
        fi: 'фински',
        fr: 'Френски',
        he: 'иврит',
        hi: 'хинди',
        hr: 'хърватски',
        hu: 'унгарски',
        hy: 'арменски',
        id: 'индонезийски',
        is: 'исландски',
        it: 'Италиански ',
        ja: 'японски',
        kn: 'канада',
        ko: 'корейски',
        'ku-iq': 'Централен кюрдски',
        lv: 'Централен кюрдски',
        mk: 'македонски',
        'mn-mn': 'монголски',
        'ms-my': 'малайски',
        nb: 'норвежки',
        'ne-np': 'непалски',
        'nl-be': 'фламандски',
        nl: 'холандски',
        pl: 'полски',
        'pt-br': 'Бразилски португалски',
        pt: 'Европейски португалски',
        ro: 'румънски',
        ru: 'руски език',
        sk: 'словашки',
        sl: 'словенски',
        sr: 'сръбски',
        sv: 'шведски',
        ta: 'тамилски',
        th: 'Thai',
        tr: 'Турски',
        uk: 'украински',
        vi: 'виетнамски',
        'zh-cn': 'Опростен китайски',
        'zh-tw': 'традиционен китайски'
    }
}
