export default {
    locale: 'bg',
    country: 'BG',
    sysInfo: {
        sysIntro: 'Лесна за използване фронтална рамка за разработка, базирана на Vue и Ant Design'
    },
    loginForm: {
        byAccountBtn: 'Вход с парола за акаунт',
        byPhoneBtn: 'Вход за телефонен номер',
        accountPlaceholder: 'Моля, въведете потребителско име',
        passwordPlaceholder: 'Моля, въведете паролата',
        autoLogin: 'автоматично вписване',
        forgetBtn: 'Забравена парола',
        loginBtn: 'Влизане',
        byAccountTip: {
            emptyErr: 'Профилът не може да бъде празен'
        },
        byPasswordTip: {
            emptyErr: 'паролата не може да бъде празна'
        },
        byValidTip: {
            emptyErr: 'код за потвърждение трябва да бъде попълнен'
        },
        sendMsg: {
            repeatErr: 'Не изпращайте многократно',
            success: 'Получете успех',
            codeTip: 'Вашият код за потвърждение е'
        },
        phonePlaceholder: 'Моля, въведете телефонен номер',
        validPlaceholder: 'Captcha',
        validBtn: 'получете код за потвърждение',
        loginSuccess: 'успешен вход'
    },
    requestInfo: {
        withoutUrl: 'Адресът на заявката не може да бъде празен',
        networkErr: 'Заявката за мрежата не бе успешна. Моля, опитайте отново по-късно'
    },
    localeMap: {
        ar: 'арабски',
        bg: 'български',
        ca: 'каталонски',
        cs: 'чешки',
        da: 'датски',
        de: 'Немски',
        el: 'Гръцки',
        'en-gb': 'Английски',
        en: 'Английски',
        es: 'испански',
        et: 'естонски',
        fa: 'персийски',
        fi: 'фински',
        fr: 'Френски',
        he: 'иврит',
        hi: 'хинди',
        hr: 'хърватски',
        hu: 'унгарски',
        hy: 'арменски',
        id: 'индонезийски',
        is: 'исландски',
        it: 'Италиански ',
        ja: 'японски',
        kn: 'канада',
        ko: 'корейски',
        'ku-iq': 'Централен кюрдски',
        lv: 'Централен кюрдски',
        mk: 'македонски',
        'mn-mn': 'монголски',
        'ms-my': 'малайски',
        nb: 'норвежки',
        'ne-np': 'непалски',
        'nl-be': 'фламандски',
        nl: 'холандски',
        pl: 'полски',
        'pt-br': 'Бразилски португалски',
        pt: 'Европейски португалски',
        ro: 'румънски',
        ru: 'руски език',
        sk: 'словашки',
        sl: 'словенски',
        sr: 'сръбски',
        sv: 'шведски',
        ta: 'тамилски',
        th: 'Thai',
        tr: 'Турски',
        uk: 'украински',
        vi: 'виетнамски',
        'zh-cn': 'Опростен китайски',
        'zh-tw': 'традиционен китайски'
    },
    menuObj: {
        basicFeature: 'Основна способност',
        cpUse: 'Използване на компоненти',
        childMenu: {
            0: 'Основни възможности на рамката',
            '0-0': 'Рамка функция',
            '0-0-0': 'Конфигурация на проекта',
            '0-0-1': 'Преден дневник',
            '0-0-2': 'Местна подигравка',
            '0-0-3': 'глобализация',
            '0-0-4': 'Речник на данните',
            '0-0-5': 'EventBus',
            '0-0-6': 'Toolset',
            '0-0-7': 'Контрол на достъпа',
            '0-0-8': 'горещ ключ',
            '0-1': 'Функция на страницата',
            '0-1-0': 'Страница на компонент',
            '0-1-1': 'страница на URL адреса',
            '0-1-2': 'Няма страница с разрешение',
            '0-1-3': '404 страници'
        },
        defaultMenu: {
            home: 'У дома'
        },
        errorTip: {
            notfoundTip: 'Няма намерен компонент под този път',
            emptyErr: 'Пътят на компонента не е конфигуриран'
        }
    },
    tagObj: {
        closeAll: 'Затворете всички раздели',
        closeCur: 'Затворете текущия раздел',
        closeOther: 'Затворете други маркери',
        closeRight: 'Затворете десния етикет',
        singlePage: 'Независима страница',
        refreshPage: 'опресняване на страницата',
        errorTip: {
            homePageCloseError: 'Не е разрешено затварянето на началната страница'
        },
        checkSave: 'Искате ли да затворите страницата?(Моля, уверете се, че съдържанието на червената страница с етикети е запазено)',
        cancelClose: 'Затворената операция е отменена'
    },
    personalCenter: {
        frontendLog: 'Преден дневник',
        customSetting: 'Персонализирани настройки',
        logout: 'отписване'
    }
}
