export default {
    locale: 'el',
    country: 'GR',
    sysInfo: {
        sysIntro: 'Ένα εύχρηστο πλαίσιο ανάπτυξης front-end βασισμένο στο Vue και το Ant Design'
    },
    loginForm: {
        byAccountBtn: 'Σύνδεση κωδικού πρόσβασης λογαριασμού',
        byPhoneBtn: 'Σύνδεση αριθμού τηλεφώνου',
        accountPlaceholder: 'Εισαγάγετε το όνομα χρήστη',
        passwordPlaceholder: 'Εισαγάγετε τον κωδικό πρόσβασης',
        autoLogin: 'αυτόματη σύνδεση',
        forgetBtn: 'ξεχάστε τον κωδικό πρόσβασης',
        loginBtn: 'Σύνδεση',
        byAccountTip: {
            emptyErr: 'Ο λογαριασμός δεν μπορεί να είναι κενός'
        },
        byPasswordTip: {
            emptyErr: 'ο κωδικός πρόσβασης δεν μπορεί να είναι κενός'
        },
        byValidTip: {
            emptyErr: 'πρέπει να συμπληρωθεί ο κωδικός επαλήθευσης'
        },
        sendMsg: {
            repeatErr: 'Μην στέλνετε επανειλημμένα',
            success: 'Αποκτήστε επιτυχία',
            codeTip: 'Ο κωδικός επαλήθευσής σας είναι'
        },
        phonePlaceholder: 'Εισαγάγετε τον αριθμό τηλεφώνου',
        validPlaceholder: 'Captcha',
        validBtn: 'λήψη κωδικού επαλήθευσης',
        loginSuccess: 'επιτυχής σύνδεση'
    },
    requestInfo: {
        withoutUrl: 'Η διεύθυνση αιτήματος δεν μπορεί να είναι κενή',
        networkErr: 'Το αίτημα δικτύου απέτυχε. Δοκιμάστε ξανά αργότερα'
    },
    localeMap: {
        ar: 'αραβικός',
        bg: 'Βούλγαρος',
        ca: 'Καταλανικά',
        cs: 'Τσέχος',
        da: 'δανικός',
        de: 'Γερμανός',
        el: 'Ελληνικά',
        'en-gb': 'Αγγλικά',
        en: 'Αγγλικά',
        es: 'Ισπανικά',
        et: 'Εσθονικά',
        fa: 'περσικός',
        fi: 'φινλανδικός',
        fr: 'γαλλική γλώσσα',
        he: 'Εβραϊκά',
        hi: 'Χίντι',
        hr: 'Κροατία',
        hu: 'ουγγρικός',
        hy: 'αρμενικός',
        id: 'Ινδονησιακά',
        is: 'ισλανδικός',
        it: 'ιταλικός ',
        ja: 'Ιαπωνικά',
        kn: 'Κανάντα',
        ko: 'κορεάτης',
        'ku-iq': 'Κεντρικά Κουρδικά',
        lv: 'Κεντρικά Κουρδικά',
        mk: 'Μακεδόνας',
        'mn-mn': 'μογγολικός',
        'ms-my': 'Μαλαισίας',
        nb: 'Νορβηγός',
        'ne-np': 'Νεπάλ',
        'nl-be': 'Φλαμανδική',
        nl: 'Ολλανδός',
        pl: 'Στίλβωση',
        'pt-br': 'Πορτογαλικά Βραζιλίας',
        pt: 'Ευρωπαϊκή Πορτογαλικά',
        ro: 'ρουμανικός',
        ru: 'ρωσική γλώσσα',
        sk: 'Σλοβάκος',
        sl: 'Σλοβενικά',
        sr: 'Σέρβος',
        sv: 'Σουηδικά',
        ta: 'Ταμίλ',
        th: 'Ταϊλανδέζικα',
        tr: 'τούρκικος',
        uk: 'Ουκρανός',
        vi: 'Βιετναμέζικα',
        'zh-cn': 'Απλοποιημένα Κινέζικα',
        'zh-tw': 'παραδοσιακά κινεζικά'
    },
    menuObj: {
        basicFeature: 'Βασική ικανότητα',
        cpUse: 'Χρήση συστατικών',
        childMenu: {
            0: 'Βασικές δυνατότητες πλαισίου',
            '0-0': 'Λειτουργία καρέ',
            '0-0-0': 'Διαμόρφωση έργου',
            '0-0-1': 'Αρχείο καταγραφής διεπαφής',
            '0-0-2': 'Τοπικό χλεύη',
            '0-0-3': 'παγκοσμιοποίηση',
            '0-0-4': 'Λεξικό δεδομένων',
            '0-0-5': 'EventBus',
            '0-0-6': 'Εργαλειοθήκη',
            '0-0-7': 'Έλεγχος πρόσβασης',
            '0-0-8': 'πλήκτρο πρόσβασης',
            '0-1': 'Λειτουργία σελίδας',
            '0-1-0': 'Σελίδα συστατικών',
            '0-1-1': 'σελίδα url',
            '0-1-2': 'Χωρίς σελίδα άδειας',
            '0-1-3': '404 σελίδες'
        },
        defaultMenu: {
            home: 'Σπίτι'
        },
        errorTip: {
            notfoundTip: 'Δεν βρέθηκε κανένα στοιχείο σε αυτήν τη διαδρομή',
            emptyErr: 'Η διαδρομή του στοιχείου δεν έχει ρυθμιστεί'
        }
    }
}
