export default {
    locale: 'el',
    country: 'GR',
    loginForm: {
        byAccountBtn: 'Σύνδεση κωδικού πρόσβασης λογαριασμού',
        byPhoneBtn: 'Σύνδεση αριθμού κινητού τηλεφώνου',
        accountPlaceholder: 'εισάγετε λογαριασμό',
        passwordPlaceholder: 'Παρακαλώ εισάγετε κωδικό πρόσβασης',
        autoLogin: 'αυτόματη σύνδεση',
        forgetBtn: 'ξεχάστε τον κωδικό πρόσβασης',
        loginBtn: 'Σύνδεση',
        byAccountTip: {
            emptyErr: 'Ο λογαριασμός δεν μπορεί να είναι κενός'
        },
        byPasswordTip: {
            emptyErr: 'ο κωδικός πρόσβασης δεν μπορεί να είναι κενός'
        },
        byValidTip: {
            emptyErr: 'πρέπει να συμπληρωθεί ο κωδικός επαλήθευσης'
        },
        sendMsg: {
            repeatErr: 'Μην στέλνετε επανειλημμένα',
            success: 'Επιτυχής',
            codeTip: 'Ο κωδικός επαλήθευσής σας είναι'
        },
        phonePlaceholder: 'Εισαγάγετε τον αριθμό τηλεφώνου',
        validPlaceholder: 'Κωδικός επαλήθευσης',
        validBtn: 'λήψη κωδικού επαλήθευσης',
        loginSuccess: 'επιτυχής σύνδεση'
    },
    menuObj: {
        basicFeature: 'Βασική ικανότητα',
        cpUse: 'Χρήση συστατικών',
        childMenu: {
            0: 'Βασικό πλαίσιο',
            1: 'Βασική ικανότητα',
            '0-0': 'Βουε',
            '0-1': 'Σχεδιασμός μυρμηγκιών',
            '1-0': 'Συνάρτηση πλαισίου',
            '1-0-0': 'Διαμόρφωση έργου',
            '1-0-1': 'Αρχείο καταγραφής frontend',
            '1-0-2': 'Τοπικό χλεύη',
            '1-0-3': 'παγκοσμιοποίηση',
            '1-0-4': 'Λεξικό δεδομένων',
            '1-0-5': 'EventBus',
            '1-0-6': 'Εργαλειοθήκη',
            '1-0-7': 'Έλεγχος πρόσβασης',
            '1-0-8': 'πλήκτρο πρόσβασης',
            '1-1': 'Λειτουργία σελίδας',
            '1-1-0': 'Σελίδα συστατικών',
            '1-1-1': 'σελίδα url',
            '1-1-2': 'Χωρίς σελίδα άδειας',
            '1-1-3': '404 σελίδα'
        },
        defaultMenu: {
            home: 'Σπίτι'
        },
        errorTip: {
            notfoundTip: 'Το στοιχείο κάτω από αυτήν τη διαδρομή δεν βρέθηκε',
            emptyErr: 'Μη διαμορφωμένη διαδρομή στοιχείου'
        }
    },
    sysInfo: {
        sysIntro: 'Ένα εύχρηστο πλαίσιο ανάπτυξης μεσαίου και πίσω μέρους με βάση το Vue και το Ant Design'
    },
    requestInfo: {
        withoutUrl: 'Η διεύθυνση αιτήματος δεν μπορεί να είναι κενή',
        networkErr: 'Το αίτημα δικτύου απέτυχε. Δοκιμάστε ξανά αργότερα'
    },
    localeMap: {
        ar: 'αραβικός',
        bg: 'Βούλγαρος',
        ca: 'Καταλανικά',
        cs: 'Τσέχος',
        da: 'δανικός',
        de: 'Γερμανός',
        el: 'Ελληνικά',
        'en-gb': 'Αγγλικά',
        en: 'Αγγλικά',
        es: 'Ισπανικά',
        et: 'Εσθονικά',
        fa: 'περσικός',
        fi: 'φινλανδικός',
        fr: 'γαλλική γλώσσα',
        he: 'Εβραϊκά',
        hi: 'Χίντι',
        hr: 'Κροατία',
        hu: 'ουγγρικός',
        hy: 'αρμενικός',
        id: 'Ινδονησιακά',
        is: 'ισλανδικός',
        it: 'ιταλικός ',
        ja: 'Ιαπωνικά',
        kn: 'Κανάντα',
        ko: 'κορεάτης',
        'ku-iq': 'Κεντρικά Κουρδικά',
        lv: 'Κεντρικά Κουρδικά',
        mk: 'Μακεδόνας',
        'mn-mn': 'Μογγόλος',
        'ms-my': 'Μαλαισίας',
        nb: 'Νορβηγός',
        'ne-np': 'Νεπάλ',
        'nl-be': 'Φλαμανδική',
        nl: 'Ολλανδός',
        pl: 'Στίλβωση',
        'pt-br': 'Πορτογαλικά Βραζιλίας',
        pt: 'Ευρωπαϊκή Πορτογαλικά',
        ro: 'ρουμανικός',
        ru: 'ρωσική γλώσσα',
        sk: 'Σλοβάκος',
        sl: 'Σλοβενικά',
        sr: 'Σέρβος',
        sv: 'Σουηδικά',
        ta: 'Ταμίλ',
        th: 'Ταϊλανδέζικα',
        tr: 'τούρκικος',
        uk: 'Ουκρανός',
        vi: 'Βιετναμέζικα',
        'zh-cn': 'Απλοποιημένα Κινέζικα',
        'zh-tw': 'παραδοσιακά κινεζικά'
    },
    tagObj: {
        closeAll: 'Κλείστε όλες τις καρτέλες',
        closeCur: 'Κλείσιμο της τρέχουσας καρτέλας',
        closeOther: 'Κλείστε άλλες καρτέλες',
        closeRight: 'Κλείσιμο δεξιάς ετικέτας',
        singlePage: 'Ανεξάρτητη σελίδα',
        refreshPage: 'ανανεώστε τη σελίδα',
        affixPage: 'Καρφίτσωμα σελίδας',
        cancelAffixPage: 'Ξεκαρφιτσώνω',
        errorTip: {
            homePageCloseError: 'Δεν επιτρέπεται το κλείσιμο της αρχικής σελίδας',
            affixPageCloseError: 'Δεν επιτρέπεται το κλείσιμο της σταθερής σελίδας',
            homePageAffixError: 'Δεν είναι δυνατή η αποσύνδεση της αρχικής σελίδας'
        },
        checkSave: 'Θέλετε να κλείσετε τη σελίδα;(Βεβαιωθείτε ότι το περιεχόμενο της σελίδας με κόκκινο χρώμα έχει αποθηκευτεί)',
        cancelClose: 'Η λειτουργία κλεισίματος ακυρώθηκε'
    },
    personalCenter: {
        frontendLog: 'Αρχείο καταγραφής frontend',
        customSetting: 'Εξατομίκευση',
        logout: 'αποσύνδεση'
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'Λυπούμαστε, η σελίδα που επισκεφτήκατε δεν υπάρχει',
            notrightTip: 'Δυστυχώς, δεν έχετε άδεια πρόσβασης σε αυτήν τη σελίδα',
            noserviceTip: 'Δυστυχώς, παρουσιάστηκε πρόβλημα με τον διακομιστή. Δοκιμάστε ξανά αργότερα'
        },
        btnText: 'Κλείσιμο σελίδας'
    },
    searchPanel: {
        btn: {
            search: 'Ρωτώ',
            shrink: 'Αποταμιεύω',
            reset: 'Επαναφορά',
            unshrink: 'Ξεδιπλώνονται'
        }
    },
    logline: {
        list: 'Λίστα καταγραφής',
        detail: 'Στοιχεία καταγραφής',
        btnList: {
            export: 'Εξαγωγή',
            remove: 'Αδειάζω'
        },
        time: {
            plh: 'Επιλέξτε χρονικό διάστημα',
            range: 'προθεσμία',
            halfDay: 'Μισή μέρα',
            oneDay: 'σε μια μέρα',
            weekDay: 'μέσα σε μία εβδομάδα',
            monthDay: 'Μέσα σε ένα μήνα'
        },
        type: {
            logType: 'Τύπος καταγραφής',
            plh: 'Επιλέξτε τον τύπο καταγραφής'
        },
        tableColumns: {
            index: 'Σειριακός αριθμός',
            desc: 'Περιγραφή αρχείου καταγραφής',
            type: 'Τύπος καταγραφής',
            time: 'χρόνος',
            op: 'λειτουργικός'
        },
        request: 'Ζητήστε δεδομένα',
        error: {
            cancel: 'Η κενή λειτουργία ακυρώθηκε',
            confirm: 'Θέλετε να διαγράψετε το αρχείο καταγραφής;(Εάν αδειάσει το αρχείο καταγραφής, δεν μπορεί να ανακτηθεί)'
        },
        success: 'Το αρχείο καταγραφής αδειάστηκε'
    },
    comTable: {
        columns: {
            title: 'Ρυθμίσεις στήλης',
            all: 'επιλογή όλων',
            reset: 'Επαναφορά',
            fixedLeft: 'Σταθερά αριστερά',
            fixedRight: 'Διορθώθηκε δεξιά',
            cancelFixed: 'Ξεκαρφιτσώνω'
        },
        size: {
            title: 'Ύψος σειράς',
            small: 'στενός',
            normal: 'σε',
            large: 'πλάτος'
        },
        fullscreen: 'ΠΛΗΡΗΣ ΟΘΟΝΗ',
        unFullscreen: 'Ακύρωση πλήρους οθόνης'
    },
    normalBtn: {
        detail: 'Θέα'
    },
    setting: {
        customEntry: 'Γρήγορη είσοδος',
        systemSwitch: 'Διαμόρφωση συστήματος',
        isMock: 'Είτε πρόκειται για χλευασμό',
        isHotKey: 'Είτε κλειδί συντόμευσης',
        isBreadCrumb: 'Είτε ψίχουλα ψωμιού',
        isCache: 'Αν θα αποθηκεύσετε προσωρινά',
        isI18n: 'Αν θα διεθνοποιηθεί'
    }
}
