export default {
    locale: 'el',
    country: 'GR',
    sysInfo: {
        sysIntro: 'Ένα εύχρηστο πλαίσιο ανάπτυξης front-end με βάση το Vue και το Ant Design'
    },
    loginForm: {
        byAccountBtn: 'Σύνδεση κωδικού πρόσβασης λογαριασμού',
        byPhoneBtn: 'Σύνδεση αριθμού τηλεφώνου',
        accountPlaceholder: 'Εισαγάγετε το όνομα χρήστη',
        passwordPlaceholder: 'Εισαγάγετε τον κωδικό πρόσβασης',
        autoLogin: 'αυτόματη σύνδεση',
        forgetBtn: 'ξεχάστε τον κωδικό πρόσβασης',
        loginBtn: 'Σύνδεση',
        byAccountTip: {
            emptyErr: 'Ο λογαριασμός δεν μπορεί να είναι κενός'
        },
        byPasswordTip: {
            emptyErr: 'ο κωδικός πρόσβασης δεν μπορεί να είναι κενός'
        },
        byValidTip: {
            emptyErr: 'πρέπει να συμπληρωθεί ο κωδικός επαλήθευσης'
        },
        sendMsg: {
            repeatErr: 'Μην στέλνετε επανειλημμένα'
        },
        phonePlaceholder: 'Εισαγάγετε τον αριθμό τηλεφώνου',
        validPlaceholder: 'Captcha',
        validBtn: 'λήψη κωδικού επαλήθευσης'
    },
    localeMap: {
        ar: 'αραβικός',
        bg: 'Βούλγαρος',
        ca: 'Καταλανικά',
        cs: 'Τσέχος',
        da: 'δανικός',
        de: 'Γερμανός',
        el: 'Ελληνικά',
        'en-gb': 'Αγγλικά',
        en: 'Αγγλικά',
        es: 'Ισπανικά',
        et: 'Εσθονικά',
        fa: 'περσικός',
        fi: 'φινλανδικός',
        fr: 'γαλλική γλώσσα',
        he: 'Εβραϊκά',
        hi: 'Χίντι',
        hr: 'Κροατία',
        hu: 'ουγγρικός',
        hy: 'αρμενικός',
        id: 'Ινδονησιακά',
        is: 'ισλανδικός',
        it: 'ιταλικός ',
        ja: 'Ιαπωνικά',
        kn: 'Κανάντα',
        ko: 'κορεάτης',
        'ku-iq': 'Κεντρικά Κουρδικά',
        lv: 'Κεντρικά Κουρδικά',
        mk: 'Μακεδόνας',
        'mn-mn': 'μογγολικός',
        'ms-my': 'Μαλαισίας',
        nb: 'Νορβηγός',
        'ne-np': 'Νεπάλ',
        'nl-be': 'Φλαμανδική',
        nl: 'Ολλανδός',
        pl: 'Στίλβωση',
        'pt-br': 'Πορτογαλικά Βραζιλίας',
        pt: 'Ευρωπαϊκή Πορτογαλικά',
        ro: 'ρουμανικός',
        ru: 'ρωσική γλώσσα',
        sk: 'Σλοβάκος',
        sl: 'Σλοβενικά',
        sr: 'Σέρβος',
        sv: 'Σουηδικά',
        ta: 'Ταμίλ',
        th: 'Ταϊλανδέζικα',
        tr: 'τούρκικος',
        uk: 'Ουκρανός',
        vi: 'Βιετναμέζικα',
        'zh-cn': 'Απλοποιημένα Κινέζικα',
        'zh-tw': 'παραδοσιακά κινεζικά'
    }
}
