export default {
    locale: 'fa',
    country: 'IR',
    sysInfo: {
        sysIntro: 'چارچوب توسعه جلویی مفید مبتنی بر Vue و Design Design'
    },
    loginForm: {
        byAccountBtn: 'ورود به سیستم رمز عبور حساب',
        byPhoneBtn: 'ورود به شماره تلفن',
        accountPlaceholder: 'لطفا نام کاربری را وارد کنید',
        passwordPlaceholder: 'لطفا رمز عبور را وارد کنید',
        autoLogin: 'ورود خودکار',
        forgetBtn: 'فراموشی رمز عبور',
        loginBtn: 'وارد شدن',
        byAccountTip: {
            emptyErr: 'حساب نمی تواند خالی باشد'
        },
        byPasswordTip: {
            emptyErr: 'رمز عبور نمی تواند خالی باشد'
        },
        byValidTip: {
            emptyErr: 'کد تأیید باید پر شود'
        },
        sendMsg: {
            repeatErr: 'بارها و بارها ارسال نشود'
        },
        phonePlaceholder: 'لطفا شماره تلفن را وارد کنید',
        validPlaceholder: 'کپچا',
        validBtn: 'کد تأیید را دریافت کنید'
    },
    localeMap: {
        ar: 'عربی',
        bg: 'بلغاری',
        ca: 'کاتالان',
        cs: 'کشور چک',
        da: 'دانمارکی',
        de: 'آلمانی',
        el: 'یونانی',
        'en-gb': 'انگلیسی',
        en: 'انگلیسی',
        es: 'اسپانیایی',
        et: 'استونیایی',
        fa: 'فارسی',
        fi: 'فنلاندی',
        fr: 'فرانسوی',
        he: 'عبری',
        hi: 'هندی',
        hr: 'کرواتی',
        hu: 'مجارستانی',
        hy: 'ارمنی',
        id: 'اندونزیایی',
        is: 'ایسلندی',
        it: 'ایتالیایی ',
        ja: 'ژاپنی',
        kn: 'کانادایی',
        ko: 'کره ای',
        'ku-iq': 'کردی مرکزی',
        lv: 'کردی مرکزی',
        mk: 'مقدونی',
        'mn-mn': 'مغولی',
        'ms-my': 'مالایی',
        nb: 'نروژی',
        'ne-np': 'نپالی',
        'nl-be': 'فلانی',
        nl: 'هلندی',
        pl: 'لهستانی',
        'pt-br': 'پرتغالی برزیل',
        pt: 'پرتغالی اروپا',
        ro: 'رومانیایی',
        ru: 'زبان روسی',
        sk: 'اسلواکی',
        sl: 'اسلوونیایی',
        sr: 'صربی',
        sv: 'سوئدی',
        ta: 'تامیل',
        th: 'تایلندی',
        tr: 'ترکی',
        uk: 'اوکراینی',
        vi: 'ویتنامی',
        'zh-cn': 'چینی ساده شده',
        'zh-tw': 'چینی سنتی'
    }
}
