export default {
    locale: 'fa',
    country: 'IR',
    sysInfo: {
        sysIntro: 'چارچوب توسعه جلویی مفید مبتنی بر Vue و طراحی مورچه'
    },
    loginForm: {
        byAccountBtn: 'ورود به سیستم رمز عبور حساب',
        byPhoneBtn: 'ورود به شماره تلفن',
        accountPlaceholder: 'لطفا نام کاربری را وارد کنید',
        passwordPlaceholder: 'لطفا رمز عبور را وارد کنید',
        autoLogin: 'ورود خودکار',
        forgetBtn: 'فراموشی رمز عبور',
        loginBtn: 'وارد شدن',
        byAccountTip: {
            emptyErr: 'حساب نمی تواند خالی باشد'
        },
        byPasswordTip: {
            emptyErr: 'رمز عبور نمی تواند خالی باشد'
        },
        byValidTip: {
            emptyErr: 'کد تأیید باید پر شود'
        },
        sendMsg: {
            repeatErr: 'بارها و بارها ارسال نشود',
            success: 'موفقیت کسب کنید',
            codeTip: 'کد تأیید صحت شماست'
        },
        phonePlaceholder: 'لطفا شماره تلفن را وارد کنید',
        validPlaceholder: 'کپچا',
        validBtn: 'کد تأیید را دریافت کنید',
        loginSuccess: 'ورود به سیستم موفق شد'
    },
    requestInfo: {
        withoutUrl: 'آدرس درخواست خالی نیست',
        networkErr: 'درخواست شبکه انجام نشد ، لطفا بعدا دوباره امتحان کنید'
    },
    localeMap: {
        ar: 'عربی',
        bg: 'بلغاری',
        ca: 'کاتالان',
        cs: 'کشور چک',
        da: 'دانمارکی',
        de: 'آلمانی',
        el: 'یونانی',
        'en-gb': 'انگلیسی',
        en: 'انگلیسی',
        es: 'اسپانیایی',
        et: 'استونیایی',
        fa: 'فارسی',
        fi: 'فنلاندی',
        fr: 'فرانسوی',
        he: 'عبری',
        hi: 'هندی',
        hr: 'کرواتی',
        hu: 'مجارستانی',
        hy: 'ارمنی',
        id: 'اندونزیایی',
        is: 'ایسلندی',
        it: 'ایتالیایی ',
        ja: 'ژاپنی',
        kn: 'کانادایی',
        ko: 'کره ای',
        'ku-iq': 'کردی مرکزی',
        lv: 'کردی مرکزی',
        mk: 'مقدونی',
        'mn-mn': 'مغولی',
        'ms-my': 'مالایی',
        nb: 'نروژی',
        'ne-np': 'نپالی',
        'nl-be': 'فلانی',
        nl: 'هلندی',
        pl: 'لهستانی',
        'pt-br': 'پرتغالی برزیل',
        pt: 'پرتغالی اروپا',
        ro: 'رومانیایی',
        ru: 'زبان روسی',
        sk: 'اسلواکی',
        sl: 'اسلوونیایی',
        sr: 'صربی',
        sv: 'سوئدی',
        ta: 'تامیل',
        th: 'تایلندی',
        tr: 'ترکی',
        uk: 'اوکراینی',
        vi: 'ویتنامی',
        'zh-cn': 'چینی ساده شده',
        'zh-tw': 'چینی سنتی'
    },
    menuObj: {
        basicFeature: 'توانایی اساسی',
        cpUse: 'استفاده از کامپوننت',
        childMenu: {
            0: 'قابلیت های اساسی چارچوب',
            '0-0': 'عملکرد قاب',
            '0-0-0': 'پیکربندی پروژه',
            '0-0-1': 'ورود به سیستم جلویی',
            '0-0-2': 'مسخره محلی',
            '0-0-3': 'جهانی سازی',
            '0-0-4': 'فرهنگ لغت داده',
            '0-0-5': 'EventBus',
            '0-0-6': 'مجموعه ابزار',
            '0-0-7': 'کنترل دسترسی',
            '0-0-8': 'کلید گرم',
            '0-1': 'عملکرد صفحه',
            '0-1-0': 'صفحه مؤلفه',
            '0-1-1': 'صفحه url',
            '0-1-2': 'بدون صفحه اجازه',
            '0-1-3': '404 صفحه'
        },
        defaultMenu: {
            home: 'خانه'
        },
        errorTip: {
            notfoundTip: 'هیچ مؤلفه ای تحت این مسیر یافت نشد',
            emptyErr: 'مسیر کامپوننت پیکربندی نشده است'
        }
    },
    tagObj: {
        closeAll: 'همه را ببند',
        errorTip: {
            homePageCloseError: 'صفحه اصلی مجاز به بسته شدن نیست'
        }
    }
}
