export default {
    locale: 'fa',
    country: 'IR',
    loginForm: {
        byAccountBtn: 'ورود به سیستم رمز عبور حساب',
        byPhoneBtn: 'ورود به شماره تلفن همراه',
        accountPlaceholder: 'لطفا وارد حساب شوید',
        passwordPlaceholder: 'لطفا رمز عبور را وارد کنید',
        autoLogin: 'ورود خودکار',
        forgetBtn: 'فراموشی رمز عبور',
        loginBtn: 'وارد شدن',
        byAccountTip: {
            emptyErr: 'حساب نمی تواند خالی باشد'
        },
        byPasswordTip: {
            emptyErr: 'رمز عبور نمی تواند خالی باشد'
        },
        byValidTip: {
            emptyErr: 'کد تأیید باید پر شود'
        },
        sendMsg: {
            repeatErr: 'بارها و بارها ارسال نشود',
            success: 'موفقیت آمیز',
            codeTip: 'کد تأیید صحت شماست'
        },
        phonePlaceholder: 'لطفا شماره تلفن را وارد کنید',
        validPlaceholder: 'کد تایید',
        validBtn: 'کد تأیید را دریافت کنید',
        loginSuccess: 'ورود به سیستم موفق شد'
    },
    menuObj: {
        basicFeature: 'توانایی اساسی',
        cpUse: 'استفاده از مؤلفه',
        childMenu: {
            0: 'چارچوب اساسی',
            1: 'توانایی اساسی',
            '0-0': 'شرط بندی',
            '0-1': 'طراحی مورچه',
            '1-0': 'عملکرد چارچوب',
            '1-0-0': 'پیکربندی پروژه',
            '1-0-1': 'ورود به سیستم',
            '1-0-2': 'مسخره محلی',
            '1-0-3': 'جهانی سازی',
            '1-0-4': 'فرهنگ لغت داده',
            '1-0-5': 'EventBus',
            '1-0-6': 'مجموعه ابزار',
            '1-0-7': 'کنترل دسترسی',
            '1-0-8': 'کلید گرم',
            '1-1': 'عملکرد صفحه',
            '1-1-0': 'صفحه مؤلفه',
            '1-1-1': 'صفحه url',
            '1-1-2': 'بدون صفحه اجازه',
            '1-1-3': 'صفحه 404'
        },
        defaultMenu: {
            home: 'خانه'
        },
        errorTip: {
            notfoundTip: 'مؤلفه ای در این مسیر یافت نشد',
            emptyErr: 'مسیر مؤلفه پیکربندی نشده'
        }
    },
    sysInfo: {
        sysIntro: 'یک چارچوب توسعه جلویی با قابلیت استفاده متوسط ​​و پشتی مبتنی بر Vue و طراحی مورچه'
    },
    requestInfo: {
        withoutUrl: 'آدرس درخواست خالی نیست',
        networkErr: 'درخواست شبکه انجام نشد ، لطفا بعدا دوباره امتحان کنید'
    },
    localeMap: {
        ar: 'عربی',
        bg: 'بلغاری',
        ca: 'کاتالان',
        cs: 'کشور چک',
        da: 'دانمارکی',
        de: 'آلمانی',
        el: 'یونانی',
        'en-gb': 'انگلیسی',
        en: 'انگلیسی',
        es: 'اسپانیایی',
        et: 'استونیایی',
        fa: 'فارسی',
        fi: 'فنلاندی',
        fr: 'فرانسوی',
        he: 'عبری',
        hi: 'هندی',
        hr: 'کرواتی',
        hu: 'مجارستانی',
        hy: 'ارمنی',
        id: 'اندونزیایی',
        is: 'ایسلندی',
        it: 'ایتالیایی ',
        ja: 'ژاپنی',
        kn: 'کانادایی',
        ko: 'کره ای',
        'ku-iq': 'کردی مرکزی',
        lv: 'کردی مرکزی',
        mk: 'مقدونی',
        'mn-mn': 'مغولی',
        'ms-my': 'مالایی',
        nb: 'نروژی',
        'ne-np': 'نپالی',
        'nl-be': 'فلانی',
        nl: 'هلندی',
        pl: 'لهستانی',
        'pt-br': 'پرتغالی برزیل',
        pt: 'پرتغالی اروپا',
        ro: 'رومانیایی',
        ru: 'زبان روسی',
        sk: 'اسلواکی',
        sl: 'اسلوونیایی',
        sr: 'صربی',
        sv: 'سوئدی',
        ta: 'تامیل',
        th: 'تایلندی',
        tr: 'ترکی',
        uk: 'اوکراینی',
        vi: 'ویتنامی',
        'zh-cn': 'چینی ساده شده',
        'zh-tw': 'چینی سنتی'
    },
    tagObj: {
        closeAll: 'همهی زبانهها را ببندید',
        closeCur: 'این زبانه را ببندید',
        closeOther: 'زبانه های دیگر را ببندید',
        closeRight: 'برچسب سمت راست را ببندید',
        singlePage: 'صفحه مستقل',
        refreshPage: 'صفحه را رفرش کن',
        affixPage: 'صفحه پین',
        cancelAffixPage: 'باز کردن',
        errorTip: {
            homePageCloseError: 'صفحه اصلی مجاز به بسته شدن نیست',
            affixPageCloseError: 'صفحه ثابت مجاز به بسته شدن نیست',
            homePageAffixError: 'صفحه اصلی قابل برداشتن نیست'
        },
        checkSave: 'آیا می خواهید صفحه را ببندید؟(لطفاً اطمینان حاصل کنید که محتوای صفحه مشخص شده با رنگ قرمز ذخیره شده است)',
        cancelClose: 'عملیات بسته لغو شد'
    },
    personalCenter: {
        frontendLog: 'ورود به سیستم',
        customSetting: 'شخصی',
        customClean: 'پیکربندی پاک کنید',
        logout: 'خروج از سیستم',
        errorTip: {
            cleanSuccess: 'با موفقیت خالی شد'
        }
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'متأسفیم ، صفحه‌ای که بازدید کردید وجود ندارد',
            notrightTip: 'متأسفیم ، شما اجازه دسترسی به این صفحه را ندارید',
            noserviceTip: 'متأسفیم ، مشکلی در سرور وجود داشت ، لطفاً بعداً دوباره امتحان کنید'
        },
        btnText: 'بستن صفحه'
    },
    searchPanel: {
        btn: {
            search: 'جویا شدن',
            shrink: 'کنار بگذار',
            reset: 'تنظیم مجدد',
            unshrink: 'آشکار شد'
        }
    },
    logline: {
        list: 'لیست ورود',
        detail: 'جزئیات ورود به سیستم',
        btnList: {
            export: 'صادرات',
            remove: 'خالی'
        },
        time: {
            plh: 'لطفاً یک بازه زمانی را انتخاب کنید',
            range: 'محدودیت زمانی',
            halfDay: 'نصف روز',
            oneDay: 'در یک روز',
            weekDay: 'طی یک هفته',
            monthDay: 'طی یک ماه'
        },
        type: {
            logType: 'نوع ورود',
            plh: 'لطفاً نوع ورود را انتخاب کنید'
        },
        tableColumns: {
            index: 'شماره سریال',
            desc: 'توضیحات ورود به سیستم',
            type: 'نوع ورود',
            time: 'زمان',
            op: 'عملیاتی'
        },
        request: 'درخواست داده',
        error: {
            cancel: 'عملیات خالی لغو شد',
            confirm: 'آیا می خواهید سیاهه را پاک کنید؟(اگر ورود به سیستم خالی باشد ، قابل بازیابی نیست)'
        },
        success: 'ورود به سیستم خالی شده است'
    },
    comTable: {
        columns: {
            title: 'تنظیمات ستون',
            all: 'انتخاب همه',
            reset: 'تنظیم مجدد',
            fixedLeft: 'سمت چپ ثابت است',
            fixedRight: 'درست درست شد',
            cancelFixed: 'باز کردن'
        },
        size: {
            title: 'ارتفاع سطر',
            small: 'محدود، تنگ',
            normal: 'که در',
            large: 'عرض'
        },
        fullscreen: 'تمام صفحه',
        unFullscreen: 'تمام صفحه را لغو کنید'
    },
    normalBtn: {
        detail: 'چشم انداز'
    },
    setting: {
        customEntry: 'ورود سریع',
        systemSwitch: 'پیکربندی سیستم',
        isMock: 'آیا به مسخره کردن',
        isHotKey: 'چه کلید میانبر باشد',
        isBreadCrumb: 'چه نان خرد شود',
        isCache: 'آیا در حافظه نهان است',
        isI18n: 'آیا بین المللی شود'
    }
}
