export default {
    locale: 'hi',
    country: 'IN',
    sysInfo: {
        sysIntro: 'Vue और चींटी डिजाइन पर आधारित एक आसान-से-उपयोग वाला फ्रंट-एंड डेवलपमेंट फ्रेमवर्क'
    },
    loginForm: {
        byAccountBtn: 'खाता पासवर्ड लॉगिन',
        byPhoneBtn: 'फोन नंबर लॉगिन करें',
        accountPlaceholder: 'कृपया उपयोगकर्ता नाम इनपुट करें',
        passwordPlaceholder: 'कृपया पासवर्ड दर्ज करें',
        autoLogin: 'स्वतः लॉगइन',
        forgetBtn: 'पासवर्ड भूल गए',
        loginBtn: 'लॉग इन करें',
        byAccountTip: {
            emptyErr: 'खाता खाली नहीं हो सकता'
        },
        byPasswordTip: {
            emptyErr: 'पासवर्ड रिक्त नहीं हो सकता'
        },
        byValidTip: {
            emptyErr: 'सत्यापन कोड भरना होगा'
        },
        sendMsg: {
            repeatErr: 'बार-बार मत भेजो',
            success: 'सफलता पाओ',
            codeTip: 'आपका सत्यापन कोड है'
        },
        phonePlaceholder: 'कृपया फ़ोन नंबर दर्ज करें',
        validPlaceholder: 'कैप्चा',
        validBtn: 'सत्यापन कोड प्राप्त करें',
        loginSuccess: 'सफलतापूर्ण प्रवेश'
    },
    requestInfo: {
        withoutUrl: 'अनुरोध पता खाली नहीं हो सकता',
        networkErr: 'नेटवर्क अनुरोध विफल हुआ, कृपया बाद में पुनः प्रयास करें'
    },
    localeMap: {
        ar: 'अरबी',
        bg: 'बल्गेरियाई',
        ca: 'कैटलन',
        cs: 'चेक',
        da: 'दानिश',
        de: 'जर्मन',
        el: 'यूनानी',
        'en-gb': 'अंग्रेज़ी',
        en: 'अंग्रेज़ी',
        es: 'स्पेनिश',
        et: 'एस्तोनियावासी',
        fa: 'फ़ारसी',
        fi: 'फिनिश',
        fr: 'फ्रेंच',
        he: 'यहूदी',
        hi: 'हिन्दी',
        hr: 'क्रोएशियाई',
        hu: 'हंगेरी',
        hy: 'अर्मेनियाई',
        id: 'इन्डोनेशियाई',
        is: 'आइसलैंड का',
        it: 'इतालवी ',
        ja: 'जापानी',
        kn: 'कन्नड़',
        ko: 'कोरियाई',
        'ku-iq': 'केंद्रीय कुर्द',
        lv: 'केंद्रीय कुर्द',
        mk: 'मेसीडोनियन',
        'mn-mn': 'मंगोलियन',
        'ms-my': 'मलायी',
        nb: 'नार्वेजियन',
        'ne-np': 'नेपाली',
        'nl-be': 'फ्लेमिश',
        nl: 'डच',
        pl: 'पोलिश',
        'pt-br': 'ब्राजिलियन पुर्तगाली',
        pt: 'यूरोपीय पुर्तगाली',
        ro: 'रोमानियाई',
        ru: 'रूसी भाषा',
        sk: 'स्लोवाक',
        sl: 'स्लोवेनियाई',
        sr: 'सर्बियाई',
        sv: 'स्वीडिश',
        ta: 'तामिल',
        th: 'थाई',
        tr: 'तुर्की',
        uk: 'यूक्रेनी',
        vi: 'वियतनामी',
        'zh-cn': 'सरलीकृत चीनी',
        'zh-tw': 'परंपरागत चीनी'
    }
}
