export default {
    locale: 'hi',
    country: 'IN',
    sysInfo: {
        sysIntro: 'Vue और चींटी डिजाइन के आधार पर एक आसान-से-उपयोग वाला फ्रंट-एंड डेवलपमेंट फ्रेमवर्क'
    },
    loginForm: {
        byAccountBtn: 'खाता पासवर्ड लॉगिन',
        byPhoneBtn: 'फोन नंबर लॉगिन करें',
        accountPlaceholder: 'कृपया उपयोगकर्ता नाम इनपुट करें',
        passwordPlaceholder: 'कृपया पासवर्ड दर्ज करें',
        autoLogin: 'स्वतः लॉगइन',
        forgetBtn: 'पासवर्ड भूल गए',
        loginBtn: 'लॉग इन करें',
        byAccountTip: {
            emptyErr: 'खाता खाली नहीं हो सकता'
        },
        byPasswordTip: {
            emptyErr: 'पासवर्ड रिक्त नहीं हो सकता'
        },
        byValidTip: {
            emptyErr: 'सत्यापन कोड भरना होगा'
        },
        sendMsg: {
            repeatErr: 'बार-बार मत भेजो',
            success: 'सफलता प्राप्त करो',
            codeTip: 'आपका सत्यापन कोड है'
        },
        phonePlaceholder: 'कृपया फ़ोन नंबर दर्ज करें',
        validPlaceholder: 'कैप्चा',
        validBtn: 'सत्यापन कोड प्राप्त करें',
        loginSuccess: 'सफलतापूर्ण प्रवेश'
    },
    requestInfo: {
        withoutUrl: 'अनुरोध पता खाली नहीं हो सकता',
        networkErr: 'नेटवर्क अनुरोध विफल हुआ, कृपया बाद में पुनः प्रयास करें'
    },
    localeMap: {
        ar: 'अरबी',
        bg: 'बल्गेरियाई',
        ca: 'कैटलन',
        cs: 'चेक',
        da: 'दानिश',
        de: 'जर्मन',
        el: 'यूनानी',
        'en-gb': 'अंग्रेज़ी',
        en: 'अंग्रेज़ी',
        es: 'स्पेनिश',
        et: 'एस्तोनियावासी',
        fa: 'फ़ारसी',
        fi: 'फिनिश',
        fr: 'फ्रेंच',
        he: 'यहूदी',
        hi: 'हिन्दी',
        hr: 'क्रोएशियाई',
        hu: 'हंगेरी',
        hy: 'अर्मेनियाई',
        id: 'इन्डोनेशियाई',
        is: 'आइसलैंड का',
        it: 'इतालवी ',
        ja: 'जापानी',
        kn: 'कन्नड़',
        ko: 'कोरियाई',
        'ku-iq': 'केंद्रीय कुर्द',
        lv: 'केंद्रीय कुर्द',
        mk: 'मेसीडोनियन',
        'mn-mn': 'मंगोलियन',
        'ms-my': 'मलायी',
        nb: 'नार्वेजियन',
        'ne-np': 'नेपाली',
        'nl-be': 'फ्लेमिश',
        nl: 'डच',
        pl: 'पोलिश',
        'pt-br': 'ब्राजिलियन पुर्तगाली',
        pt: 'यूरोपीय पुर्तगाली',
        ro: 'रोमानियाई',
        ru: 'रूसी भाषा',
        sk: 'स्लोवाक',
        sl: 'स्लोवेनियाई',
        sr: 'सर्बियाई',
        sv: 'स्वीडिश',
        ta: 'तामिल',
        th: 'थाई',
        tr: 'तुर्की',
        uk: 'यूक्रेनी',
        vi: 'वियतनामी',
        'zh-cn': 'सरलीकृत चीनी',
        'zh-tw': 'परंपरागत चीनी'
    },
    menuObj: {
        basicFeature: 'मूल क्षमता',
        cpUse: 'घटक उपयोग',
        childMenu: {
            0: 'बुनियादी क्षमताओं की रूपरेखा',
            '0-0': 'फ्रेम समारोह',
            '0-0-0': 'प्रोजेक्ट कॉन्फ़िगरेशन',
            '0-0-1': 'फ्रंट-एंड लॉग',
            '0-0-2': 'स्थानीय मॉक',
            '0-0-3': 'भूमंडलीकरण',
            '0-0-4': 'डेटा शब्दकोश',
            '0-0-5': 'EventBus',
            '0-0-6': 'टूलसेट',
            '0-0-7': 'पहुँच नियंत्रण',
            '0-0-8': 'गर्म कुंजी',
            '0-1': 'पृष्ठ समारोह',
            '0-1-0': 'घटक पृष्ठ',
            '0-1-1': 'url पेज',
            '0-1-2': 'कोई अनुमति पृष्ठ नहीं',
            '0-1-3': '404 पृष्ठ'
        },
        defaultMenu: {
            home: 'घर'
        },
        errorTip: {
            notfoundTip: 'इस पथ के तहत कोई घटक नहीं मिला',
            emptyErr: 'घटक पथ कॉन्फ़िगर नहीं किया गया'
        }
    },
    tagObj: {
        closeAll: 'सभी टैब को बंद करें',
        closeCur: 'वर्तमान टैब बंद करें',
        closeOther: 'अन्य टैग बंद करें',
        closeRight: 'दायाँ लेबल बंद करें',
        singlePage: 'स्वतंत्र पृष्ठ',
        refreshPage: 'पृष्ठ ताज़ा करें',
        errorTip: {
            homePageCloseError: 'मुखपृष्ठ को बंद करने की अनुमति नहीं है'
        }
    }
}
