export default {
    locale: 'hy',
    country: 'AM',
    loginForm: {
        byAccountBtn: 'Հաշվի գաղտնաբառի մուտք',
        byPhoneBtn: 'Հեռախոսահամարի մուտք',
        accountPlaceholder: 'խնդրում ենք մուտքագրել հաշիվ',
        passwordPlaceholder: 'Մուտքագրեք գաղտնաբառը',
        autoLogin: 'ավտոմատ մուտք',
        forgetBtn: 'մոռանալ գաղտնաբառը',
        loginBtn: 'մուտք գործել',
        byAccountTip: {
            emptyErr: 'Հաշիվը չի կարող դատարկ լինել'
        },
        byPasswordTip: {
            emptyErr: 'գաղտնաբառը չի կարող դատարկ լինել'
        },
        byValidTip: {
            emptyErr: 'հաստատման ծածկագիրը պետք է լրացվի'
        },
        sendMsg: {
            repeatErr: 'Մի քանի անգամ ուղարկեք',
            success: 'Ստացեք հաջողություն',
            codeTip: 'Ձեր հաստատման կոդն է'
        },
        phonePlaceholder: 'Մուտքագրեք հեռախոսի համարը',
        validPlaceholder: 'Կապտչա',
        validBtn: 'ստացեք հաստատման կոդ',
        loginSuccess: 'մուտքը հաջող է'
    },
    menuObj: {
        basicFeature: 'Հիմնական ունակություն',
        cpUse: 'Բաղադրիչի օգտագործումը',
        childMenu: {
            0: 'Հիմնական շրջանակ',
            1: 'Հիմնական ունակություն',
            '0-0': 'Vue',
            '0-1': 'Ant նախագծում',
            '1-0': 'Շրջանակի գործառույթ',
            '1-0-0': 'Նախագծի կազմաձևում',
            '1-0-1': 'Առջևի մատյան',
            '1-0-2': 'Տեղական ծաղր',
            '1-0-3': 'համաշխարհայնացում',
            '1-0-4': 'Տվյալների բառարան',
            '1-0-5': 'EventBus- ը',
            '1-0-6': 'Գործիքային գործիք',
            '1-0-7': 'Մուտքի հսկողություն',
            '1-0-8': 'տաք բանալին',
            '1-1': 'Էջի գործառույթ',
            '1-1-0': 'Բաղադրիչի էջը',
            '1-1-1': 'url էջ',
            '1-1-2': 'Թույլտվության էջ չկա',
            '1-1-3': '404 էջ'
        },
        defaultMenu: {
            home: 'տուն'
        },
        errorTip: {
            notfoundTip: 'Ոչ մի բաղադրիչ չի գտնվել այս ուղու տակ',
            emptyErr: 'Բաղադրիչի ուղին կազմաձևված չէ'
        }
    },
    sysInfo: {
        sysIntro: 'Vue- ի և Ant- ի դիզայնի վրա հիմնված հեշտ օգտագործման առջևի զարգացման ծրագիր'
    },
    requestInfo: {
        withoutUrl: 'Հայցի հասցեն չի կարող դատարկ լինել',
        networkErr: 'Networkանցի հարցումը ձախողվեց, փորձեք ավելի ուշ'
    },
    localeMap: {
        ar: 'Արաբերեն',
        bg: 'Բուլղարերեն',
        ca: 'Կատալաներեն',
        cs: 'Չեխերեն',
        da: 'Դանիերեն',
        de: 'Գերմաներեն',
        el: 'Հունական',
        'en-gb': 'Անգլերեն',
        en: 'Անգլերեն',
        es: 'Իսպաներեն',
        et: 'Էստոներեն',
        fa: 'Պարսկերեն',
        fi: 'Ֆիններեն',
        fr: 'Ֆրանսերեն',
        he: 'Եբրայերեն',
        hi: 'Հինդի',
        hr: 'Խորվաթերեն',
        hu: 'Հունգարերեն',
        hy: 'հայերեն',
        id: 'Ինդոնեզերեն',
        is: 'Իսլանդերեն',
        it: 'Իտալերեն ',
        ja: 'Ճապոներեն',
        kn: 'Կաննադա',
        ko: 'Կորեերեն',
        'ku-iq': 'Կենտրոնական քրդերեն',
        lv: 'Կենտրոնական քրդերեն',
        mk: 'Մակեդոներեն',
        'mn-mn': 'Մոնղոլական',
        'ms-my': 'Մալայերեն',
        nb: 'Նորվեգերեն',
        'ne-np': 'Նեպալերեն',
        'nl-be': 'Ֆլամանդական',
        nl: 'Հոլանդերեն',
        pl: 'Լեհերեն',
        'pt-br': 'Բրազիլացի պորտուգալացի',
        pt: 'Եվրոպական պորտուգալերեն',
        ro: 'Ռումիներեն',
        ru: 'Ռուսաց լեզու',
        sk: 'Սլովակերեն',
        sl: 'Սլովեներեն',
        sr: 'Սերբերեն',
        sv: 'Շվեդերեն',
        ta: 'Թամիլերեն',
        th: 'Թայերեն',
        tr: 'Թուրքերեն',
        uk: 'Ուկրաիներեն',
        vi: 'Վիետնամերեն',
        'zh-cn': 'Պարզեցված չինական',
        'zh-tw': 'ավանդական չինարեն'
    },
    tagObj: {
        closeAll: 'Փակեք բոլոր ներդիրները',
        closeCur: 'Փակեք ընթացիկ ներդիրը',
        closeOther: 'Փակեք այլ պիտակները',
        closeRight: 'Փակեք աջ պիտակը',
        singlePage: 'Անկախ էջ',
        refreshPage: 'թարմացնել էջը',
        affixPage: 'Հաստատուն էջ',
        cancelAffixPage: 'Unpin',
        errorTip: {
            homePageCloseError: 'Հիմնական էջը չի թույլատրվում փակել',
            affixPageCloseError: 'Հաստատուն էջը չի թույլատրվում փակել',
            homePageAffixError: 'Հիմնական էջը չի կարող աննկատելի լինել'
        },
        checkSave: 'Doանկանո՞ւմ եք փակել էջը:(Համոզվեք, որ կարմիր պիտակի էջի բովանդակությունը պահպանված է)',
        cancelClose: 'Փակ գործողությունը չեղարկվեց'
    },
    personalCenter: {
        frontendLog: 'Առջևի մատյան',
        customSetting: 'Անհատականացված պարամետրեր',
        logout: 'դուրս գալ'
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'Ներեցեք, ձեր այցելած էջը գոյություն չունի',
            notrightTip: 'Ներեցեք, դուք իրավունք չունեք մուտք գործել այս էջ',
            noserviceTip: 'Ներեցեք, սերվերի հետ ինչ-որ բան չհաջողվեց, փորձեք ավելի ուշ'
        },
        btnText: 'Փակիր էջը'
    },
    searchPanel: {
        btn: {
            search: 'Հարցում',
            shrink: 'Փլուզվել',
            reset: 'Վերակայել',
            unshrink: 'Բացահայտված'
        }
    },
    logline: {
        list: 'Մատյան ցուցակ',
        detail: 'Գրանցման մանրամասները',
        btnList: {
            export: 'Արտահանում',
            remove: 'Դատարկ'
        },
        time: {
            plh: 'Խնդրում ենք ընտրել ժամկետ',
            range: 'ժամկետը',
            halfDay: 'Կես օրվա ընթացքում',
            oneDay: 'մեկ օրվա ընթացքում',
            weekDay: 'մեկ շաբաթվա ընթացքում',
            monthDay: 'Մեկ ամսվա ընթացքում'
        },
        type: {
            logType: 'Գրանցման տեսակը',
            plh: 'Խնդրում ենք ընտրել տեղեկամատյանների տեսակը'
        },
        tableColumns: {
            index: 'Սերիական համար',
            desc: 'Մատյանների նկարագրությունը',
            type: 'Գրանցման տեսակը',
            time: 'ժամանակ',
            op: 'գործող'
        },
        request: 'Հայցել տվյալներ',
        error: {
            cancel: 'Դատարկ գործողությունը չեղարկվեց',
            confirm: 'Doանկանու՞մ եք մաքրել գերանը:(Գրանցամատանը դատարկվելու է և հնարավոր չէ ստանալ)'
        },
        success: 'Գրանցամատյանը դատարկվել է'
    },
    comTable: {
        columns: {
            title: 'Սյունակի պարամետրերը',
            all: 'ընտրել բոլորը',
            reset: 'Վերակայել',
            fixedLeft: 'Հաստատուն ձախ',
            fixedRight: 'Edիշտ է',
            cancelFixed: 'Unpin'
        },
        size: {
            title: 'Տողի բարձրությունը',
            small: 'նեղ',
            normal: 'ներս',
            large: 'լայնությունը'
        },
        fullscreen: 'ամբողջ էկրանով',
        unFullscreen: 'Չեղարկել ամբողջ էկրանը'
    },
    normalBtn: {
        detail: 'Տեսարան'
    }
}
