export default {
    locale: 'hy',
    country: 'AM',
    sysInfo: {
        sysIntro: 'Vue- ի և Ant- ի դիզայնի վրա հիմնված հեշտ օգտագործման առջևի զարգացման ծրագիր'
    },
    loginForm: {
        byAccountBtn: 'Հաշվի գաղտնաբառի մուտք',
        byPhoneBtn: 'Հեռախոսահամարի մուտք',
        accountPlaceholder: 'Մուտքագրեք Մականուն',
        passwordPlaceholder: 'Մուտքագրեք գաղտնաբառը',
        autoLogin: 'ավտոմատ մուտք',
        forgetBtn: 'մոռանալ գաղտնաբառը',
        loginBtn: 'մուտք գործել',
        byAccountTip: {
            emptyErr: 'Հաշիվը չի կարող դատարկ լինել'
        },
        byPasswordTip: {
            emptyErr: 'գաղտնաբառը չի կարող դատարկ լինել'
        },
        byValidTip: {
            emptyErr: 'հաստատման ծածկագիրը պետք է լրացվի'
        },
        sendMsg: {
            repeatErr: 'Մի քանի անգամ ուղարկեք',
            success: 'Ստացեք հաջողություն',
            codeTip: 'Ձեր հաստատման կոդն է'
        },
        phonePlaceholder: 'Մուտքագրեք հեռախոսի համարը',
        validPlaceholder: 'Կապտչա',
        validBtn: 'ստացեք հաստատման կոդ',
        loginSuccess: 'մուտքը հաջող է'
    },
    requestInfo: {
        withoutUrl: 'Հայցի հասցեն չի կարող դատարկ լինել',
        networkErr: 'Networkանցի հարցումը ձախողվեց, փորձեք ավելի ուշ'
    },
    localeMap: {
        ar: 'Արաբերեն',
        bg: 'Բուլղարերեն',
        ca: 'Կատալաներեն',
        cs: 'Չեխերեն',
        da: 'Դանիերեն',
        de: 'Գերմաներեն',
        el: 'Հունական',
        'en-gb': 'Անգլերեն',
        en: 'Անգլերեն',
        es: 'Իսպաներեն',
        et: 'Էստոներեն',
        fa: 'Պարսկերեն',
        fi: 'Ֆիններեն',
        fr: 'Ֆրանսերեն',
        he: 'Եբրայերեն',
        hi: 'Հինդի',
        hr: 'Խորվաթերեն',
        hu: 'Հունգարերեն',
        hy: 'հայերեն',
        id: 'Ինդոնեզերեն',
        is: 'Իսլանդերեն',
        it: 'Իտալերեն ',
        ja: 'Ճապոներեն',
        kn: 'Կաննադա',
        ko: 'Կորեերեն',
        'ku-iq': 'Կենտրոնական քրդերեն',
        lv: 'Կենտրոնական քրդերեն',
        mk: 'Մակեդոներեն',
        'mn-mn': 'Մոնղոլական',
        'ms-my': 'Մալայերեն',
        nb: 'Նորվեգերեն',
        'ne-np': 'Նեպալերեն',
        'nl-be': 'Ֆլամանդական',
        nl: 'Հոլանդերեն',
        pl: 'Լեհերեն',
        'pt-br': 'Բրազիլացի պորտուգալացի',
        pt: 'Եվրոպական պորտուգալերեն',
        ro: 'Ռումիներեն',
        ru: 'Ռուսաց լեզու',
        sk: 'Սլովակերեն',
        sl: 'Սլովեներեն',
        sr: 'Սերբերեն',
        sv: 'Շվեդերեն',
        ta: 'Թամիլերեն',
        th: 'Թայերեն',
        tr: 'Թուրքերեն',
        uk: 'Ուկրաիներեն',
        vi: 'Վիետնամերեն',
        'zh-cn': 'Պարզեցված չինական',
        'zh-tw': 'ավանդական չինարեն'
    },
    menuObj: {
        basicFeature: 'Հիմնական ունակություն',
        cpUse: 'Բաղադրիչի օգտագործումը',
        childMenu: {
            0: 'Շրջանակային հիմնական հնարավորությունները',
            '0-0': 'Շրջանակի գործառույթ',
            '0-0-0': 'Նախագծի կազմաձևում',
            '0-0-1': 'Առջևի մատյան',
            '0-0-2': 'Տեղական ծաղր',
            '0-0-3': 'համաշխարհայնացում',
            '0-0-4': 'Տվյալների բառարան',
            '0-0-5': 'EventBus- ը',
            '0-0-6': 'Գործիքային գործիք',
            '0-0-7': 'Մուտքի հսկողություն',
            '0-0-8': 'տաք բանալին',
            '0-1': 'Էջի գործառույթ',
            '0-1-0': 'Բաղադրիչի էջը',
            '0-1-1': 'url էջ',
            '0-1-2': 'Թույլտվության էջ չկա',
            '0-1-3': '404 էջ'
        }
    }
}
