export default {
    locale: 'kn',
    country: 'IN',
    sysInfo: {
        sysIntro: 'ವ್ಯೂ ಮತ್ತು ಇರುವೆ ವಿನ್ಯಾಸವನ್ನು ಆಧರಿಸಿ ಬಳಸಲು ಸುಲಭವಾದ ಫ್ರಂಟ್-ಎಂಡ್ ಅಭಿವೃದ್ಧಿ ಚೌಕಟ್ಟು'
    },
    loginForm: {
        byAccountBtn: 'ಖಾತೆ ಪಾಸ್ವರ್ಡ್ ಲಾಗಿನ್',
        byPhoneBtn: 'ಫೋನ್ ಸಂಖ್ಯೆ ಲಾಗಿನ್',
        accountPlaceholder: 'ದಯವಿಟ್ಟು ಬಳಕೆದಾರಹೆಸರನ್ನು ನಮೂದಿಸಿ',
        passwordPlaceholder: 'ದಯವಿಟ್ಟು ಪಾಸ್ವರ್ಡ್ ಅನ್ನು ನಮೂದಿಸಿ',
        autoLogin: 'ಸ್ವಯಂ ಲಾಗಿನ್',
        forgetBtn: 'ಪಾಸ್ವರ್ಡ್ ಮರೆತುಬಿಡಿ',
        loginBtn: 'ಲಾಗ್ ಇನ್ ಮಾಡಿ',
        byAccountTip: {
            emptyErr: 'ಖಾತೆ ಖಾಲಿಯಾಗಿರಲು ಸಾಧ್ಯವಿಲ್ಲ'
        },
        byPasswordTip: {
            emptyErr: 'ಪಾಸ್ವರ್ಡ್ ಖಾಲಿಯಾಗಿರಲು ಸಾಧ್ಯವಿಲ್ಲ'
        },
        byValidTip: {
            emptyErr: 'ಪರಿಶೀಲನಾ ಕೋಡ್ ಅನ್ನು ಭರ್ತಿ ಮಾಡಬೇಕು'
        },
        sendMsg: {
            repeatErr: 'ಪದೇ ಪದೇ ಕಳುಹಿಸಬೇಡಿ'
        },
        phonePlaceholder: 'ದಯವಿಟ್ಟು ಫೋನ್ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ',
        validPlaceholder: 'ಕ್ಯಾಪ್ಚಾ',
        validBtn: 'ಪರಿಶೀಲನೆ ಕೋಡ್ ಪಡೆಯಿರಿ'
    },
    localeMap: {
        ar: 'ಅರೇಬಿಕ್',
        bg: 'ಬಲ್ಗೇರಿಯನ್',
        ca: 'ಕೆಟಲಾನ್',
        cs: 'ಜೆಕ್',
        da: 'ಡ್ಯಾನಿಶ್',
        de: 'ಜರ್ಮನ್',
        el: 'ಗ್ರೀಕ್',
        'en-gb': 'ಆಂಗ್ಲ',
        en: 'ಆಂಗ್ಲ',
        es: 'ಸ್ಪ್ಯಾನಿಷ್',
        et: 'ಎಸ್ಟೋನಿಯನ್',
        fa: 'ಪರ್ಷಿಯನ್',
        fi: 'ಫಿನ್ನಿಷ್',
        fr: 'ಫ್ರೆಂಚ್',
        he: 'ಹೀಬ್ರೂ',
        hi: 'ಹಿಂದಿ',
        hr: 'ಕ್ರೊಯೇಷಿಯಾದ',
        hu: 'ಹಂಗೇರಿಯನ್',
        hy: 'ಅರ್ಮೇನಿಯನ್',
        id: 'ಇಂಡೋನೇಷಿಯನ್',
        is: 'ಐಸ್ಲ್ಯಾಂಡಿಕ್',
        it: 'ಇಟಾಲಿಯನ್ ',
        ja: 'ಜಪಾನೀಸ್',
        kn: 'ಕನ್ನಡ',
        ko: 'ಕೊರಿಯನ್',
        'ku-iq': 'ಮಧ್ಯ ಕುರ್ದಿಶ್',
        lv: 'ಮಧ್ಯ ಕುರ್ದಿಶ್',
        mk: 'ಮೆಸಿಡೋನಿಯನ್',
        'mn-mn': 'ಮಂಗೋಲಿಯನ್',
        'ms-my': 'ಮಲಯ',
        nb: 'ನಾರ್ವೇಜಿಯನ್',
        'ne-np': 'ನೇಪಾಳಿ',
        'nl-be': 'ಫ್ಲೆಮಿಶ್',
        nl: 'ಡಚ್',
        pl: 'ಹೊಳಪು ಕೊಡು',
        'pt-br': 'ಬ್ರೆಜಿಲಿಯನ್ ಪೋರ್ಚುಗೀಸ್',
        pt: 'ಯುರೋಪಿಯನ್ ಪೋರ್ಚುಗೀಸ್',
        ro: 'ರೊಮೇನಿಯನ್',
        ru: 'ರಷ್ಯನ್ ಭಾಷೆ',
        sk: 'ಸ್ಲೋವಾಕ್',
        sl: 'ಸ್ಲೊವೇನಿಯನ್',
        sr: 'ಸರ್ಬಿಯನ್',
        sv: 'ಸ್ವೀಡಿಷ್',
        ta: 'ತಮಿಳು',
        th: 'ಥಾಯ್',
        tr: 'ಟರ್ಕಿಶ್',
        uk: 'ಉಕ್ರೇನಿಯನ್',
        vi: 'ವಿಯೆಟ್ನಾಮೀಸ್',
        'zh-cn': 'ಸರಳೀಕೃತ ಚೈನೀಸ್',
        'zh-tw': 'ಸಾಂಪ್ರದಾಯಿಕ ಚೈನೀಸ್'
    }
}
