export default {
    locale: 'kn',
    country: 'IN',
    sysInfo: {
        sysIntro: 'ವ್ಯೂ ಮತ್ತು ಇರುವೆ ವಿನ್ಯಾಸವನ್ನು ಆಧರಿಸಿ ಬಳಸಲು ಸುಲಭವಾದ ಫ್ರಂಟ್-ಎಂಡ್ ಅಭಿವೃದ್ಧಿ ಚೌಕಟ್ಟು'
    },
    loginForm: {
        byAccountBtn: 'ಖಾತೆ ಪಾಸ್ವರ್ಡ್ ಲಾಗಿನ್',
        byPhoneBtn: 'ಫೋನ್ ಸಂಖ್ಯೆ ಲಾಗಿನ್',
        accountPlaceholder: 'ದಯವಿಟ್ಟು ಬಳಕೆದಾರಹೆಸರನ್ನು ನಮೂದಿಸಿ',
        passwordPlaceholder: 'ದಯವಿಟ್ಟು ಪಾಸ್ವರ್ಡ್ ಅನ್ನು ನಮೂದಿಸಿ',
        autoLogin: 'ಸ್ವಯಂ ಲಾಗಿನ್',
        forgetBtn: 'ಪಾಸ್ವರ್ಡ್ ಮರೆತುಬಿಡಿ',
        loginBtn: 'ಲಾಗ್ ಇನ್ ಮಾಡಿ',
        byAccountTip: {
            emptyErr: 'ಖಾತೆ ಖಾಲಿಯಾಗಿರಲು ಸಾಧ್ಯವಿಲ್ಲ'
        },
        byPasswordTip: {
            emptyErr: 'ಪಾಸ್ವರ್ಡ್ ಖಾಲಿಯಾಗಿರಲು ಸಾಧ್ಯವಿಲ್ಲ'
        },
        byValidTip: {
            emptyErr: 'ಪರಿಶೀಲನಾ ಕೋಡ್ ಅನ್ನು ಭರ್ತಿ ಮಾಡಬೇಕು'
        },
        sendMsg: {
            repeatErr: 'ಪದೇ ಪದೇ ಕಳುಹಿಸಬೇಡಿ',
            success: 'ಯಶಸ್ಸು ಪಡೆಯಿರಿ',
            codeTip: 'ನಿಮ್ಮ ಪರಿಶೀಲನಾ ಕೋಡ್ ಆಗಿದೆ'
        },
        phonePlaceholder: 'ದಯವಿಟ್ಟು ಫೋನ್ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ',
        validPlaceholder: 'ಕ್ಯಾಪ್ಚಾ',
        validBtn: 'ಪರಿಶೀಲನೆ ಕೋಡ್ ಪಡೆಯಿರಿ',
        loginSuccess: 'ಲಾಗಿನ್ ಯಶಸ್ವಿಯಾಗಿದೆ'
    },
    requestInfo: {
        withoutUrl: 'ವಿನಂತಿ ವಿಳಾಸ ಖಾಲಿಯಾಗಿರಬಾರದು',
        networkErr: 'ನೆಟ್‌ವರ್ಕ್ ವಿನಂತಿ ವಿಫಲವಾಗಿದೆ, ದಯವಿಟ್ಟು ನಂತರ ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ'
    },
    localeMap: {
        ar: 'ಅರೇಬಿಕ್',
        bg: 'ಬಲ್ಗೇರಿಯನ್',
        ca: 'ಕೆಟಲಾನ್',
        cs: 'ಜೆಕ್',
        da: 'ಡ್ಯಾನಿಶ್',
        de: 'ಜರ್ಮನ್',
        el: 'ಗ್ರೀಕ್',
        'en-gb': 'ಆಂಗ್ಲ',
        en: 'ಆಂಗ್ಲ',
        es: 'ಸ್ಪ್ಯಾನಿಷ್',
        et: 'ಎಸ್ಟೋನಿಯನ್',
        fa: 'ಪರ್ಷಿಯನ್',
        fi: 'ಫಿನ್ನಿಷ್',
        fr: 'ಫ್ರೆಂಚ್',
        he: 'ಹೀಬ್ರೂ',
        hi: 'ಹಿಂದಿ',
        hr: 'ಕ್ರೊಯೇಷಿಯಾದ',
        hu: 'ಹಂಗೇರಿಯನ್',
        hy: 'ಅರ್ಮೇನಿಯನ್',
        id: 'ಇಂಡೋನೇಷಿಯನ್',
        is: 'ಐಸ್ಲ್ಯಾಂಡಿಕ್',
        it: 'ಇಟಾಲಿಯನ್ ',
        ja: 'ಜಪಾನೀಸ್',
        kn: 'ಕನ್ನಡ',
        ko: 'ಕೊರಿಯನ್',
        'ku-iq': 'ಮಧ್ಯ ಕುರ್ದಿಶ್',
        lv: 'ಮಧ್ಯ ಕುರ್ದಿಶ್',
        mk: 'ಮೆಸಿಡೋನಿಯನ್',
        'mn-mn': 'ಮಂಗೋಲಿಯನ್',
        'ms-my': 'ಮಲಯ',
        nb: 'ನಾರ್ವೇಜಿಯನ್',
        'ne-np': 'ನೇಪಾಳಿ',
        'nl-be': 'ಫ್ಲೆಮಿಶ್',
        nl: 'ಡಚ್',
        pl: 'ಹೊಳಪು ಕೊಡು',
        'pt-br': 'ಬ್ರೆಜಿಲಿಯನ್ ಪೋರ್ಚುಗೀಸ್',
        pt: 'ಯುರೋಪಿಯನ್ ಪೋರ್ಚುಗೀಸ್',
        ro: 'ರೊಮೇನಿಯನ್',
        ru: 'ರಷ್ಯನ್ ಭಾಷೆ',
        sk: 'ಸ್ಲೋವಾಕ್',
        sl: 'ಸ್ಲೊವೇನಿಯನ್',
        sr: 'ಸರ್ಬಿಯನ್',
        sv: 'ಸ್ವೀಡಿಷ್',
        ta: 'ತಮಿಳು',
        th: 'ಥಾಯ್',
        tr: 'ಟರ್ಕಿಶ್',
        uk: 'ಉಕ್ರೇನಿಯನ್',
        vi: 'ವಿಯೆಟ್ನಾಮೀಸ್',
        'zh-cn': 'ಸರಳೀಕೃತ ಚೈನೀಸ್',
        'zh-tw': 'ಸಾಂಪ್ರದಾಯಿಕ ಚೈನೀಸ್'
    },
    menuObj: {
        basicFeature: 'ಮೂಲ ಸಾಮರ್ಥ್ಯ',
        cpUse: 'ಘಟಕ ಬಳಕೆ',
        childMenu: {
            0: 'ಫ್ರೇಮ್ವರ್ಕ್ ಮೂಲ ಸಾಮರ್ಥ್ಯಗಳು',
            '0-0': 'ಫ್ರೇಮ್ ಕಾರ್ಯ',
            '0-0-0': 'ಪ್ರಾಜೆಕ್ಟ್ ಕಾನ್ಫಿಗರೇಶನ್',
            '0-0-1': 'ಫ್ರಂಟ್-ಎಂಡ್ ಲಾಗ್',
            '0-0-2': 'ಸ್ಥಳೀಯ ಅಣಕು',
            '0-0-3': 'ಜಾಗತೀಕರಣ',
            '0-0-4': 'ಡೇಟಾ ನಿಘಂಟು',
            '0-0-5': 'ಈವೆಂಟ್ಬಸ್',
            '0-0-6': 'ಟೂಲ್‌ಸೆಟ್',
            '0-0-7': 'ಪ್ರವೇಶ ನಿಯಂತ್ರಣ',
            '0-0-8': 'ಹಾಟ್ ಕೀ',
            '0-1': 'ಪುಟ ಕಾರ್ಯ',
            '0-1-0': 'ಕಾಂಪೊನೆಂಟ್ ಪುಟ',
            '0-1-1': 'url ಪುಟ',
            '0-1-2': 'ಅನುಮತಿ ಪುಟ ಇಲ್ಲ',
            '0-1-3': '404 ಪುಟಗಳು'
        },
        defaultMenu: {
            home: 'ಮನೆ'
        },
        errorTip: {
            notfoundTip: 'ಈ ಮಾರ್ಗದಲ್ಲಿ ಯಾವುದೇ ಘಟಕ ಕಂಡುಬಂದಿಲ್ಲ',
            emptyErr: 'ಕಾಂಪೊನೆಂಟ್ ಪಥವನ್ನು ಕಾನ್ಫಿಗರ್ ಮಾಡಿಲ್ಲ'
        }
    },
    tagObj: {
        closeAll: 'ಎಲ್ಲಾ ಟ್ಯಾಬ್‌ಗಳನ್ನು ಮುಚ್ಚಿ',
        closeCur: 'ಪ್ರಸ್ತುತ ಟ್ಯಾಬ್ ಅನ್ನು ಮುಚ್ಚಿ',
        closeOther: 'ಇತರ ಟ್ಯಾಗ್‌ಗಳನ್ನು ಮುಚ್ಚಿ',
        closeRight: 'ಬಲ ಲೇಬಲ್ ಮುಚ್ಚಿ',
        singlePage: 'ಸ್ವತಂತ್ರ ಪುಟ',
        refreshPage: 'ಪುಟವನ್ನು ರಿಫ್ರೆಶ್ ಮಾಡಿ',
        affixPage: 'ಸ್ಥಿರ ಪುಟ',
        cancelAffixPage: 'ಅನ್ಪಿನ್ ಮಾಡಿ',
        errorTip: {
            homePageCloseError: 'ಮುಖಪುಟವನ್ನು ಮುಚ್ಚಲು ಅನುಮತಿಸಲಾಗುವುದಿಲ್ಲ',
            affixPageCloseError: 'ಸ್ಥಿರ ಪುಟವನ್ನು ಮುಚ್ಚಲು ಅನುಮತಿಸಲಾಗುವುದಿಲ್ಲ',
            homePageAffixError: 'ಮುಖಪುಟವನ್ನು ಪಿನ್ ಮಾಡಲಾಗುವುದಿಲ್ಲ'
        },
        checkSave: 'ನೀವು ಪುಟವನ್ನು ಮುಚ್ಚಲು ಬಯಸುವಿರಾ?(ದಯವಿಟ್ಟು ಕೆಂಪು ಲೇಬಲ್ ಪುಟದ ವಿಷಯವನ್ನು ಉಳಿಸಲಾಗಿದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ)',
        cancelClose: 'ಮುಚ್ಚಿದ ಕಾರ್ಯಾಚರಣೆ ರದ್ದುಗೊಂಡಿದೆ'
    },
    personalCenter: {
        frontendLog: 'ಫ್ರಂಟ್-ಎಂಡ್ ಲಾಗ್',
        customSetting: 'ವೈಯಕ್ತಿಕಗೊಳಿಸಿದ ಸೆಟ್ಟಿಂಗ್‌ಗಳು',
        logout: 'ಸೈನ್ .ಟ್ ಮಾಡಿ'
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'ಕ್ಷಮಿಸಿ, ನೀವು ಭೇಟಿ ನೀಡಿದ ಪುಟ ಅಸ್ತಿತ್ವದಲ್ಲಿಲ್ಲ',
            notrightTip: 'ಕ್ಷಮಿಸಿ, ಈ ಪುಟವನ್ನು ಪ್ರವೇಶಿಸಲು ನಿಮಗೆ ಅನುಮತಿ ಇಲ್ಲ',
            noserviceTip: 'ಕ್ಷಮಿಸಿ, ಸರ್ವರ್‌ನಲ್ಲಿ ಏನೋ ತಪ್ಪಾಗಿದೆ, ದಯವಿಟ್ಟು ನಂತರ ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ'
        },
        btnText: 'ಪುಟವನ್ನು ಮುಚ್ಚಿ'
    }
}
