export default {
    locale: 'kn',
    country: 'IN',
    loginForm: {
        byAccountBtn: 'ಖಾತೆ ಪಾಸ್ವರ್ಡ್ ಲಾಗಿನ್',
        byPhoneBtn: 'ಮೊಬೈಲ್ ಸಂಖ್ಯೆ ಲಾಗಿನ್',
        accountPlaceholder: 'ದಯವಿಟ್ಟು ಖಾತೆಯನ್ನು ನಮೂದಿಸಿ',
        passwordPlaceholder: 'ದಯವಿಟ್ಟು ಪಾಸ್ವರ್ಡ್ ನಮೂದಿಸಿ',
        autoLogin: 'ಸ್ವಯಂ ಲಾಗಿನ್',
        forgetBtn: 'ಪಾಸ್ವರ್ಡ್ ಮರೆತುಬಿಡಿ',
        loginBtn: 'ಲಾಗ್ ಇನ್ ಮಾಡಿ',
        byAccountTip: {
            emptyErr: 'ಖಾತೆ ಖಾಲಿಯಾಗಿರಬಾರದು'
        },
        byPasswordTip: {
            emptyErr: 'ಪಾಸ್ವರ್ಡ್ ಖಾಲಿಯಾಗಿರಲು ಸಾಧ್ಯವಿಲ್ಲ'
        },
        byValidTip: {
            emptyErr: 'ಪರಿಶೀಲನಾ ಕೋಡ್ ಅನ್ನು ಭರ್ತಿ ಮಾಡಬೇಕು'
        },
        sendMsg: {
            repeatErr: 'ಪದೇ ಪದೇ ಕಳುಹಿಸಬೇಡಿ',
            success: 'ಯಶಸ್ವಿಯಾಗಿದೆ',
            codeTip: 'ನಿಮ್ಮ ಪರಿಶೀಲನಾ ಕೋಡ್ ಆಗಿದೆ'
        },
        phonePlaceholder: 'ದಯವಿಟ್ಟು ಫೋನ್ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ',
        validPlaceholder: 'ಪರಿಶೀಲನೆ ಕೋಡ್',
        validBtn: 'ಪರಿಶೀಲನೆ ಕೋಡ್ ಪಡೆಯಿರಿ',
        loginSuccess: 'ಲಾಗಿನ್ ಯಶಸ್ವಿಯಾಗಿದೆ'
    },
    menuObj: {
        basicFeature: 'ಮೂಲ ಸಾಮರ್ಥ್ಯ',
        cpUse: 'ಘಟಕ ಬಳಕೆ',
        childMenu: {
            0: 'ಮೂಲ ಚೌಕಟ್ಟು',
            1: 'ಮೂಲ ಸಾಮರ್ಥ್ಯ',
            '0-0': 'ವ್ಯೂ',
            '0-1': 'ಇರುವೆ ವಿನ್ಯಾಸ',
            '0-2': 'ನಿರ್ವಹಣೆ ವ್ಯೂ ಹತ್ತಿರ',
            '1-0': 'ಫ್ರೇಮ್ವರ್ಕ್ ಕಾರ್ಯ',
            '1-0-0': 'ಪ್ರಾಜೆಕ್ಟ್ ಕಾನ್ಫಿಗರೇಶನ್',
            '1-0-1': 'ಮುಂಭಾಗ ಲಾಗ್',
            '1-0-2': 'ಸ್ಥಳೀಯ ಅಣಕು',
            '1-0-3': 'ಜಾಗತೀಕರಣ',
            '1-0-4': 'ಡೇಟಾ ನಿಘಂಟು',
            '1-0-5': 'ಈವೆಂಟ್ಬಸ್',
            '1-0-6': 'ಟೂಲ್‌ಸೆಟ್',
            '1-0-7': 'ಪ್ರವೇಶ ನಿಯಂತ್ರಣ',
            '1-0-8': 'ಹಾಟ್ ಕೀ',
            '1-1': 'ಪುಟ ಕಾರ್ಯ',
            '1-1-0': 'ಕಾಂಪೊನೆಂಟ್ ಪುಟ',
            '1-1-1': 'url ಪುಟ',
            '1-1-2': 'ಅನುಮತಿ ಪುಟ ಇಲ್ಲ',
            '1-1-3': '404 ಪುಟ'
        },
        errorTip: {
            notfoundTip: 'ಈ ಹಾದಿಯಲ್ಲಿರುವ ಘಟಕ ಕಂಡುಬಂದಿಲ್ಲ',
            emptyErr: 'ಕಾನ್ಫಿಗರ್ ಮಾಡದ ಘಟಕ ಮಾರ್ಗ'
        }
    },
    coreMenuObj: {
        defaultMenu: {
            home: 'ಮನೆ'
        }
    },
    sysInfo: {
        sysIntro: 'ವ್ಯೂ ಮತ್ತು ಇರುವೆ ವಿನ್ಯಾಸವನ್ನು ಆಧರಿಸಿ ಬಳಸಲು ಸುಲಭವಾದ ಮಧ್ಯಮ ಮತ್ತು ಹಿಂಭಾಗದ ಮುಂಭಾಗದ ಕೊನೆಯಲ್ಲಿ ಅಭಿವೃದ್ಧಿ ಚೌಕಟ್ಟು'
    },
    requestInfo: {
        withoutUrl: 'ವಿನಂತಿ ವಿಳಾಸ ಖಾಲಿಯಾಗಿರಬಾರದು',
        networkErr: 'ನೆಟ್‌ವರ್ಕ್ ವಿನಂತಿ ವಿಫಲವಾಗಿದೆ, ದಯವಿಟ್ಟು ನಂತರ ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ'
    },
    localeMap: {
        ar: 'ಅರೇಬಿಕ್',
        bg: 'ಬಲ್ಗೇರಿಯನ್',
        ca: 'ಕೆಟಲಾನ್',
        cs: 'ಜೆಕ್',
        da: 'ಡ್ಯಾನಿಶ್',
        de: 'ಜರ್ಮನ್',
        el: 'ಗ್ರೀಕ್',
        'en-gb': 'ಆಂಗ್ಲ',
        en: 'ಆಂಗ್ಲ',
        es: 'ಸ್ಪ್ಯಾನಿಷ್',
        et: 'ಎಸ್ಟೋನಿಯನ್',
        fa: 'ಪರ್ಷಿಯನ್',
        fi: 'ಫಿನ್ನಿಷ್',
        fr: 'ಫ್ರೆಂಚ್',
        he: 'ಹೀಬ್ರೂ',
        hi: 'ಹಿಂದಿ',
        hr: 'ಕ್ರೊಯೇಷಿಯಾದ',
        hu: 'ಹಂಗೇರಿಯನ್',
        hy: 'ಅರ್ಮೇನಿಯನ್',
        id: 'ಇಂಡೋನೇಷಿಯನ್',
        is: 'ಐಸ್ಲ್ಯಾಂಡಿಕ್',
        it: 'ಇಟಾಲಿಯನ್ ',
        ja: 'ಜಪಾನೀಸ್',
        kn: 'ಕನ್ನಡ',
        ko: 'ಕೊರಿಯನ್',
        'ku-iq': 'ಮಧ್ಯ ಕುರ್ದಿಶ್',
        lv: 'ಮಧ್ಯ ಕುರ್ದಿಶ್',
        mk: 'ಮೆಸಿಡೋನಿಯನ್',
        'mn-mn': 'ಮಂಗೋಲಿಯನ್',
        'ms-my': 'ಮಲಯ',
        nb: 'ನಾರ್ವೇಜಿಯನ್',
        'ne-np': 'ನೇಪಾಳಿ',
        'nl-be': 'ಫ್ಲೆಮಿಶ್',
        nl: 'ಡಚ್',
        pl: 'ಹೊಳಪು ಕೊಡು',
        'pt-br': 'ಬ್ರೆಜಿಲಿಯನ್ ಪೋರ್ಚುಗೀಸ್',
        pt: 'ಯುರೋಪಿಯನ್ ಪೋರ್ಚುಗೀಸ್',
        ro: 'ರೊಮೇನಿಯನ್',
        ru: 'ರಷ್ಯನ್ ಭಾಷೆ',
        sk: 'ಸ್ಲೋವಾಕ್',
        sl: 'ಸ್ಲೊವೇನಿಯನ್',
        sr: 'ಸರ್ಬಿಯನ್',
        sv: 'ಸ್ವೀಡಿಷ್',
        ta: 'ತಮಿಳು',
        th: 'ಥಾಯ್',
        tr: 'ಟರ್ಕಿಶ್',
        uk: 'ಉಕ್ರೇನಿಯನ್',
        vi: 'ವಿಯೆಟ್ನಾಮೀಸ್',
        'zh-cn': 'ಸರಳೀಕೃತ ಚೈನೀಸ್',
        'zh-tw': 'ಸಾಂಪ್ರದಾಯಿಕ ಚೈನೀಸ್'
    },
    tagObj: {
        closeAll: 'ಎಲ್ಲಾ ಟ್ಯಾಬ್‌ಗಳನ್ನು ಮುಚ್ಚಿ',
        closeCur: 'ಪ್ರಸ್ತುತ ಟ್ಯಾಬ್ ಅನ್ನು ಮುಚ್ಚಿ',
        closeOther: 'ಇತರ ಟ್ಯಾಬ್‌ಗಳನ್ನು ಮುಚ್ಚಿ',
        closeRight: 'ಬಲ ಲೇಬಲ್ ಮುಚ್ಚಿ',
        singlePage: 'ಸ್ವತಂತ್ರ ಪುಟ',
        refreshPage: 'ಪುಟವನ್ನು ರಿಫ್ರೆಶ್ ಮಾಡಿ',
        affixPage: 'ಪಿನ್ ಪುಟ',
        cancelAffixPage: 'ಅನ್ಪಿನ್ ಮಾಡಿ',
        errorTip: {
            homePageCloseError: 'ಮುಖಪುಟವನ್ನು ಮುಚ್ಚಲು ಅನುಮತಿಸಲಾಗುವುದಿಲ್ಲ',
            affixPageCloseError: 'ಸ್ಥಿರ ಪುಟವನ್ನು ಮುಚ್ಚಲು ಅನುಮತಿಸಲಾಗುವುದಿಲ್ಲ',
            homePageAffixError: 'ಮುಖಪುಟವನ್ನು ಪಿನ್ ಮಾಡಲಾಗುವುದಿಲ್ಲ'
        },
        checkSave: 'ನೀವು ಪುಟವನ್ನು ಮುಚ್ಚಲು ಬಯಸುವಿರಾ?(ದಯವಿಟ್ಟು ಕೆಂಪು ಬಣ್ಣದಲ್ಲಿ ಗುರುತಿಸಲಾದ ಪುಟದ ವಿಷಯವನ್ನು ಉಳಿಸಲಾಗಿದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ)',
        cancelClose: 'ಮುಚ್ಚುವ ಕಾರ್ಯಾಚರಣೆಯನ್ನು ರದ್ದುಗೊಳಿಸಲಾಗಿದೆ'
    },
    personalCenter: {
        frontendLog: 'ಮುಂಭಾಗ ಲಾಗ್',
        customSetting: 'ವೈಯಕ್ತೀಕರಣ',
        customClean: 'ಸಂರಚನೆಯನ್ನು ತೆರವುಗೊಳಿಸಿ',
        logout: 'ಸೈನ್ .ಟ್ ಮಾಡಿ',
        errorTip: {
            cleanSuccess: 'ಯಶಸ್ವಿಯಾಗಿ ಖಾಲಿ'
        }
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'ಕ್ಷಮಿಸಿ, ನೀವು ಭೇಟಿ ನೀಡಿದ ಪುಟ ಅಸ್ತಿತ್ವದಲ್ಲಿಲ್ಲ',
            notrightTip: 'ಕ್ಷಮಿಸಿ, ಈ ಪುಟವನ್ನು ಪ್ರವೇಶಿಸಲು ನಿಮಗೆ ಅನುಮತಿ ಇಲ್ಲ',
            noserviceTip: 'ಕ್ಷಮಿಸಿ, ಸರ್ವರ್‌ನಲ್ಲಿ ಸಮಸ್ಯೆ ಇದೆ, ದಯವಿಟ್ಟು ನಂತರ ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ'
        },
        btnText: 'ಪುಟವನ್ನು ಮುಚ್ಚಿ'
    },
    searchPanel: {
        btn: {
            search: 'ವಿಚಾರಣೆ',
            shrink: 'ದೂರವಿಡಿ',
            reset: 'ಮರುಹೊಂದಿಸಿ',
            unshrink: 'ಬಿಚ್ಚಿಡಲಾಗಿದೆ'
        }
    },
    logline: {
        list: 'ಲಾಗ್ ಪಟ್ಟಿ',
        detail: 'ಲಾಗ್ ವಿವರಗಳು',
        btnList: {
            export: 'ರಫ್ತು ಮಾಡಿ',
            remove: 'ಖಾಲಿ'
        },
        time: {
            plh: 'ದಯವಿಟ್ಟು ಸಮಯ ಶ್ರೇಣಿಯನ್ನು ಆಯ್ಕೆಮಾಡಿ',
            range: 'ಸಮಯ ಮಿತಿ',
            halfDay: 'ಅರ್ಧ ದಿನ',
            oneDay: 'ಒಂದೇ ದಿನದಲ್ಲಿ',
            weekDay: 'ಒಂದು ವಾರದೊಳಗೆ',
            monthDay: 'ಒಂದು ತಿಂಗಳೊಳಗೆ'
        },
        type: {
            logType: 'ಲಾಗ್ ಪ್ರಕಾರ',
            plh: 'ದಯವಿಟ್ಟು ಲಾಗ್ ಪ್ರಕಾರವನ್ನು ಆಯ್ಕೆಮಾಡಿ'
        },
        tableColumns: {
            index: 'ಕ್ರಮ ಸಂಖ್ಯೆ',
            desc: 'ಲಾಗ್ ವಿವರಣೆ',
            type: 'ಲಾಗ್ ಪ್ರಕಾರ',
            time: 'ಸಮಯ',
            op: 'ಕಾರ್ಯನಿರ್ವಹಿಸುತ್ತಿದೆ'
        },
        request: 'ಡೇಟಾವನ್ನು ವಿನಂತಿಸಿ',
        error: {
            cancel: 'ಖಾಲಿ ಕಾರ್ಯಾಚರಣೆ ರದ್ದುಗೊಂಡಿದೆ',
            confirm: 'ನೀವು ಲಾಗ್ ಅನ್ನು ತೆರವುಗೊಳಿಸಲು ಬಯಸುವಿರಾ?(ಲಾಗ್ ಖಾಲಿಯಾಗಿದ್ದರೆ, ಅದನ್ನು ಹಿಂಪಡೆಯಲು ಸಾಧ್ಯವಿಲ್ಲ)'
        },
        success: 'ಲಾಗ್ ಖಾಲಿಯಾಗಿದೆ'
    },
    comTable: {
        columns: {
            title: 'ಕಾಲಮ್ ಸೆಟ್ಟಿಂಗ್‌ಗಳು',
            all: 'ಎಲ್ಲವನ್ನು ಆರಿಸು',
            reset: 'ಮರುಹೊಂದಿಸಿ',
            fixedLeft: 'ಸ್ಥಿರ ಎಡ',
            fixedRight: 'ಸರಿ',
            cancelFixed: 'ಅನ್ಪಿನ್ ಮಾಡಿ'
        },
        size: {
            title: 'ಸಾಲು ಎತ್ತರ',
            small: 'ಕಿರಿದಾದ',
            normal: 'ಸೈನ್ ಇನ್',
            large: 'ಅಗಲ'
        },
        fullscreen: 'ಪೂರ್ಣ ಪರದೆ',
        unFullscreen: 'ಪೂರ್ಣ ಪರದೆಯನ್ನು ರದ್ದುಗೊಳಿಸಿ'
    },
    normalBtn: {
        detail: 'ನೋಟ'
    },
    setting: {
        customEntry: 'ತ್ವರಿತ ಪ್ರವೇಶ',
        systemSwitch: 'ಸಿಸ್ಟಮ್ ಕಾನ್ಫಿಗರೇಶನ್',
        isMock: 'ಅಣಕಿಸಬೇಕೆ',
        isHotKey: 'ಶಾರ್ಟ್ಕಟ್ ಕೀ ಆಗಿರಲಿ',
        isBreadCrumb: 'ಬ್ರೆಡ್ ಕ್ರಂಬ್ಸ್ ಆಗಿರಲಿ',
        isCache: 'ಸಂಗ್ರಹಿಸಬೇಕೆ',
        isI18n: 'ಅಂತರರಾಷ್ಟ್ರೀಕರಿಸಬೇಕೆ'
    },
    pagingInfo: {
        total: 'ಒಟ್ಟಾಗಿ',
        uint: 'ಲೇಖನ',
        items: 'ರೆಕಾರ್ಡಿಂಗ್'
    }
}
