export default {
    locale: 'mk',
    country: 'MK',
    loginForm: {
        byAccountBtn: 'Пријавување со лозинка за сметка',
        byPhoneBtn: 'Најава за мобилен број',
        accountPlaceholder: 'Внесете корисничко име',
        passwordPlaceholder: 'Внесете лозинка',
        autoLogin: 'автоматско најавување',
        forgetBtn: 'заборавете ја лозинката',
        loginBtn: 'Логирај Се',
        byAccountTip: {
            emptyErr: 'Сметката не може да биде празна'
        },
        byPasswordTip: {
            emptyErr: 'лозинката не може да биде празна'
        },
        byValidTip: {
            emptyErr: 'кодот за верификација мора да се пополни'
        },
        sendMsg: {
            repeatErr: 'Не испраќајте повеќе пати',
            success: 'Успешно',
            codeTip: 'Вашиот код за верификација е'
        },
        phonePlaceholder: 'Внесете телефонски број',
        validPlaceholder: 'Код за верификација',
        validBtn: 'добијте код за верификација',
        loginSuccess: 'најавувањето е успешно'
    },
    menuObj: {
        basicFeature: 'Основна способност',
        cpUse: 'Употреба на компонентата',
        childMenu: {
            0: 'Основна рамка',
            1: 'Основна способност',
            '0-0': 'Vue',
            '0-1': 'Дизајн на мравка',
            '0-2': 'Во близина на Admin Vue',
            '1-0': 'Рамковна функција',
            '1-0-0': 'Конфигурација на проектот',
            '1-0-1': 'Дневник на фронт',
            '1-0-2': 'Локален потсмев',
            '1-0-3': 'глобализацијата',
            '1-0-4': 'Речник за податоци',
            '1-0-5': 'EventBus',
            '1-0-6': 'Сет алатки',
            '1-0-7': 'Контрола на пристап',
            '1-0-8': 'топол клуч',
            '1-1': 'Функција на страницата',
            '1-1-0': 'Страна на компонентата',
            '1-1-1': 'URL-страница',
            '1-1-2': 'Нема страница за дозвола',
            '1-1-3': '404 страница'
        },
        errorTip: {
            notfoundTip: 'Компонентата под оваа патека не беше пронајдена',
            emptyErr: 'Неконфигурирана патека на компонентата'
        }
    },
    coreMenuObj: {
        defaultMenu: {
            home: 'Дома'
        }
    },
    sysInfo: {
        sysIntro: 'Корисна рамка за развој на предниот дел од средната и задната страна, заснована на Vue и мравка Дизајн'
    },
    requestInfo: {
        withoutUrl: 'Адресата за барање не може да биде празна',
        networkErr: 'Барањето за мрежа не успеа, обидете се повторно подоцна'
    },
    localeMap: {
        ar: 'Арапски',
        bg: 'Бугарски',
        ca: 'Каталонски',
        cs: 'Чешки',
        da: 'Дански',
        de: 'Германски',
        el: 'Грчки',
        'en-gb': 'Англиски',
        en: 'Англиски',
        es: 'Шпански',
        et: 'Естонски',
        fa: 'Персиски',
        fi: 'Фински',
        fr: 'Француски',
        he: 'Хебрејски',
        hi: 'Хинди',
        hr: 'Хрватски',
        hu: 'Унгарски',
        hy: 'Ерменски',
        id: 'Индонезиски',
        is: 'Исландски',
        it: 'Италијански ',
        ja: 'Јапонски',
        kn: 'Канада',
        ko: 'Корејски',
        'ku-iq': 'Централен курдски',
        lv: 'Централен курдски',
        mk: 'Македонски',
        'mn-mn': 'Монголски',
        'ms-my': 'Малајски',
        nb: 'Норвешки',
        'ne-np': 'Непалски',
        'nl-be': 'Фламански',
        nl: 'холандски',
        pl: 'Полски',
        'pt-br': 'Бразилски португалски',
        pt: 'Европски португалски',
        ro: 'Романски',
        ru: 'руски јазик',
        sk: 'Словачки',
        sl: 'Словенечки',
        sr: 'Српски',
        sv: 'Шведски',
        ta: 'Тамилски',
        th: 'Тајландски',
        tr: 'Турски',
        uk: 'Украински',
        vi: 'Виетнамски',
        'zh-cn': 'Поедноставен кинески',
        'zh-tw': 'традиционален кинески'
    },
    tagObj: {
        closeAll: 'Затворете ги сите јазичиња',
        closeCur: 'Затвори го тековното јазиче',
        closeOther: 'Затвори други јазичиња',
        closeRight: 'Затворете ја десната етикета',
        singlePage: 'Независна страница',
        refreshPage: 'освежи ја страницата',
        affixPage: 'Игла страница',
        cancelAffixPage: 'Отпечатете го',
        errorTip: {
            homePageCloseError: 'Почетната страница не е дозволено да се затвора',
            affixPageCloseError: 'Фиксната страница не е дозволено да се затвори',
            homePageAffixError: 'Почетната страница не може да се откачи'
        },
        checkSave: 'Дали сакате да ја затворите страницата?(Ве молиме, проверете дали е зачувана содржината на страницата означена со црвено)',
        cancelClose: 'Затвори операција е откажана'
    },
    personalCenter: {
        frontendLog: 'Дневник на фронт',
        customSetting: 'Персонализација',
        customClean: 'Исчистете ја конфигурацијата',
        cacheClean: 'Испразнете ја меморијата',
        logout: 'одјави се',
        errorTip: {
            cleanSuccess: 'Успешно испразнете'
        }
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'За жал, страницата што ја посетивте не постои',
            notrightTip: 'Извинете, немате дозвола за пристап до оваа страница',
            noserviceTip: 'Извинете, се појави проблем со серверот, обидете се повторно подоцна'
        },
        btnText: 'Затвори ја страницата'
    },
    searchPanel: {
        btn: {
            search: 'Прашај се',
            shrink: 'Тргни настрана',
            reset: 'Ресетирај',
            unshrink: 'Расплетува'
        }
    },
    logline: {
        list: 'Список на дневник',
        detail: 'Детали за дневникот',
        btnList: {
            export: 'Извоз',
            remove: 'Празно'
        },
        time: {
            plh: 'Изберете временски опсег',
            range: 'временски рок',
            halfDay: 'Половина ден',
            oneDay: 'за еден ден',
            weekDay: 'во рок од една недела',
            monthDay: 'Во рок од еден месец'
        },
        type: {
            logType: 'Тип на дневник',
            plh: 'Ве молиме изберете тип на дневник'
        },
        tableColumns: {
            index: 'Сериски број',
            desc: 'Опис на дневникот',
            type: 'Тип на дневник',
            time: 'време',
            op: 'работат'
        },
        request: 'Побарајте податоци',
        error: {
            cancel: 'Празната операција е откажана',
            confirm: 'Дали сакате да го исчистите дневникот?(Ако дневникот е испразнет, ​​тој не може да се добие)'
        },
        success: 'Дневникот е испразнет'
    },
    comTable: {
        columns: {
            title: 'Поставки на колоната',
            all: 'Селектирај се',
            reset: 'Ресетирај',
            fixedLeft: 'Поправено лево',
            fixedRight: 'Поправено десно',
            cancelFixed: 'Отпечатете го'
        },
        size: {
            title: 'Висина на редот',
            small: 'тесен',
            normal: 'во',
            large: 'ширина'
        },
        fullscreen: 'цел екран',
        unFullscreen: 'Откажи цел екран'
    },
    normalBtn: {
        detail: 'Преглед'
    },
    setting: {
        customEntry: 'Брз влез',
        systemSwitch: 'Системска конфигурација',
        isMock: 'Без разлика дали се потсмеваат',
        isHotKey: 'Дали клуч за кратенка',
        isBreadCrumb: 'Без разлика дали трошки од леб',
        isCache: 'Дали да се скрие',
        isI18n: 'Дали да се интернационализира'
    },
    pagingInfo: {
        total: 'Во целост',
        uint: 'Член',
        items: 'снимање'
    }
}
