export default {
    locale: 'mk',
    country: 'MK',
    sysInfo: {
        sysIntro: 'Лесна за употреба предна рамка за развој, заснована на дизајн на Vue и мравка'
    },
    loginForm: {
        byAccountBtn: 'Најава за лозинка на сметката',
        byPhoneBtn: 'Најава за телефонски број',
        accountPlaceholder: 'Ве молиме внесете корисничко име',
        passwordPlaceholder: 'Внесете ја лозинката',
        autoLogin: 'автоматско најавување',
        forgetBtn: 'заборави лозинка',
        loginBtn: 'Логирај Се',
        byAccountTip: {
            emptyErr: 'Сметката не може да биде празна'
        },
        byPasswordTip: {
            emptyErr: 'лозинката не може да биде празна'
        },
        byValidTip: {
            emptyErr: 'кодот за верификација мора да биде пополнет'
        },
        sendMsg: {
            repeatErr: 'Не праќајте постојано',
            success: 'Добијте успех',
            codeTip: 'Вашиот код за верификација е'
        },
        phonePlaceholder: 'Внесете го телефонскиот број',
        validPlaceholder: 'Капча',
        validBtn: 'добие код за верификација',
        loginSuccess: 'најавување е успешно'
    },
    requestInfo: {
        withoutUrl: 'Адресата за барање не може да биде празна',
        networkErr: 'Барањето за мрежа не успеа, обидете се повторно подоцна'
    },
    localeMap: {
        ar: 'Арапски',
        bg: 'Бугарски',
        ca: 'Каталонски',
        cs: 'Чешка',
        da: 'Дански',
        de: 'Германски',
        el: 'Грчки',
        'en-gb': 'Англиски',
        en: 'Англиски',
        es: 'Шпански',
        et: 'Естонски',
        fa: 'Персиски',
        fi: 'Фински',
        fr: 'Француски',
        he: 'Хебрејски',
        hi: 'Хинди',
        hr: 'Хрватски',
        hu: 'Унгарски',
        hy: 'Ерменски',
        id: 'Индонезиски',
        is: 'Исландски',
        it: 'Италијански ',
        ja: 'Јапонски',
        kn: 'Каннада',
        ko: 'Корејски',
        'ku-iq': 'Централен курдски јазик',
        lv: 'Централен курдски јазик',
        mk: 'Македонски',
        'mn-mn': 'Монголски',
        'ms-my': 'Малезиски',
        nb: 'Норвешки',
        'ne-np': 'Непалски',
        'nl-be': 'Фламански',
        nl: 'холандски',
        pl: 'Полски',
        'pt-br': 'Бразилски португалски',
        pt: 'Европски португалски',
        ro: 'Романски',
        ru: 'руски јазик',
        sk: 'Словачки',
        sl: 'Словенечки',
        sr: 'Српски',
        sv: 'Шведски',
        ta: 'Тамилски',
        th: 'Тајландски',
        tr: 'Турски',
        uk: 'Украински',
        vi: 'Виетнамски',
        'zh-cn': 'Поедноставен кинески',
        'zh-tw': 'традиционален кинески'
    }
}
