export default {
    locale: 'mk',
    country: 'MK',
    sysInfo: {
        sysIntro: 'Лесна за употреба рамка за развој на предната страна, заснована на дизајн на Вуе и мравка'
    },
    loginForm: {
        byAccountBtn: 'Најава за лозинка на сметката',
        byPhoneBtn: 'Најава за телефонски број',
        accountPlaceholder: 'ве молиме внесете сметка',
        passwordPlaceholder: 'Внесете ја лозинката',
        autoLogin: 'автоматско најавување',
        forgetBtn: 'заборави лозинка',
        loginBtn: 'Логирај Се',
        byAccountTip: {
            emptyErr: 'Сметката не може да биде празна'
        },
        byPasswordTip: {
            emptyErr: 'лозинката не може да биде празна'
        },
        byValidTip: {
            emptyErr: 'кодот за верификација мора да биде пополнет'
        },
        sendMsg: {
            repeatErr: 'Не праќајте постојано',
            success: 'Добијте успех',
            codeTip: 'Вашиот код за верификација е'
        },
        phonePlaceholder: 'Внесете го телефонскиот број',
        validPlaceholder: 'Капча',
        validBtn: 'добие код за верификација',
        loginSuccess: 'најавување е успешно'
    },
    requestInfo: {
        withoutUrl: 'Адресата за барање не може да биде празна',
        networkErr: 'Барањето за мрежа не успеа, обидете се повторно подоцна'
    },
    localeMap: {
        ar: 'Арапски',
        bg: 'Бугарски',
        ca: 'Каталонски',
        cs: 'Чешка',
        da: 'Дански',
        de: 'Германски',
        el: 'Грчки',
        'en-gb': 'Англиски',
        en: 'Англиски',
        es: 'Шпански',
        et: 'Естонски',
        fa: 'Персиски',
        fi: 'Фински',
        fr: 'Француски',
        he: 'Хебрејски',
        hi: 'Хинди',
        hr: 'Хрватски',
        hu: 'Унгарски',
        hy: 'Ерменски',
        id: 'Индонезиски',
        is: 'Исландски',
        it: 'Италијански ',
        ja: 'Јапонски',
        kn: 'Каннада',
        ko: 'Корејски',
        'ku-iq': 'Централен курдски јазик',
        lv: 'Централен курдски јазик',
        mk: 'Македонски',
        'mn-mn': 'Монголски',
        'ms-my': 'Малезиски',
        nb: 'Норвешки',
        'ne-np': 'Непалски',
        'nl-be': 'Фламански',
        nl: 'холандски',
        pl: 'Полски',
        'pt-br': 'Бразилски португалски',
        pt: 'Европски португалски',
        ro: 'Романски',
        ru: 'руски јазик',
        sk: 'Словачки',
        sl: 'Словенечки',
        sr: 'Српски',
        sv: 'Шведски',
        ta: 'Тамилски',
        th: 'Тајландски',
        tr: 'Турски',
        uk: 'Украински',
        vi: 'Виетнамски',
        'zh-cn': 'Поедноставен кинески',
        'zh-tw': 'традиционален кинески'
    },
    menuObj: {
        basicFeature: 'Основна способност',
        cpUse: 'Употреба на компоненти',
        childMenu: {
            0: 'Основна рамка',
            1: 'Основна способност',
            '0-0': 'Vue',
            '0-1': 'Мравка дизајн',
            '1-0': 'Функција на рамка',
            '1-0-0': 'Конфигурација на проектот',
            '1-0-1': 'Дневник од предната страна',
            '1-0-2': 'Локално се потсмеваат',
            '1-0-3': 'глобализација',
            '1-0-4': 'Речник на податоци',
            '1-0-5': 'EventBus',
            '1-0-6': 'Алатки за алатки',
            '1-0-7': 'Контрола на пристап',
            '1-0-8': 'топол клуч',
            '1-1': 'Функција на страница',
            '1-1-0': 'Страна на компонентата',
            '1-1-1': 'урл-страница',
            '1-1-2': 'Нема страница за дозволи',
            '1-1-3': '404 страници'
        },
        defaultMenu: {
            home: 'Дома'
        },
        errorTip: {
            notfoundTip: 'Не се најде компонента под овој пат',
            emptyErr: 'Патеката на компонентата не е конфигурирана'
        }
    },
    tagObj: {
        closeAll: 'Затворете ги сите јазичиња',
        closeCur: 'Затворете го тековното јазиче',
        closeOther: 'Затворете други ознаки',
        closeRight: 'Затворете ја десната етикета',
        singlePage: 'Независна страница',
        refreshPage: 'освежи страница',
        affixPage: 'Фиксна страница',
        cancelAffixPage: 'Отпијте го',
        errorTip: {
            homePageCloseError: 'Не е дозволено затворање на почетната страница',
            affixPageCloseError: 'Фиксната страница не е дозволено да се затвори',
            homePageAffixError: 'Главната страница не може да се откопи'
        },
        checkSave: 'Дали сакате да ја затворите страницата?(Ве молиме проверете дали содржината на страницата со црвена етикета е зачувана)',
        cancelClose: 'Затворената операција е откажана'
    },
    personalCenter: {
        frontendLog: 'Дневник од предната страна',
        customSetting: 'Персонализирани поставки',
        logout: 'одјави се'
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'Извинете, страницата што сте ја посетиле не постои',
            notrightTip: 'Извинете, немате дозвола за пристап до оваа страница',
            noserviceTip: 'Извинете, нешто не беше во ред со серверот, обидете се повторно подоцна'
        },
        btnText: 'Затвори страница'
    },
    searchPanel: {
        btn: {
            search: 'Анкета',
            shrink: 'Колапс',
            reset: 'Ресетирање',
            unshrink: 'Откријат'
        }
    },
    logline: {
        list: 'Список на дневник',
        btnList: {
            export: 'Извоз',
            remove: 'Празен'
        },
        time: {
            plh: 'Изберете временска рамка',
            range: 'временски рок',
            halfDay: 'Во рок од половина ден',
            oneDay: 'за еден ден',
            weekDay: 'во рок од една недела',
            monthDay: 'Во рок од еден месец'
        },
        type: {
            logType: 'Тип на дневник',
            plh: 'Изберете тип на најавување'
        },
        tableColumns: {
            index: 'Сериски број',
            desc: 'Опис на дневникот',
            type: 'Тип на дневник',
            op: 'работење'
        }
    }
}
