export default {
    locale: 'ru',
    country: 'RU',
    loginForm: {
        byAccountBtn: 'Логин пароль логин',
        byPhoneBtn: 'Логин по номеру телефона',
        accountPlaceholder: 'пожалуйста, войдите в аккаунт',
        passwordPlaceholder: 'Пожалуйста, введите пароль',
        autoLogin: 'автоматическая авторизация',
        forgetBtn: 'забыть пароль',
        loginBtn: 'авторизоваться',
        byAccountTip: {
            emptyErr: 'Аккаунт не может быть пустым'
        },
        byPasswordTip: {
            emptyErr: 'пароль не может быть пустым'
        },
        byValidTip: {
            emptyErr: 'код подтверждения должен быть заполнен'
        },
        sendMsg: {
            repeatErr: 'Не отправлять повторно',
            success: 'Добиться успеха',
            codeTip: 'Ваш проверочный код'
        },
        phonePlaceholder: 'Пожалуйста, введите номер телефона',
        validPlaceholder: 'Защитный код',
        validBtn: 'получить код подтверждения',
        loginSuccess: 'Успешный вход в систему'
    },
    menuObj: {
        basicFeature: 'Основные способности',
        cpUse: 'Использование компонентов',
        childMenu: {
            0: 'Основные рамки',
            1: 'Основные способности',
            '0-0': 'Вью',
            '0-1': 'Муравей Дизайн',
            '1-0': 'Функция кадра',
            '1-0-0': 'Конфигурация проекта',
            '1-0-1': 'Входной журнал',
            '1-0-2': 'Локальный макет',
            '1-0-3': 'глобализация',
            '1-0-4': 'Словарь данных',
            '1-0-5': 'EventBus',
            '1-0-6': 'Toolset',
            '1-0-7': 'Контроль доступа',
            '1-0-8': 'горячая клавиша',
            '1-1': 'Функция страницы',
            '1-1-0': 'Страница компонента',
            '1-1-1': 'страница URL',
            '1-1-2': 'Нет разрешения страницы',
            '1-1-3': '404 страницы'
        },
        defaultMenu: {
            home: 'Домой'
        },
        errorTip: {
            notfoundTip: 'Компонент не найден по этому пути',
            emptyErr: 'Путь к компоненту не настроен'
        }
    },
    sysInfo: {
        sysIntro: 'Простая в использовании инфраструктура разработки на основе Vue и Ant Design'
    },
    requestInfo: {
        withoutUrl: 'Адрес запроса не может быть пустым',
        networkErr: 'Сбой сетевого запроса, повторите попытку позже.'
    },
    localeMap: {
        ar: 'арабский',
        bg: 'болгарский',
        ca: 'каталонский',
        cs: 'Чешский',
        da: 'датский',
        de: 'Немецкий',
        el: 'греческий',
        'en-gb': 'английский',
        en: 'английский',
        es: 'испанский',
        et: 'эстонский',
        fa: 'персидский',
        fi: 'финский',
        fr: 'французский язык',
        he: 'иврит',
        hi: 'хинди',
        hr: 'хорватский',
        hu: 'венгерский язык',
        hy: 'армянин',
        id: 'индонезийский',
        is: 'исландский',
        it: 'итальянский ',
        ja: 'японский язык',
        kn: 'каннада',
        ko: 'корейский язык',
        'ku-iq': 'Центральный курдский',
        lv: 'Центральный курдский',
        mk: 'македонский',
        'mn-mn': 'монгольский',
        'ms-my': 'малайский',
        nb: 'Норвежский',
        'ne-np': 'непальский',
        'nl-be': 'фламандский',
        nl: 'нидерландский язык',
        pl: 'полировать',
        'pt-br': 'бразильский португальский',
        pt: 'Европейский португальский',
        ro: 'румынский',
        ru: 'русский язык',
        sk: 'словацкий',
        sl: 'словенский',
        sr: 'сербский',
        sv: 'шведский',
        ta: 'тамильский',
        th: 'тайский',
        tr: 'турецкий',
        uk: 'украинец',
        vi: 'вьетнамский',
        'zh-cn': 'Упрощенный китайский',
        'zh-tw': 'традиционный китайский'
    },
    tagObj: {
        closeAll: 'Закройте все вкладки',
        closeCur: 'Закрыть текущую вкладку',
        closeOther: 'Закрыть другие теги',
        closeRight: 'Закрыть правую метку',
        singlePage: 'Независимая страница',
        refreshPage: 'обновить страницу',
        affixPage: 'Фиксированная страница',
        cancelAffixPage: 'открепить',
        errorTip: {
            homePageCloseError: 'Домашняя страница не может закрываться',
            affixPageCloseError: 'Фиксированная страница не может закрываться',
            homePageAffixError: 'Домашняя страница не может быть закреплена'
        },
        checkSave: 'Вы хотите закрыть страницу?(Пожалуйста, убедитесь, что содержимое страницы с красной этикеткой было сохранено)',
        cancelClose: 'Закрытая операция отменена'
    },
    personalCenter: {
        frontendLog: 'Входной журнал',
        customSetting: 'Персональные настройки',
        logout: 'выход'
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'Извините, страница, которую вы посетили, не существует',
            notrightTip: 'Извините, у вас нет прав доступа к этой странице',
            noserviceTip: 'Извините, что-то пошло не так с сервером, попробуйте позже'
        },
        btnText: 'Закрыть страницу'
    },
    searchPanel: {
        btn: {
            search: 'Запрос',
            shrink: 'коллапс',
            reset: 'Сброс',
            unshrink: 'Открываются'
        }
    },
    logline: {
        list: 'Список журналов',
        detail: 'Детали журнала',
        btnList: {
            export: 'экспорт',
            remove: 'пустой'
        },
        time: {
            plh: 'Пожалуйста, выберите временные рамки',
            range: 'лимит времени',
            halfDay: 'В течение половины дня',
            oneDay: 'В течение одного дня',
            weekDay: 'в течение недели',
            monthDay: 'В течение одного месяца'
        },
        type: {
            logType: 'Тип журнала',
            plh: 'Пожалуйста, выберите тип журнала'
        },
        tableColumns: {
            index: 'Серийный номер',
            desc: 'Описание журнала',
            type: 'Тип журнала',
            time: 'время',
            op: 'операционная'
        },
        request: 'Запрос данных',
        error: {
            cancel: 'Пустая операция отменена',
            confirm: 'Вы хотите очистить журнал?(Журнал будет очищен и не может быть получен)'
        },
        success: 'Лог был опустошен'
    },
    comTable: {
        columns: {
            title: 'Настройки столбца',
            all: 'выбрать все',
            reset: 'Сброс',
            fixedLeft: 'Исправлено слева',
            fixedRight: 'Исправлено справа',
            cancelFixed: 'открепить'
        },
        size: {
            title: 'Высота строки',
            small: 'сужать',
            normal: 'в',
            large: 'ширина'
        },
        fullscreen: 'полноэкранный',
        unFullscreen: 'Отменить полный экран'
    },
    normalBtn: {
        detail: 'Посмотреть'
    }
}
