export default {
    locale: 'ru',
    country: 'RU',
    sysInfo: {
        sysIntro: 'Простая в использовании инфраструктура разработки на основе Vue и Ant Design'
    },
    loginForm: {
        byAccountBtn: 'Логин пароль логин',
        byPhoneBtn: 'Логин по номеру телефона',
        accountPlaceholder: 'Пожалуйста, введите имя пользователя',
        passwordPlaceholder: 'Пожалуйста, введите пароль',
        autoLogin: 'автоматическая авторизация',
        forgetBtn: 'забыть пароль',
        loginBtn: 'авторизоваться',
        byAccountTip: {
            emptyErr: 'Аккаунт не может быть пустым'
        },
        byPasswordTip: {
            emptyErr: 'пароль не может быть пустым'
        },
        byValidTip: {
            emptyErr: 'код подтверждения должен быть заполнен'
        },
        sendMsg: {
            repeatErr: 'Не отправлять повторно',
            success: 'Добиться успеха',
            codeTip: 'Ваш проверочный код'
        },
        phonePlaceholder: 'Пожалуйста, введите номер телефона',
        validPlaceholder: 'Защитный код',
        validBtn: 'получить код подтверждения',
        loginSuccess: 'Вход выполнен успешно'
    },
    requestInfo: {
        withoutUrl: 'Адрес запроса не может быть пустым',
        networkErr: 'Сетевой запрос не выполнен, повторите попытку позже'
    },
    localeMap: {
        ar: 'арабский',
        bg: 'болгарский',
        ca: 'каталонский',
        cs: 'чешский язык',
        da: 'датский',
        de: 'Немецкий',
        el: 'греческий',
        'en-gb': 'английский',
        en: 'английский',
        es: 'испанский язык',
        et: 'эстонский',
        fa: 'персидский',
        fi: 'финский',
        fr: 'Французский',
        he: 'иврит',
        hi: 'хинди',
        hr: 'хорватский',
        hu: 'Венгерский',
        hy: 'армянин',
        id: 'индонезийский',
        is: 'исландский',
        it: 'итальянский ',
        ja: 'Японский',
        kn: 'каннада',
        ko: 'корейский язык',
        'ku-iq': 'Центральный курдский',
        lv: 'Центральный курдский',
        mk: 'македонский',
        'mn-mn': 'монгольский',
        'ms-my': 'малайский',
        nb: 'норвежский язык',
        'ne-np': 'непальский',
        'nl-be': 'фламандский',
        nl: 'нидерландский язык',
        pl: 'польский',
        'pt-br': 'бразильский португальский',
        pt: 'Европейский португальский',
        ro: 'румынский',
        ru: 'русский язык',
        sk: 'словацкий',
        sl: 'словенский',
        sr: 'сербский',
        sv: 'шведский',
        ta: 'тамильский',
        th: 'тайский',
        tr: 'турецкий',
        uk: 'украинец',
        vi: 'вьетнамский',
        'zh-cn': 'Упрощенный китайский',
        'zh-tw': 'традиционный китайский'
    },
    menuObj: {
        basicFeature: 'Основные способности',
        cpUse: 'Использование компонентов',
        childMenu: {
            0: 'Основные возможности фреймворка',
            '0-0': 'Функция кадра',
            '0-0-0': 'Конфигурация проекта',
            '0-0-1': 'Входной журнал',
            '0-0-2': 'Локальный макет',
            '0-0-3': 'глобализация',
            '0-0-4': 'Словарь с данными',
            '0-0-5': 'EventBus',
            '0-0-6': 'Toolset',
            '0-0-7': 'Контроль доступа',
            '0-0-8': 'горячая клавиша',
            '0-1': 'Функция страницы',
            '0-1-0': 'Страница компонента',
            '0-1-1': 'страница URL',
            '0-1-2': 'Нет разрешения страницы',
            '0-1-3': '404 страницы'
        },
        defaultMenu: {
            home: 'Дом'
        },
        errorTip: {
            notfoundTip: 'Компонент не найден по этому пути',
            emptyErr: 'Путь к компоненту не настроен'
        }
    },
    tagObj: {
        closeAll: 'Закройте все вкладки',
        closeCur: 'Закрыть текущую вкладку',
        closeOther: 'Закрыть другие теги',
        closeRight: 'Закрыть правую метку',
        singlePage: 'Независимая страница',
        refreshPage: 'обновить страницу',
        errorTip: {
            homePageCloseError: 'Домашняя страница не может закрываться'
        }
    }
}
