export default {
    locale: 'sr',
    country: 'RS',
    sysInfo: {
        sysIntro: 'Предњи развојни оквир једноставан за употребу заснован на Вуе и Ант Десигн'
    },
    loginForm: {
        byAccountBtn: 'Пријављивање лозинке налога',
        byPhoneBtn: 'Пријављивање телефонског броја',
        accountPlaceholder: 'Унесите корисничко име',
        passwordPlaceholder: 'Молимо унесите лозинку',
        autoLogin: 'аутоматска пријава',
        forgetBtn: 'заборави шифру',
        loginBtn: 'Пријавите се',
        byAccountTip: {
            emptyErr: 'Налог не може бити празан'
        },
        byPasswordTip: {
            emptyErr: 'празна лозинка не може бити'
        },
        byValidTip: {
            emptyErr: 'верификациони код мора бити попуњен'
        },
        sendMsg: {
            repeatErr: 'Не шаљите више пута',
            success: 'Добити успех',
            codeTip: 'Ваш верификациони код је'
        },
        phonePlaceholder: 'Молимо унесите број телефона',
        validPlaceholder: 'Цаптцха',
        validBtn: 'набавите верификациони код',
        loginSuccess: 'пријављивање успешно'
    },
    requestInfo: {
        withoutUrl: 'Адреса захтева не може бити празна',
        networkErr: 'Захтев за мрежу није успео. Покушајте поново касније'
    },
    localeMap: {
        ar: 'Арапски',
        bg: 'Бугарски',
        ca: 'Каталонски',
        cs: 'Чешки',
        da: 'Дански',
        de: 'Немачки',
        el: 'Грчки',
        'en-gb': 'енглески језик',
        en: 'енглески језик',
        es: 'Шпански',
        et: 'Естонски',
        fa: 'Перзијски',
        fi: 'Фински',
        fr: 'Француски',
        he: 'Хебрејски',
        hi: 'Хиндски',
        hr: 'Хрватски',
        hu: 'Мађарски',
        hy: 'Арменски',
        id: 'Индонежански',
        is: 'Исландски',
        it: 'Италијан ',
        ja: 'Јапански',
        kn: 'Каннада',
        ko: 'корејски',
        'ku-iq': 'Централ Курдисх',
        lv: 'Централ Курдисх',
        mk: 'Македонски',
        'mn-mn': 'Монголски',
        'ms-my': 'Малајски',
        nb: 'Норвешки',
        'ne-np': 'Непалски',
        'nl-be': 'Фламански',
        nl: 'Холандски',
        pl: 'Пољски',
        'pt-br': 'Бразилски португалски',
        pt: 'Европски португалски',
        ro: 'Румунски',
        ru: 'руски језик',
        sk: 'Словачки',
        sl: 'Словеначки',
        sr: 'Српски',
        sv: 'Шведски',
        ta: 'Тамил',
        th: 'Тајландски',
        tr: 'Турски',
        uk: 'Украјински',
        vi: 'Вијетнамски',
        'zh-cn': 'Поједностављени кинески',
        'zh-tw': 'традиционални Кинези'
    },
    menuObj: {
        basicFeature: 'Основна способност',
        cpUse: 'Употреба компонената',
        childMenu: {
            0: 'Основне могућности оквира',
            '0-0': 'Функција оквира',
            '0-0-0': 'Конфигурација пројекта',
            '0-0-1': 'Предњи записник',
            '0-0-2': 'Локални подсмех',
            '0-0-3': 'глобализација',
            '0-0-4': 'Дата Дицтионари',
            '0-0-5': 'ЕвентБус',
            '0-0-6': 'Сет алата',
            '0-0-7': 'Контрола приступа',
            '0-0-8': 'врући тастер',
            '0-1': 'Функција странице',
            '0-1-0': 'Страница са компонентама',
            '0-1-1': 'УРЛ адреса',
            '0-1-2': 'Нема дозволе',
            '0-1-3': '404 страна'
        },
        defaultMenu: {
            home: 'Кућа'
        },
        errorTip: {
            notfoundTip: 'Под овом стазом није пронађена ниједна компонента',
            emptyErr: 'Пут компоненте није конфигурисан'
        }
    },
    tagObj: {
        closeAll: 'Затворите све',
        errorTip: {
            homePageCloseError: 'Није дозвољено затварање почетне странице'
        }
    }
}
