export default {
    locale: 'sr',
    country: 'RS',
    sysInfo: {
        sysIntro: 'Предњи развојни оквир једноставан за употребу заснован на Вуе и Ант Десигн'
    },
    loginForm: {
        byAccountBtn: 'Пријављивање лозинке налога',
        byPhoneBtn: 'Пријављивање телефонског броја',
        accountPlaceholder: 'Унесите корисничко име',
        passwordPlaceholder: 'Молимо унесите лозинку',
        autoLogin: 'аутоматска пријава',
        forgetBtn: 'заборави шифру',
        loginBtn: 'Пријавите се',
        byAccountTip: {
            emptyErr: 'Налог не може бити празан'
        },
        byPasswordTip: {
            emptyErr: 'празна лозинка не може бити'
        },
        byValidTip: {
            emptyErr: 'верификациони код мора бити попуњен'
        },
        sendMsg: {
            repeatErr: 'Не шаљите више пута'
        },
        phonePlaceholder: 'Молимо унесите број телефона',
        validPlaceholder: 'Цаптцха',
        validBtn: 'набавите верификациони код'
    },
    localeMap: {
        ar: 'Арапски',
        bg: 'Бугарски',
        ca: 'Каталонски',
        cs: 'Чешки',
        da: 'Дански',
        de: 'Немачки',
        el: 'Грчки',
        'en-gb': 'енглески језик',
        en: 'енглески језик',
        es: 'Шпански',
        et: 'Естонски',
        fa: 'Перзијски',
        fi: 'Фински',
        fr: 'Француски',
        he: 'Хебрејски',
        hi: 'Хиндски',
        hr: 'Хрватски',
        hu: 'Мађарски',
        hy: 'Арменски',
        id: 'Индонежански',
        is: 'Исландски',
        it: 'Италијан ',
        ja: 'Јапански',
        kn: 'Каннада',
        ko: 'корејски',
        'ku-iq': 'Централ Курдисх',
        lv: 'Централ Курдисх',
        mk: 'Македонски',
        'mn-mn': 'Монголски',
        'ms-my': 'Малајски',
        nb: 'Норвешки',
        'ne-np': 'Непалски',
        'nl-be': 'Фламански',
        nl: 'Холандски',
        pl: 'Пољски',
        'pt-br': 'Бразилски португалски',
        pt: 'Европски португалски',
        ro: 'Румунски',
        ru: 'руски језик',
        sk: 'Словачки',
        sl: 'Словеначки',
        sr: 'Српски',
        sv: 'Шведски',
        ta: 'Тамил',
        th: 'Тајландски',
        tr: 'Турски',
        uk: 'Украјински',
        vi: 'Вијетнамски',
        'zh-cn': 'Поједностављени кинески',
        'zh-tw': 'традиционални Кинези'
    }
}
