export default {
    locale: 'sr',
    country: 'RS',
    loginForm: {
        byAccountBtn: 'Пријављивање лозинке налога',
        byPhoneBtn: 'Пријављивање броја мобилног телефона',
        accountPlaceholder: 'унесите налог',
        passwordPlaceholder: 'Молим вас укуцајте лозинку',
        autoLogin: 'аутоматска пријава',
        forgetBtn: 'заборави шифру',
        loginBtn: 'Пријавите се',
        byAccountTip: {
            emptyErr: 'Налог не може бити празан'
        },
        byPasswordTip: {
            emptyErr: 'празна лозинка не може бити'
        },
        byValidTip: {
            emptyErr: 'верификациони код мора бити попуњен'
        },
        sendMsg: {
            repeatErr: 'Не шаљите више пута',
            success: 'Успешан',
            codeTip: 'Ваш верификациони код је'
        },
        phonePlaceholder: 'Молимо унесите број телефона',
        validPlaceholder: 'Верификациони код',
        validBtn: 'набавите верификациони код',
        loginSuccess: 'успешно пријављивање'
    },
    menuObj: {
        basicFeature: 'Основна способност',
        cpUse: 'Употреба компонената',
        childMenu: {
            0: 'Основни оквир',
            1: 'Основна способност',
            '0-0': 'Вуе',
            '0-1': 'Ант Десигн',
            '1-0': 'Оквирна функција',
            '1-0-0': 'Конфигурација пројекта',
            '1-0-1': 'Фронтенд лог',
            '1-0-2': 'Локални подсмех',
            '1-0-3': 'глобализација',
            '1-0-4': 'Дата Дицтионари',
            '1-0-5': 'ЕвентБус',
            '1-0-6': 'Сет алата',
            '1-0-7': 'Контрола приступа',
            '1-0-8': 'врући тастер',
            '1-1': 'Функција странице',
            '1-1-0': 'Страница са компонентама',
            '1-1-1': 'УРЛ адреса',
            '1-1-2': 'Нема дозволе',
            '1-1-3': '404 страна'
        },
        defaultMenu: {
            home: 'Кућа'
        },
        errorTip: {
            notfoundTip: 'Компонента испод ове стазе није пронађена',
            emptyErr: 'Неконфигурисан пут компоненте'
        }
    },
    sysInfo: {
        sysIntro: 'Средњи и задњи развојни оквир једноставног за коришћење заснован на Вуе и Ант Десигн'
    },
    requestInfo: {
        withoutUrl: 'Адреса захтева не може бити празна',
        networkErr: 'Захтев за мрежу није успео. Покушајте поново касније'
    },
    localeMap: {
        ar: 'Арапски',
        bg: 'Бугарски',
        ca: 'Каталонски',
        cs: 'Чешки',
        da: 'Дански',
        de: 'Немачки',
        el: 'Грчки',
        'en-gb': 'енглески језик',
        en: 'енглески језик',
        es: 'Шпански',
        et: 'Естонски',
        fa: 'Перзијски',
        fi: 'Фински',
        fr: 'Француски',
        he: 'Хебрејски',
        hi: 'Хиндски',
        hr: 'Хрватски',
        hu: 'Мађарски',
        hy: 'Арменски',
        id: 'Индонежански',
        is: 'Исландски',
        it: 'Италијан ',
        ja: 'Јапански',
        kn: 'Каннада',
        ko: 'корејски',
        'ku-iq': 'Централ Курдисх',
        lv: 'Централ Курдисх',
        mk: 'Македонски',
        'mn-mn': 'Монголски',
        'ms-my': 'Малајски',
        nb: 'Норвешки',
        'ne-np': 'Непалски',
        'nl-be': 'Фламански',
        nl: 'Холандски',
        pl: 'Пољски',
        'pt-br': 'Бразилски португалски',
        pt: 'Европски португалски',
        ro: 'Румунски',
        ru: 'руски језик',
        sk: 'Словачки',
        sl: 'Словеначки',
        sr: 'Српски',
        sv: 'Шведски',
        ta: 'Тамил',
        th: 'Тајландски',
        tr: 'Турски',
        uk: 'Украјински',
        vi: 'Вијетнамски',
        'zh-cn': 'Поједностављени кинески',
        'zh-tw': 'традиционални Кинези'
    },
    tagObj: {
        closeAll: 'Затворите све картице',
        closeCur: 'Затвори тренутну картицу',
        closeOther: 'Затворите остале картице',
        closeRight: 'Затворите десну налепницу',
        singlePage: 'Независна страница',
        refreshPage: 'освежи страна',
        affixPage: 'Пин паге',
        cancelAffixPage: 'Откопчај',
        errorTip: {
            homePageCloseError: 'Није дозвољено затварање почетне странице',
            affixPageCloseError: 'Фиксна страница није дозвољена за затварање',
            homePageAffixError: 'Почетна страница се не може уклонити'
        },
        checkSave: 'Да ли желите затворити страницу?(Уверите се да је садржај странице означене црвеном бојом сачуван)',
        cancelClose: 'Операција затварања отказана'
    },
    personalCenter: {
        frontendLog: 'Фронтенд лог',
        customSetting: 'Персонализација',
        customClean: 'Јасна конфигурација',
        logout: 'Одјава',
        errorTip: {
            cleanSuccess: 'Испразните се успешно'
        }
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'Извините, страница коју сте посетили не постоји',
            notrightTip: 'Жао нам је, немате дозволу за приступ овој страници',
            noserviceTip: 'Жао нам је, дошло је до проблема са сервером, покушајте поново касније'
        },
        btnText: 'Затвори страницу'
    },
    searchPanel: {
        btn: {
            search: 'Упит',
            shrink: 'Одложити',
            reset: 'Ресетовати',
            unshrink: 'Рашири'
        }
    },
    logline: {
        list: 'Листа записа',
        detail: 'Детаљи дневника',
        btnList: {
            export: 'Извези',
            remove: 'Празно'
        },
        time: {
            plh: 'Изаберите временски распон',
            range: 'Рок',
            halfDay: 'Пола дана',
            oneDay: 'у једном дану',
            weekDay: 'року од једне седмице',
            monthDay: 'За месец дана'
        },
        type: {
            logType: 'Врста дневника',
            plh: 'Молимо одаберите врсту дневника'
        },
        tableColumns: {
            index: 'Серијски број',
            desc: 'Опис дневника',
            type: 'Врста дневника',
            time: 'време',
            op: 'оперативни'
        },
        request: 'Затражите податке',
        error: {
            cancel: 'Празна операција је отказана',
            confirm: 'Желите ли обрисати дневник?(Ако се дневник испразни, не може се вратити)'
        },
        success: 'Дневник је испражњен'
    },
    comTable: {
        columns: {
            title: 'Подешавања колоне',
            all: 'Изабери све',
            reset: 'Ресетовати',
            fixedLeft: 'Фиксно лево',
            fixedRight: 'Фиксно десно',
            cancelFixed: 'Откопчај'
        },
        size: {
            title: 'Висине реда',
            small: 'узак',
            normal: 'ин',
            large: 'ширина'
        },
        fullscreen: 'цео екран',
        unFullscreen: 'Откажи преко целог екрана'
    },
    normalBtn: {
        detail: 'Поглед'
    },
    setting: {
        customEntry: 'Брзи улазак',
        systemSwitch: 'Конфигурација система',
        isMock: 'Да ли да се ругају',
        isHotKey: 'Да ли тастер за пречицу',
        isBreadCrumb: 'Било да мрвице хлеба',
        isCache: 'Да ли желите кеширати',
        isI18n: 'Да ли интернационализовати'
    }
}
