export default {
    locale: 'sr',
    country: 'RS',
    loginForm: {
        byAccountBtn: 'Пријава лозинке налога',
        byPhoneBtn: 'Пријава броја мобилног телефона',
        accountPlaceholder: 'Унесите рачун (подразумевани налог АДМИНИСТРАТУРА)',
        passwordPlaceholder: 'Унесите лозинку (подразумевана лозинка 123456)',
        autoLogin: 'аутоматско пријављивање',
        forgetBtn: 'Заборавили сте лозинку',
        loginBtn: 'Пријавите се',
        byAccountTip: {
            emptyErr: 'Рачун не може бити празан'
        },
        byPasswordTip: {
            emptyErr: 'лозинка не може бити празна'
        },
        byValidTip: {
            emptyErr: 'верификациони код мора бити попуњен'
        },
        sendMsg: {
            repeatErr: 'Не шаљите више пута',
            success: 'Успешан',
            codeTip: 'Ваш верификациони код је'
        },
        phonePlaceholder: 'Унесите број телефона',
        validPlaceholder: 'Верификациони код',
        validBtn: 'добити верификациони код',
        loginSuccess: 'пријављивање успешно'
    },
    menuObj: {
        basicFeature: 'Основна способност',
        cpUse: 'Употреба компонената',
        childMenu: {
            0: 'Основни оквир',
            1: 'Основна способност',
            '0-0': 'Вуе',
            '0-1': 'Дизајн мрава',
            '0-2': 'Близу администратора Вуе',
            '1-0': 'Оквирна функција',
            '1-0-0': 'Конфигурација пројекта',
            '1-0-1': 'Дневник фронта',
            '1-0-2': 'Лоцал моцк',
            '1-0-3': 'глобализација',
            '1-0-4': 'Дата Дицтионари',
            '1-0-5': 'ЕвентБус',
            '1-0-6': 'Сет алата',
            '1-0-7': 'Контрола приступа',
            '1-0-8': 'врући тастер',
            '1-1': 'Функција странице',
            '1-1-0': 'Страница са компонентама',
            '1-1-1': 'урл паге',
            '1-1-2': 'Нема странице са дозволом',
            '1-1-3': '404 страна'
        },
        errorTip: {
            notfoundTip: 'Компонента испод ове путање није пронађена',
            emptyErr: 'Неконфигурисана путања компоненте'
        }
    },
    coreMenuObj: {
        defaultMenu: {
            home: 'Кућа'
        }
    },
    sysInfo: {
        sysIntro: 'Корисни средњи и позадински фронт-енд развојни оквир заснован на Вуе и Ант дизајну'
    },
    requestInfo: {
        withoutUrl: 'Адреса захтева не може бити празна',
        networkErr: 'Захтев за мрежу није успео, покушајте поново касније'
    },
    localeMap: {
        ar: 'Арапски',
        bg: 'Бугарски',
        ca: 'Каталонски',
        cs: 'Чешки',
        da: 'Дански',
        de: 'Немачки',
        el: 'Грчки',
        'en-gb': 'енглески језик',
        en: 'енглески језик',
        es: 'Шпански',
        et: 'Естонски',
        fa: 'Перзијски',
        fi: 'Фински',
        fr: 'Француски',
        he: 'Хебрејски',
        hi: 'Хинди',
        hr: 'Хрватски',
        hu: 'Мађарски',
        hy: 'Јерменски',
        id: 'Индонежански',
        is: 'Исландски',
        it: 'Италијан ',
        ja: 'Јапански',
        kn: 'Каннада',
        ko: 'корејски',
        'ku-iq': 'Централ Курдисх',
        lv: 'Централ Курдисх',
        mk: 'Македонски',
        'mn-mn': 'Монголски',
        'ms-my': 'Малајски',
        nb: 'Норвешки',
        'ne-np': 'Непалски',
        'nl-be': 'Фламански',
        nl: 'Холандски',
        pl: 'Пољски',
        'pt-br': 'Бразилски португалски',
        pt: 'Европски португалски',
        ro: 'Румунски',
        ru: 'руски језик',
        sk: 'Словачки',
        sl: 'Словеначки',
        sr: 'Српски',
        sv: 'Шведски',
        ta: 'Тамилски',
        th: 'Тхаи',
        tr: 'Турски',
        uk: 'Украјински',
        vi: 'Вијетнамски',
        'zh-cn': 'Поједностављени кинески',
        'zh-tw': 'традиционални кинески'
    },
    tagObj: {
        closeAll: 'Затворите све картице',
        closeCur: 'Затворите тренутну картицу',
        closeOther: 'Затворите друге картице',
        closeRight: 'Затворите десну ознаку',
        singlePage: 'Независна страница',
        refreshPage: 'освежи страна',
        affixPage: 'Прикачи страницу',
        cancelAffixPage: 'Откачи',
        errorTip: {
            homePageCloseError: 'Затварање почетне странице није дозвољено',
            affixPageCloseError: 'Затварање фиксне странице није дозвољено',
            homePageAffixError: 'Почетна страница не може да се откачи'
        },
        checkSave: 'Да ли желите да затворите страницу? (Уверите се да је садржај странице означене црвеном бојом сачуван)',
        cancelClose: 'Затворена операција отказана'
    },
    personalCenter: {
        frontendLog: 'Дневник фронта',
        customSetting: 'Персонализација',
        customClean: 'Јасна конфигурација',
        cacheClean: 'Испразните кеш',
        logout: 'Одјава',
        errorTip: {
            cleanSuccess: 'Испразните успешно'
        }
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'Извините, страница коју сте посетили не постоји',
            notrightTip: 'Жао нам је, немате дозволу за приступ овој страници',
            noserviceTip: 'Жао нам је, дошло је до проблема са сервером, покушајте поново касније'
        },
        btnText: 'Затвори страницу'
    },
    searchPanel: {
        btn: {
            search: 'Распитајте се',
            shrink: 'Одложити',
            reset: 'Ресетовање',
            unshrink: 'Развијте се'
        }
    },
    logline: {
        list: 'Листа дневника',
        detail: 'Детаљи дневника',
        btnList: {
            export: 'Извоз',
            remove: 'Празно'
        },
        time: {
            plh: 'Изаберите временски опсег',
            range: 'Рок',
            halfDay: 'Пола дана',
            oneDay: 'у једном дану',
            weekDay: 'року од једне седмице',
            monthDay: 'У року од месец дана'
        },
        type: {
            logType: 'Тип дневника',
            plh: 'Изаберите врсту дневника'
        },
        tableColumns: {
            index: 'Серијски број',
            desc: 'Опис дневника',
            type: 'Тип дневника',
            time: 'време',
            op: 'оперативни'
        },
        request: 'Затражи податке',
        error: {
            cancel: 'Отказана је празна операција',
            confirm: 'Да ли желите да очистите дневник? (Ако се дневник испразни, не може се вратити)'
        },
        success: 'Дневник је испражњен'
    },
    comTable: {
        delete: {
            title: 'Јасна конфигурација'
        },
        columns: {
            title: 'Подешавања колоне',
            all: 'Изабери све',
            reset: 'Ресетовање',
            fixedLeft: 'Фиксно лево',
            fixedRight: 'Исправљено удесно',
            cancelFixed: 'Откачи'
        },
        size: {
            title: 'Висине реда',
            small: 'узак',
            normal: 'у',
            large: 'ширина'
        },
        fullscreen: 'цео екран',
        unFullscreen: 'Откажите цео екран'
    },
    normalBtn: {
        detail: 'Поглед'
    },
    setting: {
        customEntry: 'Брзи улазак',
        systemSwitch: 'Конфигурација система',
        isMock: 'Било Моцк',
        isHotKey: 'Да ли је то пречица',
        isBreadCrumb: 'Било мрвице хлеба',
        isCache: 'Да ли да се кешира',
        isI18n: 'Да ли интернационализовати'
    },
    pagingInfo: {
        total: 'Укупно',
        uint: 'Члан',
        items: 'снимање'
    }
}
