export default {
    locale: 'ta',
    country: 'IN',
    loginForm: {
        byAccountBtn: 'கணக்கு கடவுச்சொல் உள்நுழைவு',
        byPhoneBtn: 'மொபைல் எண் உள்நுழைவு',
        accountPlaceholder: 'கணக்கை உள்ளிடவும் (இயல்புநிலை கணக்கு ADMIN)',
        passwordPlaceholder: 'கடவுச்சொல்லை உள்ளிடவும் (இயல்புநிலை கடவுச்சொல் 123456)',
        autoLogin: 'தானாக உள்நுழைவு',
        forgetBtn: 'கடவுச்சொல்லை மறந்துவிட்டீர்களா',
        loginBtn: 'உள்நுழைய',
        byAccountTip: {
            emptyErr: 'கணக்கு காலியாக இருக்க முடியாது'
        },
        byPasswordTip: {
            emptyErr: 'கடவுச்சொல் காலியாக இருக்க முடியாது'
        },
        byValidTip: {
            emptyErr: 'சரிபார்ப்புக் குறியீடு நிரப்பப்பட வேண்டும்'
        },
        sendMsg: {
            repeatErr: 'மீண்டும் மீண்டும் அனுப்ப வேண்டாம்',
            success: 'வெற்றி பெற்றது',
            codeTip: 'உங்கள் சரிபார்ப்புக் குறியீடு'
        },
        phonePlaceholder: 'தொலைபேசி எண்ணை உள்ளிடவும்',
        validPlaceholder: 'சரிபார்ப்புக் குறியீடு',
        validBtn: 'சரிபார்ப்புக் குறியீட்டைப் பெறுக',
        loginSuccess: 'உள்நுழைவு வெற்றிகரமாக'
    },
    menuObj: {
        basicFeature: 'அடிப்படை திறன்',
        cpUse: 'உபகரண பயன்பாடு',
        childMenu: {
            0: 'அடிப்படை கட்டமைப்பு',
            1: 'அடிப்படை திறன்',
            '0-0': 'வ்யூ',
            '0-1': 'எறும்பு வடிவமைப்பு',
            '0-2': 'நிர்வாகி வ்யூவுக்கு அருகில்',
            '1-0': 'கட்டமைப்பின் செயல்பாடு',
            '1-0-0': 'திட்ட உள்ளமைவு',
            '1-0-1': 'முன்பக்க பதிவு',
            '1-0-2': 'உள்ளூர் கேலி',
            '1-0-3': 'உலகமயமாக்கல்',
            '1-0-4': 'தரவு அகராதி',
            '1-0-5': 'நிகழ்வுபஸ்',
            '1-0-6': 'கருவி',
            '1-0-7': 'நுழைவு கட்டுப்பாடு',
            '1-0-8': 'சூடான விசை',
            '1-1': 'பக்க செயல்பாடு',
            '1-1-0': 'கூறு பக்கம்',
            '1-1-1': 'url பக்கம்',
            '1-1-2': 'அனுமதி பக்கம் இல்லை',
            '1-1-3': '404 பக்கம்'
        },
        errorTip: {
            notfoundTip: 'இந்த பாதையின் கீழ் உள்ள கூறு காணப்படவில்லை',
            emptyErr: 'கட்டமைக்கப்படாத கூறு பாதை'
        }
    },
    coreMenuObj: {
        defaultMenu: {
            home: 'வீடு'
        }
    },
    sysInfo: {
        sysIntro: 'வ்யூ மற்றும் எறும்பு வடிவமைப்பை அடிப்படையாகக் கொண்ட ஒரு பயனுள்ள நடுத்தர மற்றும் பின்-இறுதி முன்-இறுதி மேம்பாட்டு கட்டமைப்பு'
    },
    requestInfo: {
        withoutUrl: 'கோரிக்கை முகவரி காலியாக இருக்க முடியாது',
        networkErr: 'பிணைய கோரிக்கை தோல்வியுற்றது, பின்னர் மீண்டும் முயற்சிக்கவும்'
    },
    localeMap: {
        ar: 'அரபு',
        bg: 'பல்கேரியன்',
        ca: 'கற்றலான்',
        cs: 'செக்',
        da: 'டேனிஷ்',
        de: 'ஜெர்மன்',
        el: 'கிரேக்கம்',
        'en-gb': 'ஆங்கிலம்',
        en: 'ஆங்கிலம்',
        es: 'ஸ்பானிஷ்',
        et: 'எஸ்டோனியன்',
        fa: 'பாரசீக',
        fi: 'பின்னிஷ்',
        fr: 'பிரஞ்சு',
        he: 'ஹீப்ரு',
        hi: 'இந்தி',
        hr: 'குரோஷியன்',
        hu: 'ஹங்கேரியன்',
        hy: 'ஆர்மீனியன்',
        id: 'இந்தோனேசிய',
        is: 'ஐஸ்லாந்து',
        it: 'இத்தாலிய ',
        ja: 'ஜப்பானியர்கள்',
        kn: 'கன்னடம்',
        ko: 'கொரிய',
        'ku-iq': 'மத்திய குர்திஷ்',
        lv: 'மத்திய குர்திஷ்',
        mk: 'மாசிடோனியன்',
        'mn-mn': 'மங்கோலியன்',
        'ms-my': 'மலாய்',
        nb: 'நோர்வே',
        'ne-np': 'நேபாளி',
        'nl-be': 'பிளெமிஷ்',
        nl: 'டச்சு',
        pl: 'போலிஷ்',
        'pt-br': 'பிரேசிலிய போர்த்துகீசியம்',
        pt: 'ஐரோப்பிய போர்த்துகீசியம்',
        ro: 'ரோமானியன்',
        ru: 'ரஷ்ய மொழி',
        sk: 'ஸ்லோவாக்',
        sl: 'ஸ்லோவேனியன்',
        sr: 'செர்பியன்',
        sv: 'ஸ்வீடிஷ்',
        ta: 'தமிழ்',
        th: 'தாய்',
        tr: 'துருக்கியம்',
        uk: 'உக்ரேனிய',
        vi: 'வியட்நாமிய',
        'zh-cn': 'எளிமைப்படுத்தப்பட்ட சீன',
        'zh-tw': 'பாரம்பரிய சீன'
    },
    tagObj: {
        closeAll: 'எல்லா தாவல்களையும் மூடு',
        closeCur: 'தற்போதைய தாவலை மூடு',
        closeOther: 'பிற தாவல்களை மூடு',
        closeRight: 'வலது லேபிளை மூடு',
        singlePage: 'சுயாதீனமான பக்கம்',
        refreshPage: 'பக்கத்தைப் புதுப்பிக்கவும்',
        affixPage: 'முள் பக்கம்',
        cancelAffixPage: 'Unpin',
        errorTip: {
            homePageCloseError: 'முகப்புப்பக்கத்தை மூட அனுமதிக்கப்படவில்லை',
            affixPageCloseError: 'நிலையான பக்கம் மூட அனுமதிக்கப்படவில்லை',
            homePageAffixError: 'முகப்புப்பக்கத்தை தேர்வு செய்ய முடியாது'
        },
        checkSave: 'பக்கத்தை மூட விரும்புகிறீர்களா? (சிவப்பு நிறத்தில் குறிக்கப்பட்ட பக்கத்தின் உள்ளடக்கம் சேமிக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்தவும்)',
        cancelClose: 'மூடு செயல்பாடு ரத்து செய்யப்பட்டது'
    },
    personalCenter: {
        frontendLog: 'முன்பக்க பதிவு',
        customSetting: 'தனிப்பயனாக்கம்',
        customClean: 'உள்ளமைவை அழி',
        cacheClean: 'கேச் காலியாக',
        logout: 'வெளியேறு',
        errorTip: {
            cleanSuccess: 'வெற்று வெற்றிகரமாக'
        }
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'மன்னிக்கவும், நீங்கள் பார்வையிட்ட பக்கம் இல்லை',
            notrightTip: 'மன்னிக்கவும், இந்தப் பக்கத்தை அணுக உங்களுக்கு அனுமதி இல்லை',
            noserviceTip: 'மன்னிக்கவும், சேவையகத்தில் சிக்கல் ஏற்பட்டது, பின்னர் மீண்டும் முயற்சிக்கவும்'
        },
        btnText: 'பக்கத்தை மூடு'
    },
    searchPanel: {
        btn: {
            search: 'விசாரிக்கவும்',
            shrink: 'ஒதுக்கி வைக்கவும்',
            reset: 'மீட்டமை',
            unshrink: 'திறக்க'
        }
    },
    logline: {
        list: 'பதிவு பட்டியல்',
        detail: 'பதிவு விவரங்கள்',
        btnList: {
            export: 'ஏற்றுமதி',
            remove: 'காலியாக'
        },
        time: {
            plh: 'நேர வரம்பைத் தேர்ந்தெடுக்கவும்',
            range: 'கால எல்லை',
            halfDay: 'அரை நாள்',
            oneDay: 'ஒரு நாளில்',
            weekDay: 'ஒரு வாரத்திற்குள்',
            monthDay: 'ஒரு மாதத்திற்குள்'
        },
        type: {
            logType: 'பதிவு வகை',
            plh: 'பதிவு வகையைத் தேர்ந்தெடுக்கவும்'
        },
        tableColumns: {
            index: 'வரிசை எண்',
            desc: 'பதிவு விளக்கம்',
            type: 'பதிவு வகை',
            time: 'நேரம்',
            op: 'இயங்குகிறது'
        },
        request: 'தரவைக் கோருங்கள்',
        error: {
            cancel: 'வெற்று செயல்பாடு ரத்து செய்யப்பட்டது',
            confirm: 'பதிவை அழிக்க விரும்புகிறீர்களா? (பதிவு காலியாக இருந்தால், அதை மீட்டெடுக்க முடியாது)'
        },
        success: 'பதிவு காலியாகிவிட்டது'
    },
    comTable: {
        columns: {
            title: 'நெடுவரிசை அமைப்புகள்',
            all: 'அனைத்தையும் தெரிவுசெய்',
            reset: 'மீட்டமை',
            fixedLeft: 'நிலையான இடது',
            fixedRight: 'சரி சரி',
            cancelFixed: 'Unpin'
        },
        size: {
            title: 'வரிசை உயரம்',
            small: 'குறுகிய',
            normal: 'இல்',
            large: 'அகலம்'
        },
        fullscreen: 'முழு திரை',
        unFullscreen: 'முழுத் திரையை ரத்துசெய்'
    },
    normalBtn: {
        detail: 'காண்க'
    },
    setting: {
        customEntry: 'விரைவான நுழைவு',
        systemSwitch: 'கணினி கட்டமைப்பு',
        isMock: 'மோக்',
        isHotKey: 'குறுக்குவழி விசையா',
        isBreadCrumb: 'ரொட்டி நொறுக்குத் தீனிகள்',
        isCache: 'கேச் செய்ய வேண்டுமா',
        isI18n: 'சர்வதேசமயமாக்க வேண்டுமா'
    },
    pagingInfo: {
        total: 'மொத்தமாக',
        uint: 'கட்டுரை',
        items: 'பதிவு'
    }
}
