export default {
    locale: 'ta',
    country: 'IN',
    sysInfo: {
        sysIntro: 'வ்யூ மற்றும் எறும்பு வடிவமைப்பை அடிப்படையாகக் கொண்ட சுலபமாக பயன்படுத்தக்கூடிய முன்-இறுதி மேம்பாட்டு கட்டமைப்பு'
    },
    loginForm: {
        byAccountBtn: 'கணக்கு கடவுச்சொல் உள்நுழைவு',
        byPhoneBtn: 'தொலைபேசி எண் உள்நுழைவு',
        accountPlaceholder: 'பயனர்பெயரை உள்ளிடவும்',
        passwordPlaceholder: 'கடவுச்சொல்லை உள்ளிடவும்',
        autoLogin: 'தானாக உள்நுழைவு',
        forgetBtn: 'கடவுச்சொல்லை மறந்து',
        loginBtn: 'உள்நுழைய',
        byAccountTip: {
            emptyErr: 'கணக்கு காலியாக இருக்க முடியாது'
        },
        byPasswordTip: {
            emptyErr: 'கடவுச்சொல் காலியாக இருக்க முடியாது'
        },
        byValidTip: {
            emptyErr: 'சரிபார்ப்புக் குறியீடு நிரப்பப்பட வேண்டும்'
        },
        sendMsg: {
            repeatErr: 'மீண்டும் மீண்டும் அனுப்ப வேண்டாம்',
            success: 'வெற்றி பெறுங்கள்',
            codeTip: 'உங்கள் சரிபார்ப்புக் குறியீடு'
        },
        phonePlaceholder: 'தொலைபேசி எண்ணை உள்ளிடவும்',
        validPlaceholder: 'கேப்ட்சா',
        validBtn: 'சரிபார்ப்புக் குறியீட்டைப் பெறுக',
        loginSuccess: 'உள்நுழைவு வெற்றிகரமாக'
    },
    requestInfo: {
        withoutUrl: 'கோரிக்கை முகவரி காலியாக இருக்க முடியாது',
        networkErr: 'பிணைய கோரிக்கை தோல்வியுற்றது, பின்னர் மீண்டும் முயற்சிக்கவும்'
    },
    localeMap: {
        ar: 'அரபு',
        bg: 'பல்கேரியன்',
        ca: 'கற்றலான்',
        cs: 'செக்',
        da: 'டேனிஷ்',
        de: 'ஜெர்மன்',
        el: 'கிரேக்கம்',
        'en-gb': 'ஆங்கிலம்',
        en: 'ஆங்கிலம்',
        es: 'ஸ்பானிஷ்',
        et: 'எஸ்டோனியன்',
        fa: 'பாரசீக',
        fi: 'பின்னிஷ்',
        fr: 'பிரஞ்சு',
        he: 'ஹீப்ரு',
        hi: 'இந்தி',
        hr: 'குரோஷியன்',
        hu: 'ஹங்கேரியன்',
        hy: 'ஆர்மீனியன்',
        id: 'இந்தோனேசிய',
        is: 'ஐஸ்லாந்து',
        it: 'இத்தாலிய ',
        ja: 'ஜப்பானியர்கள்',
        kn: 'கன்னடம்',
        ko: 'கொரிய',
        'ku-iq': 'மத்திய குர்திஷ்',
        lv: 'மத்திய குர்திஷ்',
        mk: 'மாசிடோனியன்',
        'mn-mn': 'மங்கோலியன்',
        'ms-my': 'மலாய்',
        nb: 'நோர்வே',
        'ne-np': 'நேபாளி',
        'nl-be': 'பிளெமிஷ்',
        nl: 'டச்சு',
        pl: 'போலிஷ்',
        'pt-br': 'பிரேசிலிய போர்த்துகீசியம்',
        pt: 'ஐரோப்பிய போர்த்துகீசியம்',
        ro: 'ரோமானியன்',
        ru: 'ரஷ்ய மொழி',
        sk: 'ஸ்லோவாக்',
        sl: 'ஸ்லோவேனியன்',
        sr: 'செர்பியன்',
        sv: 'ஸ்வீடிஷ்',
        ta: 'தமிழ்',
        th: 'தாய்',
        tr: 'துருக்கியம்',
        uk: 'உக்ரேனிய',
        vi: 'வியட்நாமிய',
        'zh-cn': 'எளிமைப்படுத்தப்பட்ட சீன',
        'zh-tw': 'பாரம்பரிய சீன'
    },
    menuObj: {
        basicFeature: 'அடிப்படை திறன்',
        cpUse: 'உபகரண பயன்பாடு',
        childMenu: {
            0: 'கட்டமைப்பு அடிப்படை திறன்கள்',
            '0-0': 'பிரேம் செயல்பாடு',
            '0-0-0': 'திட்ட உள்ளமைவு',
            '0-0-1': 'முன் இறுதியில் பதிவு',
            '0-0-2': 'உள்ளூர் கேலி',
            '0-0-3': 'உலகமயமாக்கல்',
            '0-0-4': 'தரவு அகராதி',
            '0-0-5': 'நிகழ்வுபஸ்',
            '0-0-6': 'கருவி',
            '0-0-7': 'நுழைவு கட்டுப்பாடு',
            '0-0-8': 'சூடான விசை',
            '0-1': 'பக்க செயல்பாடு',
            '0-1-0': 'கூறு பக்கம்',
            '0-1-1': 'url பக்கம்',
            '0-1-2': 'அனுமதி பக்கம் இல்லை',
            '0-1-3': '404 பக்கங்கள்'
        },
        defaultMenu: {
            home: 'வீடு'
        },
        errorTip: {
            notfoundTip: 'இந்த பாதையின் கீழ் எந்த கூறுகளும் காணப்படவில்லை',
            emptyErr: 'கூறு பாதை உள்ளமைக்கப்படவில்லை'
        }
    }
}
