export default {
    locale: 'th',
    country: 'TH',
    sysInfo: {
        sysIntro: 'เฟรมเวิร์กการพัฒนา front-end ที่ง่ายต่อการใช้งานตาม Vue และ Ant Design'
    },
    loginForm: {
        byAccountBtn: 'เข้าสู่ระบบรหัสผ่านบัญชี',
        byPhoneBtn: 'เข้าสู่ระบบหมายเลขโทรศัพท์',
        accountPlaceholder: 'กรุณาใส่ชื่อผู้ใช้',
        passwordPlaceholder: 'กรุณาใส่รหัสผ่าน',
        autoLogin: 'เข้าสู่ระบบอัตโนมัติ',
        forgetBtn: 'ลืมรหัสผ่าน',
        loginBtn: 'เข้าสู่ระบบ',
        byAccountTip: {
            emptyErr: 'บัญชีต้องไม่ว่างเปล่า'
        },
        byPasswordTip: {
            emptyErr: 'รหัสผ่านต้องไม่ว่างเปล่า'
        },
        byValidTip: {
            emptyErr: 'ต้องกรอกรหัสยืนยัน'
        },
        sendMsg: {
            repeatErr: 'อย่าส่งซ้ำ ๆ'
        },
        phonePlaceholder: 'กรุณาใส่หมายเลขโทรศัพท์',
        validPlaceholder: 'แจ้งลบความคิดเห็น',
        validBtn: 'รับรหัสยืนยัน'
    },
    localeMap: {
        ar: 'ภาษาอาหรับ',
        bg: 'บัลแกเรีย',
        ca: 'คาตาลัน',
        cs: 'สาธารณรัฐเช็ก',
        da: 'เดนมาร์ก',
        de: 'เยอรมัน',
        el: 'กรีก',
        'en-gb': 'อังกฤษ',
        en: 'อังกฤษ',
        es: 'สเปน',
        et: 'เอสโตเนีย',
        fa: 'เปอร์เซีย',
        fi: 'ฟินแลนด์',
        fr: 'ฝรั่งเศส',
        he: 'ชาวอิสราเอล',
        hi: 'ภาษาฮินดี',
        hr: 'โครเอเชีย',
        hu: 'ฮังการี',
        hy: 'อาร์เมเนีย',
        id: 'ชาวอินโดนีเซีย',
        is: 'ไอซ์แลนด์',
        it: 'อิตาลี ',
        ja: 'ญี่ปุ่น',
        kn: 'ดา',
        ko: 'เกาหลี',
        'ku-iq': 'เซ็นทรัลดิช',
        lv: 'เซ็นทรัลดิช',
        mk: 'มาซิโดเนีย',
        'mn-mn': 'มองโกเลีย',
        'ms-my': 'ภาษามลายู',
        nb: 'นอร์เวย์',
        'ne-np': 'เนปาล',
        'nl-be': 'เฟลมิช',
        nl: 'ดัตช์',
        pl: 'ขัด',
        'pt-br': 'โปรตุเกสของบราซิล',
        pt: 'โปรตุเกสยุโรป',
        ro: 'โรมาเนีย',
        ru: 'ภาษารัสเซีย',
        sk: 'สโลวาเกีย',
        sl: 'ภาษาสโลเวเนีย',
        sr: 'เซอร์เบีย',
        sv: 'สวีเดน',
        ta: 'มิลักขะ',
        th: 'ไทย',
        tr: 'ตุรกี',
        uk: 'ยูเครน',
        vi: 'เวียตนาม',
        'zh-cn': 'จีนตัวย่อ',
        'zh-tw': 'ภาษาจีนดั้งเดิม'
    }
}
