export default {
    locale: 'th',
    country: 'TH',
    loginForm: {
        byAccountBtn: 'เข้าสู่ระบบรหัสผ่านบัญชี',
        byPhoneBtn: 'เข้าสู่ระบบหมายเลขโทรศัพท์มือถือ',
        accountPlaceholder: 'กรุณากรอกบัญชี',
        passwordPlaceholder: 'กรุณาใส่รหัสผ่าน',
        autoLogin: 'เข้าสู่ระบบอัตโนมัติ',
        forgetBtn: 'ลืมรหัสผ่าน',
        loginBtn: 'เข้าสู่ระบบ',
        byAccountTip: {
            emptyErr: 'บัญชีต้องไม่ว่างเปล่า'
        },
        byPasswordTip: {
            emptyErr: 'รหัสผ่านต้องไม่ว่างเปล่า'
        },
        byValidTip: {
            emptyErr: 'ต้องกรอกรหัสยืนยัน'
        },
        sendMsg: {
            repeatErr: 'อย่าส่งซ้ำ ๆ',
            success: 'ที่ประสบความสำเร็จ',
            codeTip: 'รหัสยืนยันของคุณคือ'
        },
        phonePlaceholder: 'กรุณาใส่หมายเลขโทรศัพท์',
        validPlaceholder: 'รหัสยืนยัน',
        validBtn: 'รับรหัสยืนยัน',
        loginSuccess: 'เข้าสู่ระบบสำเร็จ'
    },
    menuObj: {
        basicFeature: 'ความสามารถขั้นพื้นฐาน',
        cpUse: 'การใช้ส่วนประกอบ',
        childMenu: {
            0: 'กรอบพื้นฐาน',
            1: 'ความสามารถขั้นพื้นฐาน',
            '0-0': 'Vue',
            '0-1': 'การออกแบบมด',
            '1-0': 'ฟังก์ชั่นกรอบ',
            '1-0-0': 'การกำหนดค่าโครงการ',
            '1-0-1': 'บันทึกส่วนหน้า',
            '1-0-2': 'เยาะเย้ยท้องถิ่น',
            '1-0-3': 'โลกาภิวัตน์',
            '1-0-4': 'พจนานุกรมข้อมูล',
            '1-0-5': 'EventBus',
            '1-0-6': 'toolset',
            '1-0-7': 'การควบคุมการเข้าถึง',
            '1-0-8': 'ปุ่มลัด',
            '1-1': 'ฟังก์ชั่นหน้า',
            '1-1-0': 'หน้าส่วนประกอบ',
            '1-1-1': 'หน้า url',
            '1-1-2': 'ไม่มีหน้าสิทธิ์',
            '1-1-3': 'หน้า 404'
        },
        defaultMenu: {
            home: 'บ้าน'
        },
        errorTip: {
            notfoundTip: 'ไม่พบองค์ประกอบภายใต้เส้นทางนี้',
            emptyErr: 'เส้นทางส่วนประกอบที่ไม่ได้กำหนดค่า'
        }
    },
    sysInfo: {
        sysIntro: 'เฟรมเวิร์กการพัฒนาส่วนหน้าและส่วนหลังที่ใช้งานง่ายซึ่งใช้งานง่ายตาม Vue และ Ant Design'
    },
    requestInfo: {
        withoutUrl: 'ที่อยู่คำขอไม่สามารถว่างเปล่า',
        networkErr: 'คำขอเครือข่ายล้มเหลวโปรดลองอีกครั้งในภายหลัง'
    },
    localeMap: {
        ar: 'ภาษาอาหรับ',
        bg: 'บัลแกเรีย',
        ca: 'คาตาลัน',
        cs: 'สาธารณรัฐเช็ก',
        da: 'เดนมาร์ก',
        de: 'เยอรมัน',
        el: 'กรีก',
        'en-gb': 'อังกฤษ',
        en: 'อังกฤษ',
        es: 'สเปน',
        et: 'เอสโตเนีย',
        fa: 'เปอร์เซีย',
        fi: 'ฟินแลนด์',
        fr: 'ฝรั่งเศส',
        he: 'ชาวอิสราเอล',
        hi: 'ภาษาฮินดี',
        hr: 'โครเอเชีย',
        hu: 'ฮังการี',
        hy: 'อาร์เมเนีย',
        id: 'ชาวอินโดนีเซีย',
        is: 'ไอซ์แลนด์',
        it: 'อิตาลี ',
        ja: 'ญี่ปุ่น',
        kn: 'ดา',
        ko: 'เกาหลี',
        'ku-iq': 'เซ็นทรัลดิช',
        lv: 'เซ็นทรัลดิช',
        mk: 'มาซิโดเนีย',
        'mn-mn': 'มองโกเลีย',
        'ms-my': 'ภาษามลายู',
        nb: 'นอร์เวย์',
        'ne-np': 'เนปาล',
        'nl-be': 'เฟลมิช',
        nl: 'ดัตช์',
        pl: 'ขัด',
        'pt-br': 'โปรตุเกสของบราซิล',
        pt: 'โปรตุเกสยุโรป',
        ro: 'โรมาเนีย',
        ru: 'ภาษารัสเซีย',
        sk: 'สโลวาเกีย',
        sl: 'ภาษาสโลเวเนีย',
        sr: 'เซอร์เบีย',
        sv: 'สวีเดน',
        ta: 'มิลักขะ',
        th: 'ไทย',
        tr: 'ตุรกี',
        uk: 'ยูเครน',
        vi: 'เวียตนาม',
        'zh-cn': 'จีนตัวย่อ',
        'zh-tw': 'ภาษาจีนดั้งเดิม'
    },
    tagObj: {
        closeAll: 'ปิดแท็บทั้งหมด',
        closeCur: 'ปิดแท็บปัจจุบัน',
        closeOther: 'ปิดแท็บอื่น ๆ',
        closeRight: 'ปิดฉลากด้านขวา',
        singlePage: 'หน้าอิสระ',
        refreshPage: 'รีเฟรชหน้า',
        affixPage: 'ปักหมุดหน้า',
        cancelAffixPage: 'เลิกตรึง',
        errorTip: {
            homePageCloseError: 'ไม่อนุญาตให้ปิดโฮมเพจ',
            affixPageCloseError: 'ไม่อนุญาตให้ปิดหน้าถาวร',
            homePageAffixError: 'ไม่สามารถยกเลิกการโฮมเพจได้'
        },
        checkSave: 'คุณต้องการปิดหน้านี้หรือไม่?(โปรดตรวจสอบให้แน่ใจว่าเนื้อหาของหน้าเว็บที่ทำเครื่องหมายเป็นสีแดงถูกบันทึกไว้)',
        cancelClose: 'การดำเนินการปิดถูกยกเลิก'
    },
    personalCenter: {
        frontendLog: 'บันทึกส่วนหน้า',
        customSetting: 'ส่วนบุคคล',
        customClean: 'ล้างการกำหนดค่า',
        logout: 'ออกจากระบบ',
        errorTip: {
            cleanSuccess: 'ว่างเปล่าสำเร็จ'
        }
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'ขออภัยไม่มีหน้าที่คุณเข้าชม',
            notrightTip: 'ขออภัยคุณไม่ได้รับอนุญาตให้เข้าถึงหน้านี้',
            noserviceTip: 'ขออภัยมีปัญหากับเซิร์ฟเวอร์โปรดลองอีกครั้งในภายหลัง'
        },
        btnText: 'ปิดหน้า'
    },
    searchPanel: {
        btn: {
            search: 'สอบถาม',
            shrink: 'เอาออกไป',
            reset: 'ตั้งค่าใหม่',
            unshrink: 'แฉ'
        }
    },
    logline: {
        list: 'รายการบันทึก',
        detail: 'บันทึกรายละเอียด',
        btnList: {
            export: 'ส่งออก',
            remove: 'ว่างเปล่า'
        },
        time: {
            plh: 'โปรดเลือกช่วงเวลา',
            range: 'เวลาที่ จำกัด',
            halfDay: 'ครึ่งวัน',
            oneDay: 'ในหนึ่งวัน',
            weekDay: 'ภายในหนึ่งสัปดาห์',
            monthDay: 'ภายในหนึ่งเดือน'
        },
        type: {
            logType: 'ประเภทบันทึก',
            plh: 'กรุณาเลือกประเภทการบันทึก'
        },
        tableColumns: {
            index: 'หมายเลขซีเรียล',
            desc: 'คำอธิบายบันทึก',
            type: 'ประเภทบันทึก',
            time: 'เวลา',
            op: 'การดำเนินงาน'
        },
        request: 'ขอข้อมูล',
        error: {
            cancel: 'การดำเนินการว่างเปล่าถูกยกเลิก',
            confirm: 'คุณต้องการล้างบันทึกหรือไม่(หากบันทึกถูกทำให้ว่างเปล่าจะไม่สามารถเรียกคืนได้)'
        },
        success: 'บันทึกถูกทำให้ว่างเปล่า'
    },
    comTable: {
        columns: {
            title: 'การตั้งค่าคอลัมน์',
            all: 'เลือกทั้งหมด',
            reset: 'ตั้งค่าใหม่',
            fixedLeft: 'คงที่แล้ว',
            fixedRight: 'คงที่',
            cancelFixed: 'เลิกตรึง'
        },
        size: {
            title: 'ความสูงของแถว',
            small: 'แคบ',
            normal: 'ใน',
            large: 'ความกว้าง'
        },
        fullscreen: 'เต็มจอ',
        unFullscreen: 'ยกเลิกแบบเต็มหน้าจอ'
    },
    normalBtn: {
        detail: 'ดู'
    },
    setting: {
        customEntry: 'รายการด่วน',
        systemSwitch: 'การกำหนดค่าระบบ',
        isMock: 'ไม่ว่าจะเป็นการเยาะเย้ย',
        isHotKey: 'ไม่ว่าจะเป็นปุ่มลัด',
        isBreadCrumb: 'ไม่ว่าจะเป็นขนมปังป่น',
        isCache: 'ไม่ว่าจะเป็นแคช',
        isI18n: 'ไม่ว่าจะเป็นสากล'
    }
}
