export default {
    locale: 'th',
    country: 'TH',
    sysInfo: {
        sysIntro: 'เฟรมเวิร์กการพัฒนา front-end ที่ง่ายต่อการใช้งานตาม Vue และ Ant Design'
    },
    loginForm: {
        byAccountBtn: 'เข้าสู่ระบบรหัสผ่านบัญชี',
        byPhoneBtn: 'เข้าสู่ระบบหมายเลขโทรศัพท์',
        accountPlaceholder: 'กรุณาใส่ชื่อผู้ใช้',
        passwordPlaceholder: 'กรุณาใส่รหัสผ่าน',
        autoLogin: 'เข้าสู่ระบบอัตโนมัติ',
        forgetBtn: 'ลืมรหัสผ่าน',
        loginBtn: 'เข้าสู่ระบบ',
        byAccountTip: {
            emptyErr: 'บัญชีต้องไม่ว่างเปล่า'
        },
        byPasswordTip: {
            emptyErr: 'รหัสผ่านต้องไม่ว่างเปล่า'
        },
        byValidTip: {
            emptyErr: 'ต้องกรอกรหัสยืนยัน'
        },
        sendMsg: {
            repeatErr: 'อย่าส่งซ้ำ ๆ',
            success: 'รับความสำเร็จ',
            codeTip: 'รหัสยืนยันของคุณคือ'
        },
        phonePlaceholder: 'กรุณาใส่หมายเลขโทรศัพท์',
        validPlaceholder: 'แจ้งลบความคิดเห็น',
        validBtn: 'รับรหัสยืนยัน',
        loginSuccess: 'เข้าสู่ระบบสำเร็จ'
    },
    requestInfo: {
        withoutUrl: 'ที่อยู่คำขอไม่สามารถว่างเปล่า',
        networkErr: 'คำขอเครือข่ายล้มเหลวโปรดลองอีกครั้งในภายหลัง'
    },
    localeMap: {
        ar: 'ภาษาอาหรับ',
        bg: 'บัลแกเรีย',
        ca: 'คาตาลัน',
        cs: 'สาธารณรัฐเช็ก',
        da: 'เดนมาร์ก',
        de: 'เยอรมัน',
        el: 'กรีก',
        'en-gb': 'อังกฤษ',
        en: 'อังกฤษ',
        es: 'สเปน',
        et: 'เอสโตเนีย',
        fa: 'เปอร์เซีย',
        fi: 'ฟินแลนด์',
        fr: 'ฝรั่งเศส',
        he: 'ชาวอิสราเอล',
        hi: 'ภาษาฮินดี',
        hr: 'โครเอเชีย',
        hu: 'ฮังการี',
        hy: 'อาร์เมเนีย',
        id: 'ชาวอินโดนีเซีย',
        is: 'ไอซ์แลนด์',
        it: 'อิตาลี ',
        ja: 'ญี่ปุ่น',
        kn: 'ดา',
        ko: 'เกาหลี',
        'ku-iq': 'เซ็นทรัลดิช',
        lv: 'เซ็นทรัลดิช',
        mk: 'มาซิโดเนีย',
        'mn-mn': 'มองโกเลีย',
        'ms-my': 'ภาษามลายู',
        nb: 'นอร์เวย์',
        'ne-np': 'เนปาล',
        'nl-be': 'เฟลมิช',
        nl: 'ดัตช์',
        pl: 'ขัด',
        'pt-br': 'โปรตุเกสของบราซิล',
        pt: 'โปรตุเกสยุโรป',
        ro: 'โรมาเนีย',
        ru: 'ภาษารัสเซีย',
        sk: 'สโลวาเกีย',
        sl: 'ภาษาสโลเวเนีย',
        sr: 'เซอร์เบีย',
        sv: 'สวีเดน',
        ta: 'มิลักขะ',
        th: 'ไทย',
        tr: 'ตุรกี',
        uk: 'ยูเครน',
        vi: 'เวียตนาม',
        'zh-cn': 'จีนตัวย่อ',
        'zh-tw': 'ภาษาจีนดั้งเดิม'
    },
    menuObj: {
        basicFeature: 'ความสามารถขั้นพื้นฐาน',
        cpUse: 'การใช้ส่วนประกอบ',
        childMenu: {
            0: 'กรอบความสามารถพื้นฐาน',
            '0-0': 'ฟังก์ชั่นเฟรม',
            '0-0-0': 'การกำหนดค่าโครงการ',
            '0-0-1': 'บันทึกการทำงานส่วนหน้า',
            '0-0-2': 'เยาะเย้ยท้องถิ่น',
            '0-0-3': 'โลกาภิวัตน์',
            '0-0-4': 'พจนานุกรมข้อมูล',
            '0-0-5': 'EventBus',
            '0-0-6': 'toolset',
            '0-0-7': 'การควบคุมการเข้าถึง',
            '0-0-8': 'ปุ่มลัด',
            '0-1': 'ฟังก์ชั่นหน้า',
            '0-1-0': 'หน้าส่วนประกอบ',
            '0-1-1': 'หน้า url',
            '0-1-2': 'ไม่มีหน้าสิทธิ์',
            '0-1-3': '404 หน้า'
        },
        defaultMenu: {
            home: 'บ้าน'
        },
        errorTip: {
            notfoundTip: 'ไม่พบองค์ประกอบภายใต้เส้นทางนี้',
            emptyErr: 'ไม่ได้กำหนดค่าเส้นทางของส่วนประกอบ'
        }
    },
    tagObj: {
        closeAll: 'ปิดแท็บทั้งหมด',
        closeCur: 'ปิดแท็บปัจจุบัน',
        closeOther: 'ปิดแท็กอื่น ๆ',
        closeRight: 'ปิดฉลากด้านขวา',
        singlePage: 'หน้าอิสระ',
        refreshPage: 'รีเฟรชหน้า',
        affixPage: 'แก้ไขหน้า',
        cancelAffixPage: 'เลิกตรึง',
        errorTip: {
            homePageCloseError: 'ไม่อนุญาตให้ปิดโฮมเพจ',
            affixPageCloseError: 'ไม่อนุญาตให้ปิดหน้าถาวร',
            homePageAffixError: 'ไม่สามารถยกเลิกการโฮมเพจได้'
        },
        checkSave: 'คุณต้องการปิดหน้านี้หรือไม่?(โปรดตรวจสอบให้แน่ใจว่าได้บันทึกเนื้อหาของหน้าป้ายแดงแล้ว)',
        cancelClose: 'ยกเลิกการดำเนินการปิด'
    },
    personalCenter: {
        frontendLog: 'บันทึกการทำงานส่วนหน้า',
        customSetting: 'การตั้งค่าส่วนบุคคล',
        logout: 'ออกจากระบบ'
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'ขออภัยไม่มีหน้าที่คุณเข้าชม',
            notrightTip: 'ขออภัยคุณไม่ได้รับอนุญาตให้เข้าถึงหน้านี้',
            noserviceTip: 'ขออภัยมีข้อผิดพลาดเกิดขึ้นกับเซิร์ฟเวอร์โปรดลองอีกครั้งในภายหลัง'
        },
        btnText: 'ปิดหน้า'
    }
}
