export default {
    locale: 'th',
    country: 'TH',
    loginForm: {
        byAccountBtn: 'เข้าสู่ระบบรหัสผ่านบัญชี',
        byPhoneBtn: 'เข้าสู่ระบบหมายเลขโทรศัพท์มือถือ',
        accountPlaceholder: 'โปรดป้อนบัญชี (ผู้ดูแลระบบเริ่มต้นของบัญชี)',
        passwordPlaceholder: 'โปรดป้อนรหัสผ่าน (รหัสผ่านเริ่มต้น 123456)',
        autoLogin: 'เข้าสู่ระบบอัตโนมัติ',
        forgetBtn: 'ลืมรหัสผ่าน',
        loginBtn: 'เข้าสู่ระบบ',
        byAccountTip: {
            emptyErr: 'บัญชีต้องไม่ว่างเปล่า'
        },
        byPasswordTip: {
            emptyErr: 'รหัสผ่านต้องไม่เว้นว่าง'
        },
        byValidTip: {
            emptyErr: 'ต้องกรอกรหัสยืนยัน'
        },
        sendMsg: {
            repeatErr: 'อย่าส่งซ้ำ ๆ',
            success: 'ประสบความสำเร็จ',
            codeTip: 'รหัสยืนยันของคุณคือ'
        },
        phonePlaceholder: 'กรุณากรอกหมายเลขโทรศัพท์',
        validPlaceholder: 'รหัสยืนยัน',
        validBtn: 'รับรหัสยืนยัน',
        loginSuccess: 'เข้าสู่ระบบสำเร็จ'
    },
    menuObj: {
        basicFeature: 'ความสามารถพื้นฐาน',
        cpUse: 'การใช้ส่วนประกอบ',
        childMenu: {
            0: 'กรอบพื้นฐาน',
            1: 'ความสามารถพื้นฐาน',
            '0-0': 'Vue',
            '0-1': 'การออกแบบมด',
            '0-2': 'ใกล้ Admin Vue',
            '1-0': 'ฟังก์ชัน Framework',
            '1-0-0': 'การกำหนดค่าโครงการ',
            '1-0-1': 'บันทึกส่วนหน้า',
            '1-0-2': 'จำลองท้องถิ่น',
            '1-0-3': 'โลกาภิวัตน์',
            '1-0-4': 'พจนานุกรมข้อมูล',
            '1-0-5': 'EventBus',
            '1-0-6': 'ชุดเครื่องมือ',
            '1-0-7': 'การควบคุมการเข้าถึง',
            '1-0-8': 'คีย์ลัด',
            '1-1': 'ฟังก์ชั่นหน้า',
            '1-1-0': 'หน้าส่วนประกอบ',
            '1-1-1': 'หน้า url',
            '1-1-2': 'หน้าไม่อนุญาต',
            '1-1-3': '404 หน้า'
        },
        errorTip: {
            notfoundTip: 'ไม่พบส่วนประกอบภายใต้เส้นทางนี้',
            emptyErr: 'เส้นทางส่วนประกอบที่ไม่ได้กำหนดค่า'
        }
    },
    coreMenuObj: {
        defaultMenu: {
            home: 'บ้าน'
        }
    },
    sysInfo: {
        sysIntro: 'กรอบการพัฒนา front-end ระดับกลางและส่วนหลังที่มีประโยชน์ตาม Vue และ Ant Design'
    },
    requestInfo: {
        withoutUrl: 'ที่อยู่ขอต้องไม่ว่างเปล่า',
        networkErr: 'คำขอเครือข่ายล้มเหลวโปรดลองอีกครั้งในภายหลัง'
    },
    localeMap: {
        ar: 'อาหรับ',
        bg: 'บัลแกเรีย',
        ca: 'คาตาลัน',
        cs: 'เช็ก',
        da: 'เดนมาร์ก',
        de: 'เยอรมัน',
        el: 'กรีก',
        'en-gb': 'ภาษาอังกฤษ',
        en: 'ภาษาอังกฤษ',
        es: 'ภาษาสเปน',
        et: 'เอสโตเนีย',
        fa: 'เปอร์เซีย',
        fi: 'ภาษาฟินแลนด์',
        fr: 'ฝรั่งเศส',
        he: 'ฮีบรู',
        hi: 'ภาษาฮินดี',
        hr: 'โครเอเชีย',
        hu: 'ฮังการี',
        hy: 'อาร์เมเนีย',
        id: 'ชาวอินโดนีเซีย',
        is: 'ไอซ์แลนด์',
        it: 'อิตาลี',
        ja: 'ญี่ปุ่น',
        kn: 'กันนาดา',
        ko: 'เกาหลี',
        'ku-iq': 'เคิร์ดกลาง',
        lv: 'เคิร์ดกลาง',
        mk: 'มาซิโดเนีย',
        'mn-mn': 'มองโกเลีย',
        'ms-my': 'มาเลย์',
        nb: 'นอร์เวย์',
        'ne-np': 'เนปาล',
        'nl-be': 'เฟลมิช',
        nl: 'ดัตช์',
        pl: 'ขัด',
        'pt-br': 'โปรตุเกสแบบบราซิล',
        pt: 'โปรตุเกสแบบยุโรป',
        ro: 'โรมาเนีย',
        ru: 'ภาษารัสเซีย',
        sk: 'สโลวัก',
        sl: 'สโลเวเนีย',
        sr: 'เซอร์เบีย',
        sv: 'สวีเดน',
        ta: 'ทมิฬ',
        th: 'ไทย',
        tr: 'ตุรกี',
        uk: 'ยูเครน',
        vi: 'เวียดนาม',
        'zh-cn': 'ภาษาจีนตัวย่อ',
        'zh-tw': 'จีนดั้งเดิม'
    },
    tagObj: {
        closeAll: 'ปิดแท็บทั้งหมด',
        closeCur: 'ปิดแท็บปัจจุบัน',
        closeOther: 'ปิดแท็บอื่น ๆ',
        closeRight: 'ปิดป้ายกำกับด้านขวา',
        singlePage: 'หน้าอิสระ',
        refreshPage: 'รีเฟรชหน้า',
        affixPage: 'ตรึงหน้า',
        cancelAffixPage: 'เลิกตรึง',
        errorTip: {
            homePageCloseError: 'ไม่อนุญาตให้ปิดโฮมเพจ',
            affixPageCloseError: 'ไม่อนุญาตให้ปิดเพจคงที่',
            homePageAffixError: 'ไม่สามารถเลิกตรึงหน้าแรกได้'
        },
        checkSave: 'คุณต้องการปิดเพจไหม (โปรดตรวจสอบให้แน่ใจว่าได้บันทึกเนื้อหาของหน้าที่เป็นสีแดงแล้ว)',
        cancelClose: 'ยกเลิกการปิดแล้ว'
    },
    personalCenter: {
        frontendLog: 'บันทึกส่วนหน้า',
        customSetting: 'ส่วนบุคคล',
        customClean: 'ล้างการกำหนดค่า',
        cacheClean: 'ล้างแคช',
        logout: 'ออกจากระบบ',
        errorTip: {
            cleanSuccess: 'ว่างเปล่าสำเร็จ'
        }
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'ขออภัยไม่มีหน้าที่คุณเยี่ยมชม',
            notrightTip: 'ขออภัยคุณไม่ได้รับอนุญาตให้เข้าถึงหน้านี้',
            noserviceTip: 'ขออภัยมีปัญหากับเซิร์ฟเวอร์โปรดลองอีกครั้งในภายหลัง'
        },
        btnText: 'ปิดหน้า'
    },
    searchPanel: {
        btn: {
            search: 'สอบถาม',
            shrink: 'เอาออกไป',
            reset: 'รีเซ็ต',
            unshrink: 'แฉ'
        }
    },
    logline: {
        list: 'รายการบันทึก',
        detail: 'รายละเอียดบันทึก',
        btnList: {
            export: 'ส่งออก',
            remove: 'ว่างเปล่า'
        },
        time: {
            plh: 'โปรดเลือกช่วงเวลา',
            range: 'เวลาที่ จำกัด',
            halfDay: 'ครึ่งวัน',
            oneDay: 'ในวันเดียว',
            weekDay: 'ภายในหนึ่งสัปดาห์',
            monthDay: 'ภายในหนึ่งเดือน'
        },
        type: {
            logType: 'ประเภทบันทึก',
            plh: 'โปรดเลือกประเภทบันทึก'
        },
        tableColumns: {
            index: 'หมายเลขซีเรียล',
            desc: 'คำอธิบายบันทึก',
            type: 'ประเภทบันทึก',
            time: 'เวลา',
            op: 'ปฏิบัติการ'
        },
        request: 'ขอข้อมูล',
        error: {
            cancel: 'ยกเลิกการดำเนินการที่ว่างเปล่าแล้ว',
            confirm: 'คุณต้องการล้างบันทึกหรือไม่ (หากว่างบันทึกจะไม่สามารถเรียกคืนได้)'
        },
        success: 'ล้างบันทึกแล้ว'
    },
    comTable: {
        delete: {
            title: 'ล้างการกำหนดค่า'
        },
        columns: {
            title: 'การตั้งค่าคอลัมน์',
            all: 'เลือกทั้งหมด',
            reset: 'รีเซ็ต',
            fixedLeft: 'คงที่ด้านซ้าย',
            fixedRight: 'ขวาคงที่',
            cancelFixed: 'เลิกตรึง'
        },
        size: {
            title: 'ความสูงของแถว',
            small: 'แคบ',
            normal: 'ใน',
            large: 'ความกว้าง'
        },
        fullscreen: 'เต็มจอ',
        unFullscreen: 'ยกเลิกแบบเต็มหน้าจอ'
    },
    normalBtn: {
        detail: 'ดู'
    },
    setting: {
        customEntry: 'รายการด่วน',
        systemSwitch: 'การกำหนดค่าระบบ',
        isMock: 'ไม่ว่าจะเป็น Mock',
        isHotKey: 'ไม่ว่าจะเป็นคีย์ลัด',
        isBreadCrumb: 'ไม่ว่าจะเป็นเกล็ดขนมปัง',
        isCache: 'ไม่ว่าจะแคช',
        isI18n: 'ไม่ว่าจะเป็นสากล'
    },
    pagingInfo: {
        total: 'เบ็ดเสร็จ',
        uint: 'บทความ',
        items: 'การบันทึก'
    }
}
