export default {
    locale: 'uk',
    country: 'UA',
    loginForm: {
        byAccountBtn: 'Логін пароля облікового запису',
        byPhoneBtn: 'Вхід до мобільного номера',
        accountPlaceholder: 'Введіть ім’я користувача',
        passwordPlaceholder: 'Введіть пароль',
        autoLogin: 'автоматичний вхід',
        forgetBtn: 'забути пароль - -',
        loginBtn: 'увійдіть',
        byAccountTip: {
            emptyErr: 'Рахунок не може бути порожнім'
        },
        byPasswordTip: {
            emptyErr: 'пароль не може бути порожнім'
        },
        byValidTip: {
            emptyErr: 'необхідно ввести перевірочний код'
        },
        sendMsg: {
            repeatErr: 'Не надсилайте повторно',
            success: 'Успішні',
            codeTip: 'Ваш код підтвердження:'
        },
        phonePlaceholder: 'Введіть номер телефону',
        validPlaceholder: 'Код підтвердження',
        validBtn: 'отримати код підтвердження',
        loginSuccess: 'вхід успішний'
    },
    menuObj: {
        basicFeature: 'Базова здатність',
        cpUse: 'Використання компонентів',
        childMenu: {
            0: 'Основні рамки',
            1: 'Базова здатність',
            '0-0': 'Vue',
            '0-1': 'Мурашиний дизайн',
            '0-2': 'Біля Admin Vue',
            '1-0': 'Рамкова функція',
            '1-0-0': 'Конфігурація проекту',
            '1-0-1': 'Журнал інтерфейсу',
            '1-0-2': 'Місцевий знущання',
            '1-0-3': 'глобалізація',
            '1-0-4': 'Словник даних',
            '1-0-5': 'EventBus',
            '1-0-6': 'Набір інструментів',
            '1-0-7': 'Управління доступом',
            '1-0-8': 'гаряча клавіша',
            '1-1': 'Функція сторінки',
            '1-1-0': 'Сторінка компонента',
            '1-1-1': 'URL-адреса сторінки',
            '1-1-2': 'Немає сторінки дозволу',
            '1-1-3': '404 сторінка'
        },
        errorTip: {
            notfoundTip: 'Компонент під цим шляхом не знайдено',
            emptyErr: 'Неконфігурований шлях до компонента'
        }
    },
    coreMenuObj: {
        defaultMenu: {
            home: 'Додому'
        }
    },
    sysInfo: {
        sysIntro: 'Корисна середня та внутрішня інтерфейсна розробка на основі Vue та Ant Design'
    },
    requestInfo: {
        withoutUrl: 'Адреса запиту не може бути порожньою',
        networkErr: 'Помилка запиту мережі. Повторіть спробу пізніше'
    },
    localeMap: {
        ar: 'Арабська',
        bg: 'Болгарська',
        ca: 'Каталонська',
        cs: 'Чеська',
        da: 'Датська',
        de: 'Німецька',
        el: 'Грецька',
        'en-gb': 'Англійська',
        en: 'Англійська',
        es: 'Іспанська',
        et: 'Естонська',
        fa: 'Перська',
        fi: 'Фінська',
        fr: 'Французька',
        he: 'Іврит',
        hi: 'Хінді',
        hr: 'Хорватська',
        hu: 'Угорська',
        hy: 'Вірменський',
        id: 'Індонезійська',
        is: 'Ісландський',
        it: 'Італійська ',
        ja: 'Японський',
        kn: 'Каннада',
        ko: 'Корейська',
        'ku-iq': 'Центрально-курдська',
        lv: 'Центрально-курдська',
        mk: 'Македонська',
        'mn-mn': 'Монгольська',
        'ms-my': 'Малайська',
        nb: 'Норвезька',
        'ne-np': 'Непальська',
        'nl-be': 'Фламандський',
        nl: 'Голландська',
        pl: 'Польська',
        'pt-br': 'Бразильська португальська',
        pt: 'Європейська португальська',
        ro: 'Румунська',
        ru: 'російська мова',
        sk: 'Словацька',
        sl: 'Словенська',
        sr: 'Сербська',
        sv: 'Шведська',
        ta: 'Тамільська',
        th: 'Тайська',
        tr: 'Турецька',
        uk: 'Український',
        vi: 'В’єтнамські',
        'zh-cn': 'Спрощена Китайська',
        'zh-tw': 'традиційний китайський'
    },
    tagObj: {
        closeAll: 'Закрийте всі вкладки',
        closeCur: 'Закрити поточну вкладку',
        closeOther: 'Закрийте інші вкладки',
        closeRight: 'Закрийте правою міткою',
        singlePage: 'Незалежна сторінка',
        refreshPage: 'оновити сторінку',
        affixPage: 'Закріпити сторінку',
        cancelAffixPage: 'Відкріпити',
        errorTip: {
            homePageCloseError: 'Домашню сторінку не дозволяється закривати',
            affixPageCloseError: 'Сторінку, що фіксується, не можна закривати',
            homePageAffixError: 'Домашню сторінку не можна відкріпити'
        },
        checkSave: 'Хочете закрити сторінку?(Будь ласка, переконайтесь, що вміст сторінки, позначеної червоним кольором, збережено)',
        cancelClose: 'Операцію закриття скасовано'
    },
    personalCenter: {
        frontendLog: 'Журнал інтерфейсу',
        customSetting: 'Персоналізація',
        customClean: 'Чітка конфігурація',
        cacheClean: 'Очистіть кеш',
        logout: 'вийти з аккаунта',
        errorTip: {
            cleanSuccess: 'Успішно спорожнити'
        }
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'На жаль, відвідана вами сторінка не існує',
            notrightTip: 'На жаль, у вас немає дозволу на доступ до цієї сторінки',
            noserviceTip: 'На жаль, виникла проблема із сервером. Повторіть спробу пізніше'
        },
        btnText: 'Закрити сторінку'
    },
    searchPanel: {
        btn: {
            search: 'Запитайте',
            shrink: 'Прибирати',
            reset: 'Скинути',
            unshrink: 'Розгорнути'
        }
    },
    logline: {
        list: 'Список журналів',
        detail: 'Деталі журналу',
        btnList: {
            export: 'Експорт',
            remove: 'Порожній'
        },
        time: {
            plh: 'Виберіть діапазон часу',
            range: 'термін',
            halfDay: 'Півдня',
            oneDay: 'за один день',
            weekDay: 'протягом тижня',
            monthDay: 'Протягом місяця'
        },
        type: {
            logType: 'Тип журналу',
            plh: 'Виберіть тип журналу'
        },
        tableColumns: {
            index: 'Серійний номер',
            desc: 'Опис журналу',
            type: 'Тип журналу',
            time: 'час',
            op: 'діючий'
        },
        request: 'Запитувати дані',
        error: {
            cancel: 'Порожню операцію скасовано',
            confirm: 'Ви хочете очистити журнал?(Якщо журнал спорожнено, його неможливо отримати)'
        },
        success: 'Журнал спорожнено'
    },
    comTable: {
        columns: {
            title: 'Налаштування стовпців',
            all: 'вибрати все',
            reset: 'Скинути',
            fixedLeft: 'Виправлено ліворуч',
            fixedRight: 'Виправлено право',
            cancelFixed: 'Відкріпити'
        },
        size: {
            title: 'Висота рядка',
            small: 'вузький',
            normal: 'в',
            large: 'ширина'
        },
        fullscreen: 'повноекранний',
        unFullscreen: 'Скасувати повноекранний режим'
    },
    normalBtn: {
        detail: 'Переглянути'
    },
    setting: {
        customEntry: 'Швидкий вхід',
        systemSwitch: 'Системна конфігурація',
        isMock: 'Чи знущання',
        isHotKey: 'Будь то клавіша швидкого доступу',
        isBreadCrumb: 'Чи то хлібні крихти',
        isCache: 'Чи кешувати',
        isI18n: 'Чи потрібно інтернаціоналізувати'
    },
    pagingInfo: {
        total: 'Загалом',
        uint: 'Стаття',
        items: 'запис'
    }
}
