export default {
    locale: 'uk',
    country: 'UA',
    sysInfo: {
        sysIntro: 'Проста у використанні фронтальна рамка розробки, заснована на Vue та Мурашний дизайн'
    },
    loginForm: {
        byAccountBtn: 'Логін пароля облікового запису',
        byPhoneBtn: 'Вхід у телефонний номер',
        accountPlaceholder: 'будь ласка, введіть обліковий запис',
        passwordPlaceholder: 'Введіть пароль',
        autoLogin: 'автоматичний вхід',
        forgetBtn: 'забути пароль',
        loginBtn: 'увійти',
        byAccountTip: {
            emptyErr: 'Обліковий запис не може бути порожнім'
        },
        byPasswordTip: {
            emptyErr: 'порожній пароль не може бути'
        },
        byValidTip: {
            emptyErr: 'Код підтвердження повинен бути заповнений'
        },
        sendMsg: {
            repeatErr: 'Не надсилайте повторно',
            success: 'Отримайте успіх',
            codeTip: 'Ваш код підтвердження'
        },
        phonePlaceholder: 'Введіть номер телефону',
        validPlaceholder: 'Captcha',
        validBtn: 'отримати код підтвердження',
        loginSuccess: 'вхід вдалий'
    },
    requestInfo: {
        withoutUrl: 'Адреса запиту не може бути порожньою',
        networkErr: 'Помилка підключення до мережі. Повторіть спробу пізніше'
    },
    localeMap: {
        ar: 'Арабською',
        bg: 'Болгарка',
        ca: 'Каталонська',
        cs: 'Чеська',
        da: 'Датська',
        de: 'Німецька',
        el: 'Грецька',
        'en-gb': 'Англійська',
        en: 'Англійська',
        es: 'Іспанська',
        et: 'Естонська',
        fa: 'Перська',
        fi: 'Фінська',
        fr: 'Французький',
        he: 'Іврит',
        hi: 'Хінді',
        hr: 'Хорватська',
        hu: 'Угорська',
        hy: 'Вірменська',
        id: 'Індонезійська',
        is: 'Ісландська',
        it: 'Італійська ',
        ja: 'Японці',
        kn: 'Каннада',
        ko: 'Корейська',
        'ku-iq': 'Центральний курдський',
        lv: 'Центральний курдський',
        mk: 'Македонська',
        'mn-mn': 'Монгольська',
        'ms-my': 'Малайська',
        nb: 'Норвезька',
        'ne-np': 'Непалі',
        'nl-be': 'Фламандська',
        nl: 'Голландська',
        pl: 'Польська',
        'pt-br': 'Португальська Бразилія',
        pt: 'Європейська Португальська',
        ro: 'Румунська',
        ru: 'російська мова',
        sk: 'Словацька',
        sl: 'Словенська',
        sr: 'Сербська',
        sv: 'Шведська',
        ta: 'Таміл',
        th: 'Тайська',
        tr: 'Турецька',
        uk: 'Українська',
        vi: 'В’єтнамці',
        'zh-cn': 'Спрощена Китайська',
        'zh-tw': 'традиційний китайський'
    },
    menuObj: {
        basicFeature: 'Основна здатність',
        cpUse: 'Використання компонентів',
        childMenu: {
            0: 'Основні рамки',
            1: 'Основна здатність',
            '0-0': 'Vue',
            '0-1': 'Ant Design',
            '1-0': 'Функція кадру',
            '1-0-0': 'Конфігурація проекту',
            '1-0-1': 'Лицьовий журнал',
            '1-0-2': 'Місцевий макет',
            '1-0-3': 'глобалізація',
            '1-0-4': 'Словник даних',
            '1-0-5': 'EventBus',
            '1-0-6': 'Набір інструментів',
            '1-0-7': 'Управління доступом',
            '1-0-8': 'гаряча клавіша',
            '1-1': 'Функція сторінки',
            '1-1-0': 'Сторінка компонента',
            '1-1-1': 'сторінка URL',
            '1-1-2': 'Немає сторінки дозволу',
            '1-1-3': '404 сторінки'
        },
        defaultMenu: {
            home: 'Головна'
        },
        errorTip: {
            notfoundTip: 'Під цим контуром не знайдено жодного компонента',
            emptyErr: 'Шлях компонента не налаштований'
        }
    },
    tagObj: {
        closeAll: 'Закрийте всі вкладки',
        closeCur: 'Закрийте поточну вкладку',
        closeOther: 'Закрийте інші теги',
        closeRight: 'Закрийте праву етикетку',
        singlePage: 'Незалежна сторінка',
        refreshPage: 'оновити сторінку',
        affixPage: 'Виправлена ​​сторінка',
        cancelAffixPage: 'Відкрутити',
        errorTip: {
            homePageCloseError: 'Не можна закривати домашню сторінку',
            affixPageCloseError: 'Фіксовану сторінку заборонено закривати',
            homePageAffixError: 'Не можна відкріпити домашню сторінку'
        },
        checkSave: 'Ви хочете закрити сторінку?(Переконайтеся, що вміст червоної сторінки етикетки було збережено)',
        cancelClose: 'Закрита операція скасована'
    },
    personalCenter: {
        frontendLog: 'Лицьовий журнал',
        customSetting: 'Персоналізовані налаштування',
        logout: 'вийти з аккаунта'
    },
    errorPage: {
        errorTip: {
            notfoundTip: 'На жаль, сторінки, яку ви відвідали, не існує',
            notrightTip: 'На жаль, у вас немає дозволу на доступ до цієї сторінки',
            noserviceTip: 'На жаль, щось не вдалось із сервером. Повторіть спробу пізніше'
        },
        btnText: 'Закрити сторінку'
    },
    searchPanel: {
        btn: {
            search: 'Запит',
            shrink: 'Згорнути',
            reset: 'Скидання',
            unshrink: 'Розгорнути'
        }
    },
    logline: {
        list: 'Список журналів',
        detail: 'Деталі журналу',
        btnList: {
            export: 'Експорт',
            remove: 'Порожній'
        },
        time: {
            plh: 'Виберіть часовий інтервал',
            range: 'термін',
            halfDay: 'Протягом півдня',
            oneDay: 'за один день',
            weekDay: 'протягом тижня',
            monthDay: 'Протягом одного місяця'
        },
        type: {
            logType: 'Тип журналу',
            plh: 'Виберіть тип журналу'
        },
        tableColumns: {
            index: 'Серійний номер',
            desc: 'Опис журналу',
            type: 'Тип журналу',
            time: 'час',
            op: 'діючі'
        },
        request: 'Запит даних',
        error: {
            cancel: 'Порожню операцію скасовано',
            confirm: 'Ви хочете очистити журнал?(Журнал буде видалено та його неможливо отримати)'
        },
        success: 'Журнал випорожнено'
    },
    comTable: {
        columns: {
            title: 'Налаштування стовпців',
            all: 'вибрати все',
            reset: 'Скидання',
            fixedLeft: 'Виправлений ліворуч',
            fixedRight: 'Фіксований праворуч',
            cancelFixed: 'Відкрутити'
        },
        size: {
            title: 'Висота рядка',
            small: 'вузький',
            normal: 'в',
            large: 'ширина'
        },
        fullscreen: 'повноекранний',
        unFullscreen: 'Скасувати на весь екран'
    },
    normalBtn: {
        detail: 'Вид'
    }
}
